var area = [{
		"id": 1,
		"name": "北京市",
		"pid": 0,
		"children": [{
			"id": 35,
			"name": "北京",
			"pid": 1,
			"children": [{
					"id": 36,
					"name": "东城区",
					"pid": 35
				},
				{
					"id": 37,
					"name": "西城区",
					"pid": 35
				},
				{
					"id": 38,
					"name": "朝阳区",
					"pid": 35
				},
				{
					"id": 39,
					"name": "丰台区",
					"pid": 35
				},
				{
					"id": 40,
					"name": "石景山区",
					"pid": 35
				},
				{
					"id": 41,
					"name": "海淀区",
					"pid": 35
				},
				{
					"id": 42,
					"name": "门头沟区",
					"pid": 35
				},
				{
					"id": 43,
					"name": "房山区",
					"pid": 35
				},
				{
					"id": 44,
					"name": "通州区",
					"pid": 35
				},
				{
					"id": 45,
					"name": "顺义区",
					"pid": 35
				},
				{
					"id": 46,
					"name": "昌平区",
					"pid": 35
				},
				{
					"id": 47,
					"name": "大兴区",
					"pid": 35
				},
				{
					"id": 48,
					"name": "怀柔区",
					"pid": 35
				},
				{
					"id": 49,
					"name": "平谷区",
					"pid": 35
				},
				{
					"id": 50,
					"name": "密云区",
					"pid": 35
				},
				{
					"id": 51,
					"name": "延庆区",
					"pid": 35
				}
			]
		}]
	},
	{
		"id": 2,
		"name": "天津市",
		"pid": 0,
		"children": [{
			"id": 52,
			"name": "天津",
			"pid": 2,
			"children": [{
					"id": 53,
					"name": "和平区",
					"pid": 52
				},
				{
					"id": 54,
					"name": "河东区",
					"pid": 52
				},
				{
					"id": 55,
					"name": "河西区",
					"pid": 52
				},
				{
					"id": 56,
					"name": "南开区",
					"pid": 52
				},
				{
					"id": 57,
					"name": "河北区",
					"pid": 52
				},
				{
					"id": 58,
					"name": "红桥区",
					"pid": 52
				},
				{
					"id": 59,
					"name": "东丽区",
					"pid": 52
				},
				{
					"id": 60,
					"name": "西青区",
					"pid": 52
				},
				{
					"id": 61,
					"name": "津南区",
					"pid": 52
				},
				{
					"id": 62,
					"name": "北辰区",
					"pid": 52
				},
				{
					"id": 63,
					"name": "武清区",
					"pid": 52
				},
				{
					"id": 64,
					"name": "宝坻区",
					"pid": 52
				},
				{
					"id": 65,
					"name": "滨海新区",
					"pid": 52
				},
				{
					"id": 66,
					"name": "宁河区",
					"pid": 52
				},
				{
					"id": 67,
					"name": "静海区",
					"pid": 52
				},
				{
					"id": 68,
					"name": "蓟州区",
					"pid": 52
				}
			]
		}]
	},
	{
		"id": 3,
		"name": "河北省",
		"pid": 0,
		"children": [{
				"id": 69,
				"name": "石家庄市",
				"pid": 3,
				"children": [{
						"id": 80,
						"name": "长安区",
						"pid": 69
					},
					{
						"id": 81,
						"name": "桥西区",
						"pid": 69
					},
					{
						"id": 82,
						"name": "新华区",
						"pid": 69
					},
					{
						"id": 83,
						"name": "井陉矿区",
						"pid": 69
					},
					{
						"id": 84,
						"name": "裕华区",
						"pid": 69
					},
					{
						"id": 85,
						"name": "藁城区",
						"pid": 69
					},
					{
						"id": 86,
						"name": "鹿泉区",
						"pid": 69
					},
					{
						"id": 87,
						"name": "栾城区",
						"pid": 69
					},
					{
						"id": 88,
						"name": "井陉县",
						"pid": 69
					},
					{
						"id": 89,
						"name": "正定县",
						"pid": 69
					},
					{
						"id": 90,
						"name": "行唐县",
						"pid": 69
					},
					{
						"id": 91,
						"name": "灵寿县",
						"pid": 69
					},
					{
						"id": 92,
						"name": "高邑县",
						"pid": 69
					},
					{
						"id": 93,
						"name": "深泽县",
						"pid": 69
					},
					{
						"id": 94,
						"name": "赞皇县",
						"pid": 69
					},
					{
						"id": 95,
						"name": "无极县",
						"pid": 69
					},
					{
						"id": 96,
						"name": "平山县",
						"pid": 69
					},
					{
						"id": 97,
						"name": "元氏县",
						"pid": 69
					},
					{
						"id": 98,
						"name": "赵县",
						"pid": 69
					},
					{
						"id": 99,
						"name": "辛集市",
						"pid": 69
					},
					{
						"id": 100,
						"name": "晋州市",
						"pid": 69
					},
					{
						"id": 101,
						"name": "新乐市",
						"pid": 69
					}
				]
			},
			{
				"id": 70,
				"name": "唐山市",
				"pid": 3,
				"children": [{
						"id": 102,
						"name": "路南区",
						"pid": 70
					},
					{
						"id": 103,
						"name": "路北区",
						"pid": 70
					},
					{
						"id": 104,
						"name": "古冶区",
						"pid": 70
					},
					{
						"id": 105,
						"name": "开平区",
						"pid": 70
					},
					{
						"id": 106,
						"name": "丰南区",
						"pid": 70
					},
					{
						"id": 107,
						"name": "丰润区",
						"pid": 70
					},
					{
						"id": 108,
						"name": "曹妃甸区",
						"pid": 70
					},
					{
						"id": 109,
						"name": "滦县",
						"pid": 70
					},
					{
						"id": 110,
						"name": "滦南县",
						"pid": 70
					},
					{
						"id": 111,
						"name": "乐亭县",
						"pid": 70
					},
					{
						"id": 112,
						"name": "迁西县",
						"pid": 70
					},
					{
						"id": 113,
						"name": "玉田县",
						"pid": 70
					},
					{
						"id": 114,
						"name": "遵化市",
						"pid": 70
					},
					{
						"id": 115,
						"name": "迁安市",
						"pid": 70
					}
				]
			},
			{
				"id": 71,
				"name": "秦皇岛市",
				"pid": 3,
				"children": [{
						"id": 116,
						"name": "海港区",
						"pid": 71
					},
					{
						"id": 117,
						"name": "山海关区",
						"pid": 71
					},
					{
						"id": 118,
						"name": "北戴河区",
						"pid": 71
					},
					{
						"id": 119,
						"name": "抚宁区",
						"pid": 71
					},
					{
						"id": 120,
						"name": "青龙满族自治县",
						"pid": 71
					},
					{
						"id": 121,
						"name": "昌黎县",
						"pid": 71
					},
					{
						"id": 122,
						"name": "卢龙县",
						"pid": 71
					}
				]
			},
			{
				"id": 72,
				"name": "邯郸市",
				"pid": 3,
				"children": [{
						"id": 123,
						"name": "邯山区",
						"pid": 72
					},
					{
						"id": 124,
						"name": "丛台区",
						"pid": 72
					},
					{
						"id": 125,
						"name": "复兴区",
						"pid": 72
					},
					{
						"id": 126,
						"name": "峰峰矿区",
						"pid": 72
					},
					{
						"id": 127,
						"name": "肥乡区",
						"pid": 72
					},
					{
						"id": 128,
						"name": "永年区",
						"pid": 72
					},
					{
						"id": 129,
						"name": "临漳县",
						"pid": 72
					},
					{
						"id": 130,
						"name": "成安县",
						"pid": 72
					},
					{
						"id": 131,
						"name": "大名县",
						"pid": 72
					},
					{
						"id": 132,
						"name": "涉县",
						"pid": 72
					},
					{
						"id": 133,
						"name": "磁县",
						"pid": 72
					},
					{
						"id": 134,
						"name": "邱县",
						"pid": 72
					},
					{
						"id": 135,
						"name": "鸡泽县",
						"pid": 72
					},
					{
						"id": 136,
						"name": "广平县",
						"pid": 72
					},
					{
						"id": 137,
						"name": "馆陶县",
						"pid": 72
					},
					{
						"id": 138,
						"name": "魏县",
						"pid": 72
					},
					{
						"id": 139,
						"name": "曲周县",
						"pid": 72
					},
					{
						"id": 140,
						"name": "武安市",
						"pid": 72
					}
				]
			},
			{
				"id": 73,
				"name": "邢台市",
				"pid": 3,
				"children": [{
						"id": 141,
						"name": "桥东区",
						"pid": 73
					},
					{
						"id": 142,
						"name": "桥西区",
						"pid": 73
					},
					{
						"id": 143,
						"name": "邢台县",
						"pid": 73
					},
					{
						"id": 144,
						"name": "临城县",
						"pid": 73
					},
					{
						"id": 145,
						"name": "内丘县",
						"pid": 73
					},
					{
						"id": 146,
						"name": "柏乡县",
						"pid": 73
					},
					{
						"id": 147,
						"name": "隆尧县",
						"pid": 73
					},
					{
						"id": 148,
						"name": "任县",
						"pid": 73
					},
					{
						"id": 149,
						"name": "南和县",
						"pid": 73
					},
					{
						"id": 150,
						"name": "宁晋县",
						"pid": 73
					},
					{
						"id": 151,
						"name": "巨鹿县",
						"pid": 73
					},
					{
						"id": 152,
						"name": "新河县",
						"pid": 73
					},
					{
						"id": 153,
						"name": "广宗县",
						"pid": 73
					},
					{
						"id": 154,
						"name": "平乡县",
						"pid": 73
					},
					{
						"id": 155,
						"name": "威县",
						"pid": 73
					},
					{
						"id": 156,
						"name": "清河县",
						"pid": 73
					},
					{
						"id": 157,
						"name": "临西县",
						"pid": 73
					},
					{
						"id": 158,
						"name": "南宫市",
						"pid": 73
					},
					{
						"id": 159,
						"name": "沙河市",
						"pid": 73
					}
				]
			},
			{
				"id": 74,
				"name": "保定市",
				"pid": 3,
				"children": [{
						"id": 160,
						"name": "竞秀区",
						"pid": 74
					},
					{
						"id": 161,
						"name": "莲池区",
						"pid": 74
					},
					{
						"id": 162,
						"name": "满城区",
						"pid": 74
					},
					{
						"id": 163,
						"name": "清苑区",
						"pid": 74
					},
					{
						"id": 164,
						"name": "徐水区",
						"pid": 74
					},
					{
						"id": 165,
						"name": "涞水县",
						"pid": 74
					},
					{
						"id": 166,
						"name": "阜平县",
						"pid": 74
					},
					{
						"id": 167,
						"name": "定兴县",
						"pid": 74
					},
					{
						"id": 168,
						"name": "唐县",
						"pid": 74
					},
					{
						"id": 169,
						"name": "高阳县",
						"pid": 74
					},
					{
						"id": 170,
						"name": "容城县",
						"pid": 74
					},
					{
						"id": 171,
						"name": "涞源县",
						"pid": 74
					},
					{
						"id": 172,
						"name": "望都县",
						"pid": 74
					},
					{
						"id": 173,
						"name": "安新县",
						"pid": 74
					},
					{
						"id": 174,
						"name": "易县",
						"pid": 74
					},
					{
						"id": 175,
						"name": "曲阳县",
						"pid": 74
					},
					{
						"id": 176,
						"name": "蠡县",
						"pid": 74
					},
					{
						"id": 177,
						"name": "顺平县",
						"pid": 74
					},
					{
						"id": 178,
						"name": "博野县",
						"pid": 74
					},
					{
						"id": 179,
						"name": "雄县",
						"pid": 74
					},
					{
						"id": 180,
						"name": "涿州市",
						"pid": 74
					},
					{
						"id": 181,
						"name": "定州市",
						"pid": 74
					},
					{
						"id": 182,
						"name": "安国市",
						"pid": 74
					},
					{
						"id": 183,
						"name": "高碑店市",
						"pid": 74
					}
				]
			},
			{
				"id": 75,
				"name": "张家口市",
				"pid": 3,
				"children": [{
						"id": 184,
						"name": "桥东区",
						"pid": 75
					},
					{
						"id": 185,
						"name": "桥西区",
						"pid": 75
					},
					{
						"id": 186,
						"name": "宣化区",
						"pid": 75
					},
					{
						"id": 187,
						"name": "下花园区",
						"pid": 75
					},
					{
						"id": 188,
						"name": "万全区",
						"pid": 75
					},
					{
						"id": 189,
						"name": "崇礼区",
						"pid": 75
					},
					{
						"id": 190,
						"name": "张北县",
						"pid": 75
					},
					{
						"id": 191,
						"name": "康保县",
						"pid": 75
					},
					{
						"id": 192,
						"name": "沽源县",
						"pid": 75
					},
					{
						"id": 193,
						"name": "尚义县",
						"pid": 75
					},
					{
						"id": 194,
						"name": "蔚县",
						"pid": 75
					},
					{
						"id": 195,
						"name": "阳原县",
						"pid": 75
					},
					{
						"id": 196,
						"name": "怀安县",
						"pid": 75
					},
					{
						"id": 197,
						"name": "怀来县",
						"pid": 75
					},
					{
						"id": 198,
						"name": "涿鹿县",
						"pid": 75
					},
					{
						"id": 199,
						"name": "赤城县",
						"pid": 75
					}
				]
			},
			{
				"id": 76,
				"name": "承德市",
				"pid": 3,
				"children": [{
						"id": 200,
						"name": "双桥区",
						"pid": 76
					},
					{
						"id": 201,
						"name": "双滦区",
						"pid": 76
					},
					{
						"id": 202,
						"name": "鹰手营子矿区",
						"pid": 76
					},
					{
						"id": 203,
						"name": "承德县",
						"pid": 76
					},
					{
						"id": 204,
						"name": "兴隆县",
						"pid": 76
					},
					{
						"id": 205,
						"name": "滦平县",
						"pid": 76
					},
					{
						"id": 206,
						"name": "隆化县",
						"pid": 76
					},
					{
						"id": 207,
						"name": "丰宁满族自治县",
						"pid": 76
					},
					{
						"id": 208,
						"name": "宽城满族自治县",
						"pid": 76
					},
					{
						"id": 209,
						"name": "围场满族蒙古族自治县",
						"pid": 76
					},
					{
						"id": 210,
						"name": "平泉市",
						"pid": 76
					}
				]
			},
			{
				"id": 77,
				"name": "沧州市",
				"pid": 3,
				"children": [{
						"id": 211,
						"name": "新华区",
						"pid": 77
					},
					{
						"id": 212,
						"name": "运河区",
						"pid": 77
					},
					{
						"id": 213,
						"name": "沧县",
						"pid": 77
					},
					{
						"id": 214,
						"name": "青县",
						"pid": 77
					},
					{
						"id": 215,
						"name": "东光县",
						"pid": 77
					},
					{
						"id": 216,
						"name": "海兴县",
						"pid": 77
					},
					{
						"id": 217,
						"name": "盐山县",
						"pid": 77
					},
					{
						"id": 218,
						"name": "肃宁县",
						"pid": 77
					},
					{
						"id": 219,
						"name": "南皮县",
						"pid": 77
					},
					{
						"id": 220,
						"name": "吴桥县",
						"pid": 77
					},
					{
						"id": 221,
						"name": "献县",
						"pid": 77
					},
					{
						"id": 222,
						"name": "孟村回族自治县",
						"pid": 77
					},
					{
						"id": 223,
						"name": "泊头市",
						"pid": 77
					},
					{
						"id": 224,
						"name": "任丘市",
						"pid": 77
					},
					{
						"id": 225,
						"name": "黄骅市",
						"pid": 77
					},
					{
						"id": 226,
						"name": "河间市",
						"pid": 77
					}
				]
			},
			{
				"id": 78,
				"name": "廊坊市",
				"pid": 3,
				"children": [{
						"id": 227,
						"name": "安次区",
						"pid": 78
					},
					{
						"id": 228,
						"name": "广阳区",
						"pid": 78
					},
					{
						"id": 229,
						"name": "固安县",
						"pid": 78
					},
					{
						"id": 230,
						"name": "永清县",
						"pid": 78
					},
					{
						"id": 231,
						"name": "香河县",
						"pid": 78
					},
					{
						"id": 232,
						"name": "大城县",
						"pid": 78
					},
					{
						"id": 233,
						"name": "文安县",
						"pid": 78
					},
					{
						"id": 234,
						"name": "大厂回族自治县",
						"pid": 78
					},
					{
						"id": 235,
						"name": "霸州市",
						"pid": 78
					},
					{
						"id": 236,
						"name": "三河市",
						"pid": 78
					}
				]
			},
			{
				"id": 79,
				"name": "衡水市",
				"pid": 3,
				"children": [{
						"id": 237,
						"name": "桃城区",
						"pid": 79
					},
					{
						"id": 238,
						"name": "冀州区",
						"pid": 79
					},
					{
						"id": 239,
						"name": "枣强县",
						"pid": 79
					},
					{
						"id": 240,
						"name": "武邑县",
						"pid": 79
					},
					{
						"id": 241,
						"name": "武强县",
						"pid": 79
					},
					{
						"id": 242,
						"name": "饶阳县",
						"pid": 79
					},
					{
						"id": 243,
						"name": "安平县",
						"pid": 79
					},
					{
						"id": 244,
						"name": "故城县",
						"pid": 79
					},
					{
						"id": 245,
						"name": "景县",
						"pid": 79
					},
					{
						"id": 246,
						"name": "阜城县",
						"pid": 79
					},
					{
						"id": 247,
						"name": "深州市",
						"pid": 79
					}
				]
			}
		]
	},
	{
		"id": 4,
		"name": "山西省",
		"pid": 0,
		"children": [{
				"id": 248,
				"name": "太原市",
				"pid": 4,
				"children": [{
						"id": 259,
						"name": "小店区",
						"pid": 248
					},
					{
						"id": 260,
						"name": "迎泽区",
						"pid": 248
					},
					{
						"id": 261,
						"name": "杏花岭区",
						"pid": 248
					},
					{
						"id": 262,
						"name": "尖草坪区",
						"pid": 248
					},
					{
						"id": 263,
						"name": "万柏林区",
						"pid": 248
					},
					{
						"id": 264,
						"name": "晋源区",
						"pid": 248
					},
					{
						"id": 265,
						"name": "清徐县",
						"pid": 248
					},
					{
						"id": 266,
						"name": "阳曲县",
						"pid": 248
					},
					{
						"id": 267,
						"name": "娄烦县",
						"pid": 248
					},
					{
						"id": 268,
						"name": "古交市",
						"pid": 248
					}
				]
			},
			{
				"id": 249,
				"name": "大同市",
				"pid": 4,
				"children": [{
						"id": 269,
						"name": "城区",
						"pid": 249
					},
					{
						"id": 270,
						"name": "矿区",
						"pid": 249
					},
					{
						"id": 271,
						"name": "南郊区",
						"pid": 249
					},
					{
						"id": 272,
						"name": "新荣区",
						"pid": 249
					},
					{
						"id": 273,
						"name": "阳高县",
						"pid": 249
					},
					{
						"id": 274,
						"name": "天镇县",
						"pid": 249
					},
					{
						"id": 275,
						"name": "广灵县",
						"pid": 249
					},
					{
						"id": 276,
						"name": "灵丘县",
						"pid": 249
					},
					{
						"id": 277,
						"name": "浑源县",
						"pid": 249
					},
					{
						"id": 278,
						"name": "左云县",
						"pid": 249
					},
					{
						"id": 279,
						"name": "大同县",
						"pid": 249
					}
				]
			},
			{
				"id": 250,
				"name": "阳泉市",
				"pid": 4,
				"children": [{
						"id": 280,
						"name": "城区",
						"pid": 250
					},
					{
						"id": 281,
						"name": "矿区",
						"pid": 250
					},
					{
						"id": 282,
						"name": "郊区",
						"pid": 250
					},
					{
						"id": 283,
						"name": "平定县",
						"pid": 250
					},
					{
						"id": 284,
						"name": "盂县",
						"pid": 250
					}
				]
			},
			{
				"id": 251,
				"name": "长治市",
				"pid": 4,
				"children": [{
						"id": 285,
						"name": "城区",
						"pid": 251
					},
					{
						"id": 286,
						"name": "郊区",
						"pid": 251
					},
					{
						"id": 287,
						"name": "长治县",
						"pid": 251
					},
					{
						"id": 288,
						"name": "襄垣县",
						"pid": 251
					},
					{
						"id": 289,
						"name": "屯留县",
						"pid": 251
					},
					{
						"id": 290,
						"name": "平顺县",
						"pid": 251
					},
					{
						"id": 291,
						"name": "黎城县",
						"pid": 251
					},
					{
						"id": 292,
						"name": "壶关县",
						"pid": 251
					},
					{
						"id": 293,
						"name": "长子县",
						"pid": 251
					},
					{
						"id": 294,
						"name": "武乡县",
						"pid": 251
					},
					{
						"id": 295,
						"name": "沁县",
						"pid": 251
					},
					{
						"id": 296,
						"name": "沁源县",
						"pid": 251
					},
					{
						"id": 297,
						"name": "潞城市",
						"pid": 251
					}
				]
			},
			{
				"id": 252,
				"name": "晋城市",
				"pid": 4,
				"children": [{
						"id": 298,
						"name": "城区",
						"pid": 252
					},
					{
						"id": 299,
						"name": "沁水县",
						"pid": 252
					},
					{
						"id": 300,
						"name": "阳城县",
						"pid": 252
					},
					{
						"id": 301,
						"name": "陵川县",
						"pid": 252
					},
					{
						"id": 302,
						"name": "泽州县",
						"pid": 252
					},
					{
						"id": 303,
						"name": "高平市",
						"pid": 252
					}
				]
			},
			{
				"id": 253,
				"name": "朔州市",
				"pid": 4,
				"children": [{
						"id": 304,
						"name": "朔城区",
						"pid": 253
					},
					{
						"id": 305,
						"name": "平鲁区",
						"pid": 253
					},
					{
						"id": 306,
						"name": "山阴县",
						"pid": 253
					},
					{
						"id": 307,
						"name": "应县",
						"pid": 253
					},
					{
						"id": 308,
						"name": "右玉县",
						"pid": 253
					},
					{
						"id": 309,
						"name": "怀仁县",
						"pid": 253
					}
				]
			},
			{
				"id": 254,
				"name": "晋中市",
				"pid": 4,
				"children": [{
						"id": 310,
						"name": "榆次区",
						"pid": 254
					},
					{
						"id": 311,
						"name": "榆社县",
						"pid": 254
					},
					{
						"id": 312,
						"name": "左权县",
						"pid": 254
					},
					{
						"id": 313,
						"name": "和顺县",
						"pid": 254
					},
					{
						"id": 314,
						"name": "昔阳县",
						"pid": 254
					},
					{
						"id": 315,
						"name": "寿阳县",
						"pid": 254
					},
					{
						"id": 316,
						"name": "太谷县",
						"pid": 254
					},
					{
						"id": 317,
						"name": "祁县",
						"pid": 254
					},
					{
						"id": 318,
						"name": "平遥县",
						"pid": 254
					},
					{
						"id": 319,
						"name": "灵石县",
						"pid": 254
					},
					{
						"id": 320,
						"name": "介休市",
						"pid": 254
					}
				]
			},
			{
				"id": 255,
				"name": "运城市",
				"pid": 4,
				"children": [{
						"id": 321,
						"name": "盐湖区",
						"pid": 255
					},
					{
						"id": 322,
						"name": "临猗县",
						"pid": 255
					},
					{
						"id": 323,
						"name": "万荣县",
						"pid": 255
					},
					{
						"id": 324,
						"name": "闻喜县",
						"pid": 255
					},
					{
						"id": 325,
						"name": "稷山县",
						"pid": 255
					},
					{
						"id": 326,
						"name": "新绛县",
						"pid": 255
					},
					{
						"id": 327,
						"name": "绛县",
						"pid": 255
					},
					{
						"id": 328,
						"name": "垣曲县",
						"pid": 255
					},
					{
						"id": 329,
						"name": "夏县",
						"pid": 255
					},
					{
						"id": 330,
						"name": "平陆县",
						"pid": 255
					},
					{
						"id": 331,
						"name": "芮城县",
						"pid": 255
					},
					{
						"id": 332,
						"name": "永济市",
						"pid": 255
					},
					{
						"id": 333,
						"name": "河津市",
						"pid": 255
					}
				]
			},
			{
				"id": 256,
				"name": "忻州市",
				"pid": 4,
				"children": [{
						"id": 334,
						"name": "忻府区",
						"pid": 256
					},
					{
						"id": 335,
						"name": "定襄县",
						"pid": 256
					},
					{
						"id": 336,
						"name": "五台县",
						"pid": 256
					},
					{
						"id": 337,
						"name": "代县",
						"pid": 256
					},
					{
						"id": 338,
						"name": "繁峙县",
						"pid": 256
					},
					{
						"id": 339,
						"name": "宁武县",
						"pid": 256
					},
					{
						"id": 340,
						"name": "静乐县",
						"pid": 256
					},
					{
						"id": 341,
						"name": "神池县",
						"pid": 256
					},
					{
						"id": 342,
						"name": "五寨县",
						"pid": 256
					},
					{
						"id": 343,
						"name": "岢岚县",
						"pid": 256
					},
					{
						"id": 344,
						"name": "河曲县",
						"pid": 256
					},
					{
						"id": 345,
						"name": "保德县",
						"pid": 256
					},
					{
						"id": 346,
						"name": "偏关县",
						"pid": 256
					},
					{
						"id": 347,
						"name": "原平市",
						"pid": 256
					}
				]
			},
			{
				"id": 257,
				"name": "临汾市",
				"pid": 4,
				"children": [{
						"id": 348,
						"name": "尧都区",
						"pid": 257
					},
					{
						"id": 349,
						"name": "曲沃县",
						"pid": 257
					},
					{
						"id": 350,
						"name": "翼城县",
						"pid": 257
					},
					{
						"id": 351,
						"name": "襄汾县",
						"pid": 257
					},
					{
						"id": 352,
						"name": "洪洞县",
						"pid": 257
					},
					{
						"id": 353,
						"name": "古县",
						"pid": 257
					},
					{
						"id": 354,
						"name": "安泽县",
						"pid": 257
					},
					{
						"id": 355,
						"name": "浮山县",
						"pid": 257
					},
					{
						"id": 356,
						"name": "吉县",
						"pid": 257
					},
					{
						"id": 357,
						"name": "乡宁县",
						"pid": 257
					},
					{
						"id": 358,
						"name": "大宁县",
						"pid": 257
					},
					{
						"id": 359,
						"name": "隰县",
						"pid": 257
					},
					{
						"id": 360,
						"name": "永和县",
						"pid": 257
					},
					{
						"id": 361,
						"name": "蒲县",
						"pid": 257
					},
					{
						"id": 362,
						"name": "汾西县",
						"pid": 257
					},
					{
						"id": 363,
						"name": "侯马市",
						"pid": 257
					},
					{
						"id": 364,
						"name": "霍州市",
						"pid": 257
					}
				]
			},
			{
				"id": 258,
				"name": "吕梁市",
				"pid": 4,
				"children": [{
						"id": 365,
						"name": "离石区",
						"pid": 258
					},
					{
						"id": 366,
						"name": "文水县",
						"pid": 258
					},
					{
						"id": 367,
						"name": "交城县",
						"pid": 258
					},
					{
						"id": 368,
						"name": "兴县",
						"pid": 258
					},
					{
						"id": 369,
						"name": "临县",
						"pid": 258
					},
					{
						"id": 370,
						"name": "柳林县",
						"pid": 258
					},
					{
						"id": 371,
						"name": "石楼县",
						"pid": 258
					},
					{
						"id": 372,
						"name": "岚县",
						"pid": 258
					},
					{
						"id": 373,
						"name": "方山县",
						"pid": 258
					},
					{
						"id": 374,
						"name": "中阳县",
						"pid": 258
					},
					{
						"id": 375,
						"name": "交口县",
						"pid": 258
					},
					{
						"id": 376,
						"name": "孝义市",
						"pid": 258
					},
					{
						"id": 377,
						"name": "汾阳市",
						"pid": 258
					}
				]
			}
		]
	},
	{
		"id": 5,
		"name": "内蒙古自治区",
		"pid": 0,
		"children": [{
				"id": 378,
				"name": "呼和浩特市",
				"pid": 5,
				"children": [{
						"id": 390,
						"name": "新城区",
						"pid": 378
					},
					{
						"id": 391,
						"name": "回民区",
						"pid": 378
					},
					{
						"id": 392,
						"name": "玉泉区",
						"pid": 378
					},
					{
						"id": 393,
						"name": "赛罕区",
						"pid": 378
					},
					{
						"id": 394,
						"name": "土默特左旗",
						"pid": 378
					},
					{
						"id": 395,
						"name": "托克托县",
						"pid": 378
					},
					{
						"id": 396,
						"name": "和林格尔县",
						"pid": 378
					},
					{
						"id": 397,
						"name": "清水河县",
						"pid": 378
					},
					{
						"id": 398,
						"name": "武川县",
						"pid": 378
					}
				]
			},
			{
				"id": 379,
				"name": "包头市",
				"pid": 5,
				"children": [{
						"id": 399,
						"name": "东河区",
						"pid": 379
					},
					{
						"id": 400,
						"name": "昆都仑区",
						"pid": 379
					},
					{
						"id": 401,
						"name": "青山区",
						"pid": 379
					},
					{
						"id": 402,
						"name": "石拐区",
						"pid": 379
					},
					{
						"id": 403,
						"name": "白云鄂博矿区",
						"pid": 379
					},
					{
						"id": 404,
						"name": "九原区",
						"pid": 379
					},
					{
						"id": 405,
						"name": "土默特右旗",
						"pid": 379
					},
					{
						"id": 406,
						"name": "固阳县",
						"pid": 379
					},
					{
						"id": 407,
						"name": "达尔罕茂明安联合旗",
						"pid": 379
					}
				]
			},
			{
				"id": 380,
				"name": "乌海市",
				"pid": 5,
				"children": [{
						"id": 408,
						"name": "海勃湾区",
						"pid": 380
					},
					{
						"id": 409,
						"name": "海南区",
						"pid": 380
					},
					{
						"id": 410,
						"name": "乌达区",
						"pid": 380
					}
				]
			},
			{
				"id": 381,
				"name": "赤峰市",
				"pid": 5,
				"children": [{
						"id": 411,
						"name": "红山区",
						"pid": 381
					},
					{
						"id": 412,
						"name": "元宝山区",
						"pid": 381
					},
					{
						"id": 413,
						"name": "松山区",
						"pid": 381
					},
					{
						"id": 414,
						"name": "阿鲁科尔沁旗",
						"pid": 381
					},
					{
						"id": 415,
						"name": "巴林左旗",
						"pid": 381
					},
					{
						"id": 416,
						"name": "巴林右旗",
						"pid": 381
					},
					{
						"id": 417,
						"name": "林西县",
						"pid": 381
					},
					{
						"id": 418,
						"name": "克什克腾旗",
						"pid": 381
					},
					{
						"id": 419,
						"name": "翁牛特旗",
						"pid": 381
					},
					{
						"id": 420,
						"name": "喀喇沁旗",
						"pid": 381
					},
					{
						"id": 421,
						"name": "宁城县",
						"pid": 381
					},
					{
						"id": 422,
						"name": "敖汉旗",
						"pid": 381
					}
				]
			},
			{
				"id": 382,
				"name": "通辽市",
				"pid": 5,
				"children": [{
						"id": 423,
						"name": "科尔沁区",
						"pid": 382
					},
					{
						"id": 424,
						"name": "科尔沁左翼中旗",
						"pid": 382
					},
					{
						"id": 425,
						"name": "科尔沁左翼后旗",
						"pid": 382
					},
					{
						"id": 426,
						"name": "开鲁县",
						"pid": 382
					},
					{
						"id": 427,
						"name": "库伦旗",
						"pid": 382
					},
					{
						"id": 428,
						"name": "奈曼旗",
						"pid": 382
					},
					{
						"id": 429,
						"name": "扎鲁特旗",
						"pid": 382
					},
					{
						"id": 430,
						"name": "霍林郭勒市",
						"pid": 382
					}
				]
			},
			{
				"id": 383,
				"name": "鄂尔多斯市",
				"pid": 5,
				"children": [{
						"id": 431,
						"name": "东胜区",
						"pid": 383
					},
					{
						"id": 432,
						"name": "康巴什区",
						"pid": 383
					},
					{
						"id": 433,
						"name": "达拉特旗",
						"pid": 383
					},
					{
						"id": 434,
						"name": "准格尔旗",
						"pid": 383
					},
					{
						"id": 435,
						"name": "鄂托克前旗",
						"pid": 383
					},
					{
						"id": 436,
						"name": "鄂托克旗",
						"pid": 383
					},
					{
						"id": 437,
						"name": "杭锦旗",
						"pid": 383
					},
					{
						"id": 438,
						"name": "乌审旗",
						"pid": 383
					},
					{
						"id": 439,
						"name": "伊金霍洛旗",
						"pid": 383
					}
				]
			},
			{
				"id": 384,
				"name": "呼伦贝尔市",
				"pid": 5,
				"children": [{
						"id": 440,
						"name": "海拉尔区",
						"pid": 384
					},
					{
						"id": 441,
						"name": "扎赉诺尔区",
						"pid": 384
					},
					{
						"id": 442,
						"name": "阿荣旗",
						"pid": 384
					},
					{
						"id": 443,
						"name": "莫力达瓦达斡尔族自治旗",
						"pid": 384
					},
					{
						"id": 444,
						"name": "鄂伦春自治旗",
						"pid": 384
					},
					{
						"id": 445,
						"name": "鄂温克族自治旗",
						"pid": 384
					},
					{
						"id": 446,
						"name": "陈巴尔虎旗",
						"pid": 384
					},
					{
						"id": 447,
						"name": "新巴尔虎左旗",
						"pid": 384
					},
					{
						"id": 448,
						"name": "新巴尔虎右旗",
						"pid": 384
					},
					{
						"id": 449,
						"name": "满洲里市",
						"pid": 384
					},
					{
						"id": 450,
						"name": "牙克石市",
						"pid": 384
					},
					{
						"id": 451,
						"name": "扎兰屯市",
						"pid": 384
					},
					{
						"id": 452,
						"name": "额尔古纳市",
						"pid": 384
					},
					{
						"id": 453,
						"name": "根河市",
						"pid": 384
					}
				]
			},
			{
				"id": 385,
				"name": "巴彦淖尔市",
				"pid": 5,
				"children": [{
						"id": 454,
						"name": "临河区",
						"pid": 385
					},
					{
						"id": 455,
						"name": "五原县",
						"pid": 385
					},
					{
						"id": 456,
						"name": "磴口县",
						"pid": 385
					},
					{
						"id": 457,
						"name": "乌拉特前旗",
						"pid": 385
					},
					{
						"id": 458,
						"name": "乌拉特中旗",
						"pid": 385
					},
					{
						"id": 459,
						"name": "乌拉特后旗",
						"pid": 385
					},
					{
						"id": 460,
						"name": "杭锦后旗",
						"pid": 385
					}
				]
			},
			{
				"id": 386,
				"name": "乌兰察布市",
				"pid": 5,
				"children": [{
						"id": 461,
						"name": "集宁区",
						"pid": 386
					},
					{
						"id": 462,
						"name": "卓资县",
						"pid": 386
					},
					{
						"id": 463,
						"name": "化德县",
						"pid": 386
					},
					{
						"id": 464,
						"name": "商都县",
						"pid": 386
					},
					{
						"id": 465,
						"name": "兴和县",
						"pid": 386
					},
					{
						"id": 466,
						"name": "凉城县",
						"pid": 386
					},
					{
						"id": 467,
						"name": "察哈尔右翼前旗",
						"pid": 386
					},
					{
						"id": 468,
						"name": "察哈尔右翼中旗",
						"pid": 386
					},
					{
						"id": 469,
						"name": "察哈尔右翼后旗",
						"pid": 386
					},
					{
						"id": 470,
						"name": "四子王旗",
						"pid": 386
					},
					{
						"id": 471,
						"name": "丰镇市",
						"pid": 386
					}
				]
			},
			{
				"id": 387,
				"name": "兴安盟",
				"pid": 5,
				"children": [{
						"id": 472,
						"name": "乌兰浩特市",
						"pid": 387
					},
					{
						"id": 473,
						"name": "阿尔山市",
						"pid": 387
					},
					{
						"id": 474,
						"name": "科尔沁右翼前旗",
						"pid": 387
					},
					{
						"id": 475,
						"name": "科尔沁右翼中旗",
						"pid": 387
					},
					{
						"id": 476,
						"name": "扎赉特旗",
						"pid": 387
					},
					{
						"id": 477,
						"name": "突泉县",
						"pid": 387
					}
				]
			},
			{
				"id": 388,
				"name": "锡林郭勒盟",
				"pid": 5,
				"children": [{
						"id": 478,
						"name": "二连浩特市",
						"pid": 388
					},
					{
						"id": 479,
						"name": "锡林浩特市",
						"pid": 388
					},
					{
						"id": 480,
						"name": "阿巴嘎旗",
						"pid": 388
					},
					{
						"id": 481,
						"name": "苏尼特左旗",
						"pid": 388
					},
					{
						"id": 482,
						"name": "苏尼特右旗",
						"pid": 388
					},
					{
						"id": 483,
						"name": "东乌珠穆沁旗",
						"pid": 388
					},
					{
						"id": 484,
						"name": "西乌珠穆沁旗",
						"pid": 388
					},
					{
						"id": 485,
						"name": "太仆寺旗",
						"pid": 388
					},
					{
						"id": 486,
						"name": "镶黄旗",
						"pid": 388
					},
					{
						"id": 487,
						"name": "正镶白旗",
						"pid": 388
					},
					{
						"id": 488,
						"name": "正蓝旗",
						"pid": 388
					},
					{
						"id": 489,
						"name": "多伦县",
						"pid": 388
					}
				]
			},
			{
				"id": 389,
				"name": "阿拉善盟",
				"pid": 5,
				"children": [{
						"id": 490,
						"name": "阿拉善左旗",
						"pid": 389
					},
					{
						"id": 491,
						"name": "阿拉善右旗",
						"pid": 389
					},
					{
						"id": 492,
						"name": "额济纳旗",
						"pid": 389
					}
				]
			}
		]
	},
	{
		"id": 6,
		"name": "辽宁省",
		"pid": 0,
		"children": [{
				"id": 493,
				"name": "沈阳市",
				"pid": 6,
				"children": [{
						"id": 507,
						"name": "和平区",
						"pid": 493
					},
					{
						"id": 508,
						"name": "沈河区",
						"pid": 493
					},
					{
						"id": 509,
						"name": "大东区",
						"pid": 493
					},
					{
						"id": 510,
						"name": "皇姑区",
						"pid": 493
					},
					{
						"id": 511,
						"name": "铁西区",
						"pid": 493
					},
					{
						"id": 512,
						"name": "苏家屯区",
						"pid": 493
					},
					{
						"id": 513,
						"name": "浑南区",
						"pid": 493
					},
					{
						"id": 514,
						"name": "沈北新区",
						"pid": 493
					},
					{
						"id": 515,
						"name": "于洪区",
						"pid": 493
					},
					{
						"id": 516,
						"name": "辽中区",
						"pid": 493
					},
					{
						"id": 517,
						"name": "康平县",
						"pid": 493
					},
					{
						"id": 518,
						"name": "法库县",
						"pid": 493
					},
					{
						"id": 519,
						"name": "新民市",
						"pid": 493
					}
				]
			},
			{
				"id": 494,
				"name": "大连市",
				"pid": 6,
				"children": [{
						"id": 520,
						"name": "中山区",
						"pid": 494
					},
					{
						"id": 521,
						"name": "西岗区",
						"pid": 494
					},
					{
						"id": 522,
						"name": "沙河口区",
						"pid": 494
					},
					{
						"id": 523,
						"name": "甘井子区",
						"pid": 494
					},
					{
						"id": 524,
						"name": "旅顺口区",
						"pid": 494
					},
					{
						"id": 525,
						"name": "金州区",
						"pid": 494
					},
					{
						"id": 526,
						"name": "普兰店区",
						"pid": 494
					},
					{
						"id": 527,
						"name": "长海县",
						"pid": 494
					},
					{
						"id": 528,
						"name": "瓦房店市",
						"pid": 494
					},
					{
						"id": 529,
						"name": "庄河市",
						"pid": 494
					}
				]
			},
			{
				"id": 495,
				"name": "鞍山市",
				"pid": 6,
				"children": [{
						"id": 530,
						"name": "铁东区",
						"pid": 495
					},
					{
						"id": 531,
						"name": "铁西区",
						"pid": 495
					},
					{
						"id": 532,
						"name": "立山区",
						"pid": 495
					},
					{
						"id": 533,
						"name": "千山区",
						"pid": 495
					},
					{
						"id": 534,
						"name": "台安县",
						"pid": 495
					},
					{
						"id": 535,
						"name": "岫岩满族自治县",
						"pid": 495
					},
					{
						"id": 536,
						"name": "海城市",
						"pid": 495
					}
				]
			},
			{
				"id": 496,
				"name": "抚顺市",
				"pid": 6,
				"children": [{
						"id": 537,
						"name": "新抚区",
						"pid": 496
					},
					{
						"id": 538,
						"name": "东洲区",
						"pid": 496
					},
					{
						"id": 539,
						"name": "望花区",
						"pid": 496
					},
					{
						"id": 540,
						"name": "顺城区",
						"pid": 496
					},
					{
						"id": 541,
						"name": "抚顺县",
						"pid": 496
					},
					{
						"id": 542,
						"name": "新宾满族自治县",
						"pid": 496
					},
					{
						"id": 543,
						"name": "清原满族自治县",
						"pid": 496
					}
				]
			},
			{
				"id": 497,
				"name": "本溪市",
				"pid": 6,
				"children": [{
						"id": 544,
						"name": "平山区",
						"pid": 497
					},
					{
						"id": 545,
						"name": "溪湖区",
						"pid": 497
					},
					{
						"id": 546,
						"name": "明山区",
						"pid": 497
					},
					{
						"id": 547,
						"name": "南芬区",
						"pid": 497
					},
					{
						"id": 548,
						"name": "本溪满族自治县",
						"pid": 497
					},
					{
						"id": 549,
						"name": "桓仁满族自治县",
						"pid": 497
					}
				]
			},
			{
				"id": 498,
				"name": "丹东市",
				"pid": 6,
				"children": [{
						"id": 550,
						"name": "元宝区",
						"pid": 498
					},
					{
						"id": 551,
						"name": "振兴区",
						"pid": 498
					},
					{
						"id": 552,
						"name": "振安区",
						"pid": 498
					},
					{
						"id": 553,
						"name": "宽甸满族自治县",
						"pid": 498
					},
					{
						"id": 554,
						"name": "东港市",
						"pid": 498
					},
					{
						"id": 555,
						"name": "凤城市",
						"pid": 498
					}
				]
			},
			{
				"id": 499,
				"name": "锦州市",
				"pid": 6,
				"children": [{
						"id": 556,
						"name": "古塔区",
						"pid": 499
					},
					{
						"id": 557,
						"name": "凌河区",
						"pid": 499
					},
					{
						"id": 558,
						"name": "太和区",
						"pid": 499
					},
					{
						"id": 559,
						"name": "黑山县",
						"pid": 499
					},
					{
						"id": 560,
						"name": "义县",
						"pid": 499
					},
					{
						"id": 561,
						"name": "凌海市",
						"pid": 499
					},
					{
						"id": 562,
						"name": "北镇市",
						"pid": 499
					}
				]
			},
			{
				"id": 500,
				"name": "营口市",
				"pid": 6,
				"children": [{
						"id": 563,
						"name": "站前区",
						"pid": 500
					},
					{
						"id": 564,
						"name": "西市区",
						"pid": 500
					},
					{
						"id": 565,
						"name": "鲅鱼圈区",
						"pid": 500
					},
					{
						"id": 566,
						"name": "老边区",
						"pid": 500
					},
					{
						"id": 567,
						"name": "盖州市",
						"pid": 500
					},
					{
						"id": 568,
						"name": "大石桥市",
						"pid": 500
					}
				]
			},
			{
				"id": 501,
				"name": "阜新市",
				"pid": 6,
				"children": [{
						"id": 569,
						"name": "海州区",
						"pid": 501
					},
					{
						"id": 570,
						"name": "新邱区",
						"pid": 501
					},
					{
						"id": 571,
						"name": "太平区",
						"pid": 501
					},
					{
						"id": 572,
						"name": "清河门区",
						"pid": 501
					},
					{
						"id": 573,
						"name": "细河区",
						"pid": 501
					},
					{
						"id": 574,
						"name": "阜新蒙古族自治县",
						"pid": 501
					}
				]
			},
			{
				"id": 502,
				"name": "辽阳市",
				"pid": 6,
				"children": [{
						"id": 575,
						"name": "白塔区",
						"pid": 502
					},
					{
						"id": 576,
						"name": "文圣区",
						"pid": 502
					},
					{
						"id": 577,
						"name": "宏伟区",
						"pid": 502
					},
					{
						"id": 578,
						"name": "弓长岭区",
						"pid": 502
					},
					{
						"id": 579,
						"name": "太子河区",
						"pid": 502
					},
					{
						"id": 580,
						"name": "辽阳县",
						"pid": 502
					},
					{
						"id": 581,
						"name": "灯塔市",
						"pid": 502
					}
				]
			},
			{
				"id": 503,
				"name": "盘锦市",
				"pid": 6,
				"children": [{
						"id": 582,
						"name": "双台子区",
						"pid": 503
					},
					{
						"id": 583,
						"name": "兴隆台区",
						"pid": 503
					},
					{
						"id": 584,
						"name": "大洼区",
						"pid": 503
					},
					{
						"id": 585,
						"name": "盘山县",
						"pid": 503
					}
				]
			},
			{
				"id": 504,
				"name": "铁岭市",
				"pid": 6,
				"children": [{
						"id": 586,
						"name": "银州区",
						"pid": 504
					},
					{
						"id": 587,
						"name": "清河区",
						"pid": 504
					},
					{
						"id": 588,
						"name": "铁岭县",
						"pid": 504
					},
					{
						"id": 589,
						"name": "西丰县",
						"pid": 504
					},
					{
						"id": 590,
						"name": "昌图县",
						"pid": 504
					},
					{
						"id": 591,
						"name": "调兵山市",
						"pid": 504
					},
					{
						"id": 592,
						"name": "开原市",
						"pid": 504
					}
				]
			},
			{
				"id": 505,
				"name": "朝阳市",
				"pid": 6,
				"children": [{
						"id": 593,
						"name": "双塔区",
						"pid": 505
					},
					{
						"id": 594,
						"name": "龙城区",
						"pid": 505
					},
					{
						"id": 595,
						"name": "朝阳县",
						"pid": 505
					},
					{
						"id": 596,
						"name": "建平县",
						"pid": 505
					},
					{
						"id": 597,
						"name": "喀喇沁左翼蒙古族自治县",
						"pid": 505
					},
					{
						"id": 598,
						"name": "北票市",
						"pid": 505
					},
					{
						"id": 599,
						"name": "凌源市",
						"pid": 505
					}
				]
			},
			{
				"id": 506,
				"name": "葫芦岛市",
				"pid": 6,
				"children": [{
						"id": 600,
						"name": "连山区",
						"pid": 506
					},
					{
						"id": 601,
						"name": "龙港区",
						"pid": 506
					},
					{
						"id": 602,
						"name": "南票区",
						"pid": 506
					},
					{
						"id": 603,
						"name": "绥中县",
						"pid": 506
					},
					{
						"id": 604,
						"name": "建昌县",
						"pid": 506
					},
					{
						"id": 605,
						"name": "兴城市",
						"pid": 506
					}
				]
			}
		]
	},
	{
		"id": 7,
		"name": "吉林省",
		"pid": 0,
		"children": [{
				"id": 606,
				"name": "长春市",
				"pid": 7,
				"children": [{
						"id": 607,
						"name": "南关区",
						"pid": 606
					},
					{
						"id": 608,
						"name": "宽城区",
						"pid": 606
					},
					{
						"id": 609,
						"name": "朝阳区",
						"pid": 606
					},
					{
						"id": 610,
						"name": "二道区",
						"pid": 606
					},
					{
						"id": 611,
						"name": "绿园区",
						"pid": 606
					},
					{
						"id": 612,
						"name": "双阳区",
						"pid": 606
					},
					{
						"id": 613,
						"name": "九台区",
						"pid": 606
					},
					{
						"id": 614,
						"name": "农安县",
						"pid": 606
					},
					{
						"id": 615,
						"name": "榆树市",
						"pid": 606
					},
					{
						"id": 616,
						"name": "德惠市",
						"pid": 606
					}
				]
			},
			{
				"id": 617,
				"name": "吉林市",
				"pid": 7,
				"children": [{
						"id": 618,
						"name": "昌邑区",
						"pid": 617
					},
					{
						"id": 619,
						"name": "龙潭区",
						"pid": 617
					},
					{
						"id": 620,
						"name": "船营区",
						"pid": 617
					},
					{
						"id": 621,
						"name": "丰满区",
						"pid": 617
					},
					{
						"id": 622,
						"name": "永吉县",
						"pid": 617
					},
					{
						"id": 623,
						"name": "蛟河市",
						"pid": 617
					},
					{
						"id": 624,
						"name": "桦甸市",
						"pid": 617
					},
					{
						"id": 625,
						"name": "舒兰市",
						"pid": 617
					},
					{
						"id": 626,
						"name": "磐石市",
						"pid": 617
					}
				]
			},
			{
				"id": 627,
				"name": "四平市",
				"pid": 7,
				"children": [{
						"id": 628,
						"name": "铁西区",
						"pid": 627
					},
					{
						"id": 629,
						"name": "铁东区",
						"pid": 627
					},
					{
						"id": 630,
						"name": "梨树县",
						"pid": 627
					},
					{
						"id": 631,
						"name": "伊通满族自治县",
						"pid": 627
					},
					{
						"id": 632,
						"name": "公主岭市",
						"pid": 627
					},
					{
						"id": 633,
						"name": "双辽市",
						"pid": 627
					}
				]
			},
			{
				"id": 634,
				"name": "辽源市",
				"pid": 7,
				"children": [{
						"id": 635,
						"name": "龙山区",
						"pid": 634
					},
					{
						"id": 636,
						"name": "西安区",
						"pid": 634
					},
					{
						"id": 637,
						"name": "东丰县",
						"pid": 634
					},
					{
						"id": 638,
						"name": "东辽县",
						"pid": 634
					}
				]
			},
			{
				"id": 639,
				"name": "通化市",
				"pid": 7,
				"children": [{
						"id": 640,
						"name": "东昌区",
						"pid": 639
					},
					{
						"id": 641,
						"name": "二道江区",
						"pid": 639
					},
					{
						"id": 642,
						"name": "通化县",
						"pid": 639
					},
					{
						"id": 643,
						"name": "辉南县",
						"pid": 639
					},
					{
						"id": 644,
						"name": "柳河县",
						"pid": 639
					},
					{
						"id": 645,
						"name": "梅河口市",
						"pid": 639
					},
					{
						"id": 646,
						"name": "集安市",
						"pid": 639
					}
				]
			},
			{
				"id": 647,
				"name": "白山市",
				"pid": 7,
				"children": [{
						"id": 648,
						"name": "浑江区",
						"pid": 647
					},
					{
						"id": 649,
						"name": "江源区",
						"pid": 647
					},
					{
						"id": 650,
						"name": "抚松县",
						"pid": 647
					},
					{
						"id": 651,
						"name": "靖宇县",
						"pid": 647
					},
					{
						"id": 652,
						"name": "长白朝鲜族自治县",
						"pid": 647
					},
					{
						"id": 653,
						"name": "临江市",
						"pid": 647
					}
				]
			},
			{
				"id": 654,
				"name": "松原市",
				"pid": 7,
				"children": [{
						"id": 655,
						"name": "宁江区",
						"pid": 654
					},
					{
						"id": 656,
						"name": "前郭尔罗斯蒙古族自治县",
						"pid": 654
					},
					{
						"id": 657,
						"name": "长岭县",
						"pid": 654
					},
					{
						"id": 658,
						"name": "乾安县",
						"pid": 654
					},
					{
						"id": 659,
						"name": "扶余市",
						"pid": 654
					}
				]
			},
			{
				"id": 660,
				"name": "白城市",
				"pid": 7,
				"children": [{
						"id": 661,
						"name": "洮北区",
						"pid": 660
					},
					{
						"id": 662,
						"name": "镇赉县",
						"pid": 660
					},
					{
						"id": 663,
						"name": "通榆县",
						"pid": 660
					},
					{
						"id": 664,
						"name": "洮南市",
						"pid": 660
					},
					{
						"id": 665,
						"name": "大安市",
						"pid": 660
					}
				]
			},
			{
				"id": 666,
				"name": "延边朝鲜族自治州",
				"pid": 7,
				"children": [{
						"id": 667,
						"name": "延吉市",
						"pid": 666
					},
					{
						"id": 668,
						"name": "图们市",
						"pid": 666
					},
					{
						"id": 669,
						"name": "敦化市",
						"pid": 666
					},
					{
						"id": 670,
						"name": "珲春市",
						"pid": 666
					},
					{
						"id": 671,
						"name": "龙井市",
						"pid": 666
					},
					{
						"id": 672,
						"name": "和龙市",
						"pid": 666
					},
					{
						"id": 673,
						"name": "汪清县",
						"pid": 666
					},
					{
						"id": 674,
						"name": "安图县",
						"pid": 666
					}
				]
			}
		]
	},
	{
		"id": 8,
		"name": "黑龙江省",
		"pid": 0,
		"children": [{
				"id": 675,
				"name": "哈尔滨市",
				"pid": 8,
				"children": [{
						"id": 676,
						"name": "道里区",
						"pid": 675
					},
					{
						"id": 677,
						"name": "南岗区",
						"pid": 675
					},
					{
						"id": 678,
						"name": "道外区",
						"pid": 675
					},
					{
						"id": 679,
						"name": "平房区",
						"pid": 675
					},
					{
						"id": 680,
						"name": "松北区",
						"pid": 675
					},
					{
						"id": 681,
						"name": "香坊区",
						"pid": 675
					},
					{
						"id": 682,
						"name": "呼兰区",
						"pid": 675
					},
					{
						"id": 683,
						"name": "阿城区",
						"pid": 675
					},
					{
						"id": 684,
						"name": "双城区",
						"pid": 675
					},
					{
						"id": 685,
						"name": "依兰县",
						"pid": 675
					},
					{
						"id": 686,
						"name": "方正县",
						"pid": 675
					},
					{
						"id": 687,
						"name": "宾县",
						"pid": 675
					},
					{
						"id": 688,
						"name": "巴彦县",
						"pid": 675
					},
					{
						"id": 689,
						"name": "木兰县",
						"pid": 675
					},
					{
						"id": 690,
						"name": "通河县",
						"pid": 675
					},
					{
						"id": 691,
						"name": "延寿县",
						"pid": 675
					},
					{
						"id": 692,
						"name": "尚志市",
						"pid": 675
					},
					{
						"id": 693,
						"name": "五常市",
						"pid": 675
					}
				]
			},
			{
				"id": 694,
				"name": "齐齐哈尔市",
				"pid": 8,
				"children": [{
						"id": 695,
						"name": "龙沙区",
						"pid": 694
					},
					{
						"id": 696,
						"name": "建华区",
						"pid": 694
					},
					{
						"id": 697,
						"name": "铁锋区",
						"pid": 694
					},
					{
						"id": 698,
						"name": "昂昂溪区",
						"pid": 694
					},
					{
						"id": 699,
						"name": "富拉尔基区",
						"pid": 694
					},
					{
						"id": 700,
						"name": "碾子山区",
						"pid": 694
					},
					{
						"id": 701,
						"name": "梅里斯达斡尔族区",
						"pid": 694
					},
					{
						"id": 702,
						"name": "龙江县",
						"pid": 694
					},
					{
						"id": 703,
						"name": "依安县",
						"pid": 694
					},
					{
						"id": 704,
						"name": "泰来县",
						"pid": 694
					},
					{
						"id": 705,
						"name": "甘南县",
						"pid": 694
					},
					{
						"id": 706,
						"name": "富裕县",
						"pid": 694
					},
					{
						"id": 707,
						"name": "克山县",
						"pid": 694
					},
					{
						"id": 708,
						"name": "克东县",
						"pid": 694
					},
					{
						"id": 709,
						"name": "拜泉县",
						"pid": 694
					},
					{
						"id": 710,
						"name": "讷河市",
						"pid": 694
					}
				]
			},
			{
				"id": 711,
				"name": "鸡西市",
				"pid": 8,
				"children": [{
						"id": 712,
						"name": "鸡冠区",
						"pid": 711
					},
					{
						"id": 713,
						"name": "恒山区",
						"pid": 711
					},
					{
						"id": 714,
						"name": "滴道区",
						"pid": 711
					},
					{
						"id": 715,
						"name": "梨树区",
						"pid": 711
					},
					{
						"id": 716,
						"name": "城子河区",
						"pid": 711
					},
					{
						"id": 717,
						"name": "麻山区",
						"pid": 711
					},
					{
						"id": 718,
						"name": "鸡东县",
						"pid": 711
					},
					{
						"id": 719,
						"name": "虎林市",
						"pid": 711
					},
					{
						"id": 720,
						"name": "密山市",
						"pid": 711
					},
					{
						"id": 721,
						"name": "鹤岗市",
						"pid": 711
					},
					{
						"id": 722,
						"name": "向阳区",
						"pid": 711
					},
					{
						"id": 723,
						"name": "工农区",
						"pid": 711
					},
					{
						"id": 724,
						"name": "南山区",
						"pid": 711
					},
					{
						"id": 725,
						"name": "兴安区",
						"pid": 711
					},
					{
						"id": 726,
						"name": "东山区",
						"pid": 711
					},
					{
						"id": 727,
						"name": "兴山区",
						"pid": 711
					},
					{
						"id": 728,
						"name": "萝北县",
						"pid": 711
					},
					{
						"id": 729,
						"name": "绥滨县",
						"pid": 711
					}
				]
			},
			{
				"id": 730,
				"name": "双鸭山市",
				"pid": 8,
				"children": [{
						"id": 731,
						"name": "尖山区",
						"pid": 730
					},
					{
						"id": 732,
						"name": "岭东区",
						"pid": 730
					},
					{
						"id": 733,
						"name": "四方台区",
						"pid": 730
					},
					{
						"id": 734,
						"name": "宝山区",
						"pid": 730
					},
					{
						"id": 735,
						"name": "集贤县",
						"pid": 730
					},
					{
						"id": 736,
						"name": "友谊县",
						"pid": 730
					},
					{
						"id": 737,
						"name": "宝清县",
						"pid": 730
					},
					{
						"id": 738,
						"name": "饶河县",
						"pid": 730
					}
				]
			},
			{
				"id": 739,
				"name": "大庆市",
				"pid": 8,
				"children": [{
						"id": 740,
						"name": "萨尔图区",
						"pid": 739
					},
					{
						"id": 741,
						"name": "龙凤区",
						"pid": 739
					},
					{
						"id": 742,
						"name": "让胡路区",
						"pid": 739
					},
					{
						"id": 743,
						"name": "红岗区",
						"pid": 739
					},
					{
						"id": 744,
						"name": "大同区",
						"pid": 739
					},
					{
						"id": 745,
						"name": "肇州县",
						"pid": 739
					},
					{
						"id": 746,
						"name": "肇源县",
						"pid": 739
					},
					{
						"id": 747,
						"name": "林甸县",
						"pid": 739
					},
					{
						"id": 748,
						"name": "杜尔伯特蒙古族自治县",
						"pid": 739
					}
				]
			},
			{
				"id": 749,
				"name": "伊春市",
				"pid": 8,
				"children": [{
						"id": 750,
						"name": "伊春区",
						"pid": 749
					},
					{
						"id": 751,
						"name": "南岔区",
						"pid": 749
					},
					{
						"id": 752,
						"name": "友好区",
						"pid": 749
					},
					{
						"id": 753,
						"name": "西林区",
						"pid": 749
					},
					{
						"id": 754,
						"name": "翠峦区",
						"pid": 749
					},
					{
						"id": 755,
						"name": "新青区",
						"pid": 749
					},
					{
						"id": 756,
						"name": "美溪区",
						"pid": 749
					},
					{
						"id": 757,
						"name": "金山屯区",
						"pid": 749
					},
					{
						"id": 758,
						"name": "五营区",
						"pid": 749
					},
					{
						"id": 759,
						"name": "乌马河区",
						"pid": 749
					},
					{
						"id": 760,
						"name": "汤旺河区",
						"pid": 749
					},
					{
						"id": 761,
						"name": "带岭区",
						"pid": 749
					},
					{
						"id": 762,
						"name": "乌伊岭区",
						"pid": 749
					},
					{
						"id": 763,
						"name": "红星区",
						"pid": 749
					},
					{
						"id": 764,
						"name": "上甘岭区",
						"pid": 749
					},
					{
						"id": 765,
						"name": "嘉荫县",
						"pid": 749
					},
					{
						"id": 766,
						"name": "铁力市",
						"pid": 749
					}
				]
			},
			{
				"id": 767,
				"name": "佳木斯市",
				"pid": 8,
				"children": [{
						"id": 768,
						"name": "向阳区",
						"pid": 767
					},
					{
						"id": 769,
						"name": "前进区",
						"pid": 767
					},
					{
						"id": 770,
						"name": "东风区",
						"pid": 767
					},
					{
						"id": 771,
						"name": "郊区",
						"pid": 767
					},
					{
						"id": 772,
						"name": "桦南县",
						"pid": 767
					},
					{
						"id": 773,
						"name": "桦川县",
						"pid": 767
					},
					{
						"id": 774,
						"name": "汤原县",
						"pid": 767
					},
					{
						"id": 775,
						"name": "同江市",
						"pid": 767
					},
					{
						"id": 776,
						"name": "富锦市",
						"pid": 767
					},
					{
						"id": 777,
						"name": "抚远市",
						"pid": 767
					}
				]
			},
			{
				"id": 778,
				"name": "七台河市",
				"pid": 8,
				"children": [{
						"id": 779,
						"name": "新兴区",
						"pid": 778
					},
					{
						"id": 780,
						"name": "桃山区",
						"pid": 778
					},
					{
						"id": 781,
						"name": "茄子河区",
						"pid": 778
					},
					{
						"id": 782,
						"name": "勃利县",
						"pid": 778
					}
				]
			},
			{
				"id": 783,
				"name": "牡丹江市",
				"pid": 8,
				"children": [{
						"id": 784,
						"name": "东安区",
						"pid": 783
					},
					{
						"id": 785,
						"name": "阳明区",
						"pid": 783
					},
					{
						"id": 786,
						"name": "爱民区",
						"pid": 783
					},
					{
						"id": 787,
						"name": "西安区",
						"pid": 783
					},
					{
						"id": 788,
						"name": "林口县",
						"pid": 783
					},
					{
						"id": 789,
						"name": "绥芬河市",
						"pid": 783
					},
					{
						"id": 790,
						"name": "海林市",
						"pid": 783
					},
					{
						"id": 791,
						"name": "宁安市",
						"pid": 783
					},
					{
						"id": 792,
						"name": "穆棱市",
						"pid": 783
					},
					{
						"id": 793,
						"name": "东宁市",
						"pid": 783
					}
				]
			},
			{
				"id": 794,
				"name": "黑河市",
				"pid": 8,
				"children": [{
						"id": 795,
						"name": "爱辉区",
						"pid": 794
					},
					{
						"id": 796,
						"name": "嫩江县",
						"pid": 794
					},
					{
						"id": 797,
						"name": "逊克县",
						"pid": 794
					},
					{
						"id": 798,
						"name": "孙吴县",
						"pid": 794
					},
					{
						"id": 799,
						"name": "北安市",
						"pid": 794
					},
					{
						"id": 800,
						"name": "五大连池市",
						"pid": 794
					}
				]
			},
			{
				"id": 801,
				"name": "绥化市",
				"pid": 8,
				"children": [{
						"id": 802,
						"name": "北林区",
						"pid": 801
					},
					{
						"id": 803,
						"name": "望奎县",
						"pid": 801
					},
					{
						"id": 804,
						"name": "兰西县",
						"pid": 801
					},
					{
						"id": 805,
						"name": "青冈县",
						"pid": 801
					},
					{
						"id": 806,
						"name": "庆安县",
						"pid": 801
					},
					{
						"id": 807,
						"name": "明水县",
						"pid": 801
					},
					{
						"id": 808,
						"name": "绥棱县",
						"pid": 801
					},
					{
						"id": 809,
						"name": "安达市",
						"pid": 801
					},
					{
						"id": 810,
						"name": "肇东市",
						"pid": 801
					},
					{
						"id": 811,
						"name": "海伦市",
						"pid": 801
					}
				]
			},
			{
				"id": 812,
				"name": "大兴安岭地区",
				"pid": 8,
				"children": [{
						"id": 813,
						"name": "呼玛县",
						"pid": 812
					},
					{
						"id": 814,
						"name": "塔河县",
						"pid": 812
					},
					{
						"id": 815,
						"name": "漠河县",
						"pid": 812
					}
				]
			}
		]
	},
	{
		"id": 9,
		"name": "上海市",
		"pid": 0,
		"children": [{
			"id": 816,
			"name": "上海",
			"pid": 9,
			"children": [{
					"id": 817,
					"name": "黄浦区",
					"pid": 816
				},
				{
					"id": 818,
					"name": "徐汇区",
					"pid": 816
				},
				{
					"id": 819,
					"name": "长宁区",
					"pid": 816
				},
				{
					"id": 820,
					"name": "静安区",
					"pid": 816
				},
				{
					"id": 821,
					"name": "普陀区",
					"pid": 816
				},
				{
					"id": 822,
					"name": "虹口区",
					"pid": 816
				},
				{
					"id": 823,
					"name": "杨浦区",
					"pid": 816
				},
				{
					"id": 824,
					"name": "闵行区",
					"pid": 816
				},
				{
					"id": 825,
					"name": "宝山区",
					"pid": 816
				},
				{
					"id": 826,
					"name": "嘉定区",
					"pid": 816
				},
				{
					"id": 827,
					"name": "浦东新区",
					"pid": 816
				},
				{
					"id": 828,
					"name": "金山区",
					"pid": 816
				},
				{
					"id": 829,
					"name": "松江区",
					"pid": 816
				},
				{
					"id": 830,
					"name": "青浦区",
					"pid": 816
				},
				{
					"id": 831,
					"name": "奉贤区",
					"pid": 816
				},
				{
					"id": 832,
					"name": "崇明区",
					"pid": 816
				}
			]
		}]
	},
	{
		"id": 10,
		"name": "江苏省",
		"pid": 0,
		"children": [{
				"id": 833,
				"name": "南京市",
				"pid": 10,
				"children": [{
						"id": 834,
						"name": "玄武区",
						"pid": 833
					},
					{
						"id": 835,
						"name": "秦淮区",
						"pid": 833
					},
					{
						"id": 836,
						"name": "建邺区",
						"pid": 833
					},
					{
						"id": 837,
						"name": "鼓楼区",
						"pid": 833
					},
					{
						"id": 838,
						"name": "浦口区",
						"pid": 833
					},
					{
						"id": 839,
						"name": "栖霞区",
						"pid": 833
					},
					{
						"id": 840,
						"name": "雨花台区",
						"pid": 833
					},
					{
						"id": 841,
						"name": "江宁区",
						"pid": 833
					},
					{
						"id": 842,
						"name": "六合区",
						"pid": 833
					},
					{
						"id": 843,
						"name": "溧水区",
						"pid": 833
					},
					{
						"id": 844,
						"name": "高淳区",
						"pid": 833
					}
				]
			},
			{
				"id": 845,
				"name": "无锡市",
				"pid": 10,
				"children": [{
						"id": 846,
						"name": "锡山区",
						"pid": 845
					},
					{
						"id": 847,
						"name": "惠山区",
						"pid": 845
					},
					{
						"id": 848,
						"name": "滨湖区",
						"pid": 845
					},
					{
						"id": 849,
						"name": "梁溪区",
						"pid": 845
					},
					{
						"id": 850,
						"name": "新吴区",
						"pid": 845
					},
					{
						"id": 851,
						"name": "江阴市",
						"pid": 845
					},
					{
						"id": 852,
						"name": "宜兴市",
						"pid": 845
					}
				]
			},
			{
				"id": 853,
				"name": "徐州市",
				"pid": 10,
				"children": [{
						"id": 854,
						"name": "鼓楼区",
						"pid": 853
					},
					{
						"id": 855,
						"name": "云龙区",
						"pid": 853
					},
					{
						"id": 856,
						"name": "贾汪区",
						"pid": 853
					},
					{
						"id": 857,
						"name": "泉山区",
						"pid": 853
					},
					{
						"id": 858,
						"name": "铜山区",
						"pid": 853
					},
					{
						"id": 859,
						"name": "丰县",
						"pid": 853
					},
					{
						"id": 860,
						"name": "沛县",
						"pid": 853
					},
					{
						"id": 861,
						"name": "睢宁县",
						"pid": 853
					},
					{
						"id": 862,
						"name": "新沂市",
						"pid": 853
					},
					{
						"id": 863,
						"name": "邳州市",
						"pid": 853
					}
				]
			},
			{
				"id": 864,
				"name": "常州市",
				"pid": 10,
				"children": [{
						"id": 865,
						"name": "天宁区",
						"pid": 864
					},
					{
						"id": 866,
						"name": "钟楼区",
						"pid": 864
					},
					{
						"id": 867,
						"name": "新北区",
						"pid": 864
					},
					{
						"id": 868,
						"name": "武进区",
						"pid": 864
					},
					{
						"id": 869,
						"name": "金坛区",
						"pid": 864
					},
					{
						"id": 870,
						"name": "溧阳市",
						"pid": 864
					}
				]
			},
			{
				"id": 871,
				"name": "苏州市",
				"pid": 10,
				"children": [{
						"id": 872,
						"name": "虎丘区",
						"pid": 871
					},
					{
						"id": 873,
						"name": "吴中区",
						"pid": 871
					},
					{
						"id": 874,
						"name": "相城区",
						"pid": 871
					},
					{
						"id": 875,
						"name": "姑苏区",
						"pid": 871
					},
					{
						"id": 876,
						"name": "吴江区",
						"pid": 871
					},
					{
						"id": 877,
						"name": "常熟市",
						"pid": 871
					},
					{
						"id": 878,
						"name": "张家港市",
						"pid": 871
					},
					{
						"id": 879,
						"name": "昆山市",
						"pid": 871
					},
					{
						"id": 880,
						"name": "太仓市",
						"pid": 871
					}
				]
			},
			{
				"id": 881,
				"name": "南通市",
				"pid": 10,
				"children": [{
						"id": 882,
						"name": "崇川区",
						"pid": 881
					},
					{
						"id": 883,
						"name": "港闸区",
						"pid": 881
					},
					{
						"id": 884,
						"name": "通州区",
						"pid": 881
					},
					{
						"id": 885,
						"name": "海安县",
						"pid": 881
					},
					{
						"id": 886,
						"name": "如东县",
						"pid": 881
					},
					{
						"id": 887,
						"name": "启东市",
						"pid": 881
					},
					{
						"id": 888,
						"name": "如皋市",
						"pid": 881
					},
					{
						"id": 889,
						"name": "海门市",
						"pid": 881
					}
				]
			},
			{
				"id": 890,
				"name": "连云港市",
				"pid": 10,
				"children": [{
						"id": 891,
						"name": "连云区",
						"pid": 890
					},
					{
						"id": 892,
						"name": "海州区",
						"pid": 890
					},
					{
						"id": 893,
						"name": "赣榆区",
						"pid": 890
					},
					{
						"id": 894,
						"name": "东海县",
						"pid": 890
					},
					{
						"id": 895,
						"name": "灌云县",
						"pid": 890
					},
					{
						"id": 896,
						"name": "灌南县",
						"pid": 890
					}
				]
			},
			{
				"id": 897,
				"name": "淮安市",
				"pid": 10,
				"children": [{
						"id": 898,
						"name": "淮安区",
						"pid": 897
					},
					{
						"id": 899,
						"name": "淮阴区",
						"pid": 897
					},
					{
						"id": 900,
						"name": "清江浦区",
						"pid": 897
					},
					{
						"id": 901,
						"name": "洪泽区",
						"pid": 897
					},
					{
						"id": 902,
						"name": "涟水县",
						"pid": 897
					},
					{
						"id": 903,
						"name": "盱眙县",
						"pid": 897
					},
					{
						"id": 904,
						"name": "金湖县",
						"pid": 897
					}
				]
			},
			{
				"id": 905,
				"name": "盐城市",
				"pid": 10,
				"children": [{
						"id": 906,
						"name": "亭湖区",
						"pid": 905
					},
					{
						"id": 907,
						"name": "盐都区",
						"pid": 905
					},
					{
						"id": 908,
						"name": "大丰区",
						"pid": 905
					},
					{
						"id": 909,
						"name": "响水县",
						"pid": 905
					},
					{
						"id": 910,
						"name": "滨海县",
						"pid": 905
					},
					{
						"id": 911,
						"name": "阜宁县",
						"pid": 905
					},
					{
						"id": 912,
						"name": "射阳县",
						"pid": 905
					},
					{
						"id": 913,
						"name": "建湖县",
						"pid": 905
					},
					{
						"id": 914,
						"name": "东台市",
						"pid": 905
					}
				]
			},
			{
				"id": 915,
				"name": "扬州市",
				"pid": 10,
				"children": [{
						"id": 916,
						"name": "广陵区",
						"pid": 915
					},
					{
						"id": 917,
						"name": "邗江区",
						"pid": 915
					},
					{
						"id": 918,
						"name": "江都区",
						"pid": 915
					},
					{
						"id": 919,
						"name": "宝应县",
						"pid": 915
					},
					{
						"id": 920,
						"name": "仪征市",
						"pid": 915
					},
					{
						"id": 921,
						"name": "高邮市",
						"pid": 915
					}
				]
			},
			{
				"id": 922,
				"name": "镇江市",
				"pid": 10,
				"children": [{
						"id": 923,
						"name": "京口区",
						"pid": 922
					},
					{
						"id": 924,
						"name": "润州区",
						"pid": 922
					},
					{
						"id": 925,
						"name": "丹徒区",
						"pid": 922
					},
					{
						"id": 926,
						"name": "丹阳市",
						"pid": 922
					},
					{
						"id": 927,
						"name": "扬中市",
						"pid": 922
					},
					{
						"id": 928,
						"name": "句容市",
						"pid": 922
					}
				]
			},
			{
				"id": 929,
				"name": "泰州市",
				"pid": 10,
				"children": [{
						"id": 930,
						"name": "海陵区",
						"pid": 929
					},
					{
						"id": 931,
						"name": "高港区",
						"pid": 929
					},
					{
						"id": 932,
						"name": "姜堰区",
						"pid": 929
					},
					{
						"id": 933,
						"name": "兴化市",
						"pid": 929
					},
					{
						"id": 934,
						"name": "靖江市",
						"pid": 929
					},
					{
						"id": 935,
						"name": "泰兴市",
						"pid": 929
					}
				]
			},
			{
				"id": 936,
				"name": "宿迁市",
				"pid": 10,
				"children": [{
						"id": 937,
						"name": "宿城区",
						"pid": 936
					},
					{
						"id": 938,
						"name": "宿豫区",
						"pid": 936
					},
					{
						"id": 939,
						"name": "沭阳县",
						"pid": 936
					},
					{
						"id": 940,
						"name": "泗阳县",
						"pid": 936
					},
					{
						"id": 941,
						"name": "泗洪县",
						"pid": 936
					}
				]
			}
		]
	},
	{
		"id": 11,
		"name": "浙江省",
		"pid": 0,
		"children": [{
				"id": 942,
				"name": "杭州市",
				"pid": 11,
				"children": [{
						"id": 943,
						"name": "上城区",
						"pid": 942
					},
					{
						"id": 944,
						"name": "下城区",
						"pid": 942
					},
					{
						"id": 945,
						"name": "江干区",
						"pid": 942
					},
					{
						"id": 946,
						"name": "拱墅区",
						"pid": 942
					},
					{
						"id": 947,
						"name": "西湖区",
						"pid": 942
					},
					{
						"id": 948,
						"name": "滨江区",
						"pid": 942
					},
					{
						"id": 949,
						"name": "萧山区",
						"pid": 942
					},
					{
						"id": 950,
						"name": "余杭区",
						"pid": 942
					},
					{
						"id": 951,
						"name": "富阳区",
						"pid": 942
					},
					{
						"id": 952,
						"name": "临安区",
						"pid": 942
					},
					{
						"id": 953,
						"name": "桐庐县",
						"pid": 942
					},
					{
						"id": 954,
						"name": "淳安县",
						"pid": 942
					},
					{
						"id": 955,
						"name": "建德市",
						"pid": 942
					}
				]
			},
			{
				"id": 956,
				"name": "宁波市",
				"pid": 11,
				"children": [{
						"id": 957,
						"name": "海曙区",
						"pid": 956
					},
					{
						"id": 958,
						"name": "江北区",
						"pid": 956
					},
					{
						"id": 959,
						"name": "北仑区",
						"pid": 956
					},
					{
						"id": 960,
						"name": "镇海区",
						"pid": 956
					},
					{
						"id": 961,
						"name": "鄞州区",
						"pid": 956
					},
					{
						"id": 962,
						"name": "奉化区",
						"pid": 956
					},
					{
						"id": 963,
						"name": "象山县",
						"pid": 956
					},
					{
						"id": 964,
						"name": "宁海县",
						"pid": 956
					},
					{
						"id": 965,
						"name": "余姚市",
						"pid": 956
					},
					{
						"id": 966,
						"name": "慈溪市",
						"pid": 956
					}
				]
			},
			{
				"id": 967,
				"name": "温州市",
				"pid": 11,
				"children": [{
						"id": 968,
						"name": "鹿城区",
						"pid": 967
					},
					{
						"id": 969,
						"name": "龙湾区",
						"pid": 967
					},
					{
						"id": 970,
						"name": "瓯海区",
						"pid": 967
					},
					{
						"id": 971,
						"name": "洞头区",
						"pid": 967
					},
					{
						"id": 972,
						"name": "永嘉县",
						"pid": 967
					},
					{
						"id": 973,
						"name": "平阳县",
						"pid": 967
					},
					{
						"id": 974,
						"name": "苍南县",
						"pid": 967
					},
					{
						"id": 975,
						"name": "文成县",
						"pid": 967
					},
					{
						"id": 976,
						"name": "泰顺县",
						"pid": 967
					},
					{
						"id": 977,
						"name": "瑞安市",
						"pid": 967
					},
					{
						"id": 978,
						"name": "乐清市",
						"pid": 967
					}
				]
			},
			{
				"id": 979,
				"name": "嘉兴市",
				"pid": 11,
				"children": [{
						"id": 980,
						"name": "南湖区",
						"pid": 979
					},
					{
						"id": 981,
						"name": "秀洲区",
						"pid": 979
					},
					{
						"id": 982,
						"name": "嘉善县",
						"pid": 979
					},
					{
						"id": 983,
						"name": "海盐县",
						"pid": 979
					},
					{
						"id": 984,
						"name": "海宁市",
						"pid": 979
					},
					{
						"id": 985,
						"name": "平湖市",
						"pid": 979
					},
					{
						"id": 986,
						"name": "桐乡市",
						"pid": 979
					}
				]
			},
			{
				"id": 987,
				"name": "湖州市",
				"pid": 11,
				"children": [{
						"id": 988,
						"name": "吴兴区",
						"pid": 987
					},
					{
						"id": 989,
						"name": "南浔区",
						"pid": 987
					},
					{
						"id": 990,
						"name": "德清县",
						"pid": 987
					},
					{
						"id": 991,
						"name": "长兴县",
						"pid": 987
					},
					{
						"id": 992,
						"name": "安吉县",
						"pid": 987
					}
				]
			},
			{
				"id": 993,
				"name": "绍兴市",
				"pid": 11,
				"children": [{
						"id": 994,
						"name": "越城区",
						"pid": 993
					},
					{
						"id": 995,
						"name": "柯桥区",
						"pid": 993
					},
					{
						"id": 996,
						"name": "上虞区",
						"pid": 993
					},
					{
						"id": 997,
						"name": "新昌县",
						"pid": 993
					},
					{
						"id": 998,
						"name": "诸暨市",
						"pid": 993
					},
					{
						"id": 999,
						"name": "嵊州市",
						"pid": 993
					}
				]
			},
			{
				"id": 1000,
				"name": "金华市",
				"pid": 11,
				"children": [{
						"id": 1001,
						"name": "婺城区",
						"pid": 1000
					},
					{
						"id": 1002,
						"name": "金东区",
						"pid": 1000
					},
					{
						"id": 1003,
						"name": "武义县",
						"pid": 1000
					},
					{
						"id": 1004,
						"name": "浦江县",
						"pid": 1000
					},
					{
						"id": 1005,
						"name": "磐安县",
						"pid": 1000
					},
					{
						"id": 1006,
						"name": "兰溪市",
						"pid": 1000
					},
					{
						"id": 1007,
						"name": "义乌市",
						"pid": 1000
					},
					{
						"id": 1008,
						"name": "东阳市",
						"pid": 1000
					},
					{
						"id": 1009,
						"name": "永康市",
						"pid": 1000
					}
				]
			},
			{
				"id": 1010,
				"name": "衢州市",
				"pid": 11,
				"children": [{
						"id": 1011,
						"name": "柯城区",
						"pid": 1010
					},
					{
						"id": 1012,
						"name": "衢江区",
						"pid": 1010
					},
					{
						"id": 1013,
						"name": "常山县",
						"pid": 1010
					},
					{
						"id": 1014,
						"name": "开化县",
						"pid": 1010
					},
					{
						"id": 1015,
						"name": "龙游县",
						"pid": 1010
					},
					{
						"id": 1016,
						"name": "江山市",
						"pid": 1010
					}
				]
			},
			{
				"id": 1017,
				"name": "舟山市",
				"pid": 11,
				"children": [{
						"id": 1018,
						"name": "定海区",
						"pid": 1017
					},
					{
						"id": 1019,
						"name": "普陀区",
						"pid": 1017
					},
					{
						"id": 1020,
						"name": "岱山县",
						"pid": 1017
					},
					{
						"id": 1021,
						"name": "嵊泗县",
						"pid": 1017
					}
				]
			},
			{
				"id": 1022,
				"name": "台州市",
				"pid": 11,
				"children": [{
						"id": 1023,
						"name": "椒江区",
						"pid": 1022
					},
					{
						"id": 1024,
						"name": "黄岩区",
						"pid": 1022
					},
					{
						"id": 1025,
						"name": "路桥区",
						"pid": 1022
					},
					{
						"id": 1026,
						"name": "三门县",
						"pid": 1022
					},
					{
						"id": 1027,
						"name": "天台县",
						"pid": 1022
					},
					{
						"id": 1028,
						"name": "仙居县",
						"pid": 1022
					},
					{
						"id": 1029,
						"name": "温岭市",
						"pid": 1022
					},
					{
						"id": 1030,
						"name": "临海市",
						"pid": 1022
					},
					{
						"id": 1031,
						"name": "玉环市",
						"pid": 1022
					}
				]
			},
			{
				"id": 1032,
				"name": "丽水市",
				"pid": 11,
				"children": [{
						"id": 1033,
						"name": "莲都区",
						"pid": 1032
					},
					{
						"id": 1034,
						"name": "青田县",
						"pid": 1032
					},
					{
						"id": 1035,
						"name": "缙云县",
						"pid": 1032
					},
					{
						"id": 1036,
						"name": "遂昌县",
						"pid": 1032
					},
					{
						"id": 1037,
						"name": "松阳县",
						"pid": 1032
					},
					{
						"id": 1038,
						"name": "云和县",
						"pid": 1032
					},
					{
						"id": 1039,
						"name": "庆元县",
						"pid": 1032
					},
					{
						"id": 1040,
						"name": "景宁畲族自治县",
						"pid": 1032
					},
					{
						"id": 1041,
						"name": "龙泉市",
						"pid": 1032
					}
				]
			}
		]
	},
	{
		"id": 12,
		"name": "安徽省",
		"pid": 0,
		"children": [{
				"id": 1042,
				"name": "合肥市",
				"pid": 12,
				"children": [{
						"id": 1043,
						"name": "瑶海区",
						"pid": 1042
					},
					{
						"id": 1044,
						"name": "庐阳区",
						"pid": 1042
					},
					{
						"id": 1045,
						"name": "蜀山区",
						"pid": 1042
					},
					{
						"id": 1046,
						"name": "包河区",
						"pid": 1042
					},
					{
						"id": 1047,
						"name": "长丰县",
						"pid": 1042
					},
					{
						"id": 1048,
						"name": "肥东县",
						"pid": 1042
					},
					{
						"id": 1049,
						"name": "肥西县",
						"pid": 1042
					},
					{
						"id": 1050,
						"name": "庐江县",
						"pid": 1042
					},
					{
						"id": 1051,
						"name": "巢湖市",
						"pid": 1042
					}
				]
			},
			{
				"id": 1052,
				"name": "芜湖市",
				"pid": 12,
				"children": [{
						"id": 1053,
						"name": "镜湖区",
						"pid": 1052
					},
					{
						"id": 1054,
						"name": "弋江区",
						"pid": 1052
					},
					{
						"id": 1055,
						"name": "鸠江区",
						"pid": 1052
					},
					{
						"id": 1056,
						"name": "三山区",
						"pid": 1052
					},
					{
						"id": 1057,
						"name": "芜湖县",
						"pid": 1052
					},
					{
						"id": 1058,
						"name": "繁昌县",
						"pid": 1052
					},
					{
						"id": 1059,
						"name": "南陵县",
						"pid": 1052
					},
					{
						"id": 1060,
						"name": "无为县",
						"pid": 1052
					}
				]
			},
			{
				"id": 1061,
				"name": "蚌埠市",
				"pid": 12,
				"children": [{
						"id": 1062,
						"name": "龙子湖区",
						"pid": 1061
					},
					{
						"id": 1063,
						"name": "蚌山区",
						"pid": 1061
					},
					{
						"id": 1064,
						"name": "禹会区",
						"pid": 1061
					},
					{
						"id": 1065,
						"name": "淮上区",
						"pid": 1061
					},
					{
						"id": 1066,
						"name": "怀远县",
						"pid": 1061
					},
					{
						"id": 1067,
						"name": "五河县",
						"pid": 1061
					},
					{
						"id": 1068,
						"name": "固镇县",
						"pid": 1061
					}
				]
			},
			{
				"id": 1069,
				"name": "淮南市",
				"pid": 12,
				"children": [{
						"id": 1070,
						"name": "大通区",
						"pid": 1069
					},
					{
						"id": 1071,
						"name": "田家庵区",
						"pid": 1069
					},
					{
						"id": 1072,
						"name": "谢家集区",
						"pid": 1069
					},
					{
						"id": 1073,
						"name": "八公山区",
						"pid": 1069
					},
					{
						"id": 1074,
						"name": "潘集区",
						"pid": 1069
					},
					{
						"id": 1075,
						"name": "凤台县",
						"pid": 1069
					},
					{
						"id": 1076,
						"name": "寿县",
						"pid": 1069
					}
				]
			},
			{
				"id": 1077,
				"name": "马鞍山市",
				"pid": 12,
				"children": [{
						"id": 1078,
						"name": "花山区",
						"pid": 1077
					},
					{
						"id": 1079,
						"name": "雨山区",
						"pid": 1077
					},
					{
						"id": 1080,
						"name": "博望区",
						"pid": 1077
					},
					{
						"id": 1081,
						"name": "当涂县",
						"pid": 1077
					},
					{
						"id": 1082,
						"name": "含山县",
						"pid": 1077
					},
					{
						"id": 1083,
						"name": "和县",
						"pid": 1077
					}
				]
			},
			{
				"id": 1084,
				"name": "淮北市",
				"pid": 12,
				"children": [{
						"id": 1085,
						"name": "杜集区",
						"pid": 1084
					},
					{
						"id": 1086,
						"name": "相山区",
						"pid": 1084
					},
					{
						"id": 1087,
						"name": "烈山区",
						"pid": 1084
					},
					{
						"id": 1088,
						"name": "濉溪县",
						"pid": 1084
					}
				]
			},
			{
				"id": 1089,
				"name": "铜陵市",
				"pid": 12,
				"children": [{
						"id": 1090,
						"name": "铜官区",
						"pid": 1089
					},
					{
						"id": 1091,
						"name": "义安区",
						"pid": 1089
					},
					{
						"id": 1092,
						"name": "郊区",
						"pid": 1089
					},
					{
						"id": 1093,
						"name": "枞阳县",
						"pid": 1089
					}
				]
			},
			{
				"id": 1094,
				"name": "安庆市",
				"pid": 12,
				"children": [{
						"id": 1095,
						"name": "迎江区",
						"pid": 1094
					},
					{
						"id": 1096,
						"name": "大观区",
						"pid": 1094
					},
					{
						"id": 1097,
						"name": "宜秀区",
						"pid": 1094
					},
					{
						"id": 1098,
						"name": "怀宁县",
						"pid": 1094
					},
					{
						"id": 1099,
						"name": "潜山县",
						"pid": 1094
					},
					{
						"id": 1100,
						"name": "太湖县",
						"pid": 1094
					},
					{
						"id": 1101,
						"name": "宿松县",
						"pid": 1094
					},
					{
						"id": 1102,
						"name": "望江县",
						"pid": 1094
					},
					{
						"id": 1103,
						"name": "岳西县",
						"pid": 1094
					},
					{
						"id": 1104,
						"name": "桐城市",
						"pid": 1094
					}
				]
			},
			{
				"id": 1105,
				"name": "黄山市",
				"pid": 12,
				"children": [{
						"id": 1106,
						"name": "屯溪区",
						"pid": 1105
					},
					{
						"id": 1107,
						"name": "黄山区",
						"pid": 1105
					},
					{
						"id": 1108,
						"name": "徽州区",
						"pid": 1105
					},
					{
						"id": 1109,
						"name": "歙县",
						"pid": 1105
					},
					{
						"id": 1110,
						"name": "休宁县",
						"pid": 1105
					},
					{
						"id": 1111,
						"name": "黟县",
						"pid": 1105
					},
					{
						"id": 1112,
						"name": "祁门县",
						"pid": 1105
					}
				]
			},
			{
				"id": 1113,
				"name": "滁州市",
				"pid": 12,
				"children": [{
						"id": 1114,
						"name": "琅琊区",
						"pid": 1113
					},
					{
						"id": 1115,
						"name": "南谯区",
						"pid": 1113
					},
					{
						"id": 1116,
						"name": "来安县",
						"pid": 1113
					},
					{
						"id": 1117,
						"name": "全椒县",
						"pid": 1113
					},
					{
						"id": 1118,
						"name": "定远县",
						"pid": 1113
					},
					{
						"id": 1119,
						"name": "凤阳县",
						"pid": 1113
					},
					{
						"id": 1120,
						"name": "天长市",
						"pid": 1113
					},
					{
						"id": 1121,
						"name": "明光市",
						"pid": 1113
					}
				]
			},
			{
				"id": 1122,
				"name": "阜阳市",
				"pid": 12,
				"children": [{
						"id": 1123,
						"name": "颍州区",
						"pid": 1122
					},
					{
						"id": 1124,
						"name": "颍东区",
						"pid": 1122
					},
					{
						"id": 1125,
						"name": "颍泉区",
						"pid": 1122
					},
					{
						"id": 1126,
						"name": "临泉县",
						"pid": 1122
					},
					{
						"id": 1127,
						"name": "太和县",
						"pid": 1122
					},
					{
						"id": 1128,
						"name": "阜南县",
						"pid": 1122
					},
					{
						"id": 1129,
						"name": "颍上县",
						"pid": 1122
					},
					{
						"id": 1130,
						"name": "界首市",
						"pid": 1122
					}
				]
			},
			{
				"id": 1131,
				"name": "宿州市",
				"pid": 12,
				"children": [{
						"id": 1132,
						"name": "埇桥区",
						"pid": 1131
					},
					{
						"id": 1133,
						"name": "砀山县",
						"pid": 1131
					},
					{
						"id": 1134,
						"name": "萧县",
						"pid": 1131
					},
					{
						"id": 1135,
						"name": "灵璧县",
						"pid": 1131
					},
					{
						"id": 1136,
						"name": "泗县",
						"pid": 1131
					}
				]
			},
			{
				"id": 1137,
				"name": "六安市",
				"pid": 12,
				"children": [{
						"id": 1138,
						"name": "金安区",
						"pid": 1137
					},
					{
						"id": 1139,
						"name": "裕安区",
						"pid": 1137
					},
					{
						"id": 1140,
						"name": "叶集区",
						"pid": 1137
					},
					{
						"id": 1141,
						"name": "霍邱县",
						"pid": 1137
					},
					{
						"id": 1142,
						"name": "舒城县",
						"pid": 1137
					},
					{
						"id": 1143,
						"name": "金寨县",
						"pid": 1137
					},
					{
						"id": 1144,
						"name": "霍山县",
						"pid": 1137
					}
				]
			},
			{
				"id": 1145,
				"name": "亳州市",
				"pid": 12,
				"children": [{
						"id": 1146,
						"name": "谯城区",
						"pid": 1145
					},
					{
						"id": 1147,
						"name": "涡阳县",
						"pid": 1145
					},
					{
						"id": 1148,
						"name": "蒙城县",
						"pid": 1145
					},
					{
						"id": 1149,
						"name": "利辛县",
						"pid": 1145
					}
				]
			},
			{
				"id": 1150,
				"name": "池州市",
				"pid": 12,
				"children": [{
						"id": 1151,
						"name": "贵池区",
						"pid": 1150
					},
					{
						"id": 1152,
						"name": "东至县",
						"pid": 1150
					},
					{
						"id": 1153,
						"name": "石台县",
						"pid": 1150
					},
					{
						"id": 1154,
						"name": "青阳县",
						"pid": 1150
					}
				]
			},
			{
				"id": 1155,
				"name": "宣城市",
				"pid": 12,
				"children": [{
						"id": 1156,
						"name": "宣州区",
						"pid": 1155
					},
					{
						"id": 1157,
						"name": "郎溪县",
						"pid": 1155
					},
					{
						"id": 1158,
						"name": "广德县",
						"pid": 1155
					},
					{
						"id": 1159,
						"name": "泾县",
						"pid": 1155
					},
					{
						"id": 1160,
						"name": "绩溪县",
						"pid": 1155
					},
					{
						"id": 1161,
						"name": "旌德县",
						"pid": 1155
					},
					{
						"id": 1162,
						"name": "宁国市",
						"pid": 1155
					}
				]
			}
		]
	},
	{
		"id": 13,
		"name": "福建省",
		"pid": 0,
		"children": [{
				"id": 1163,
				"name": "福州市",
				"pid": 13,
				"children": [{
						"id": 1164,
						"name": "鼓楼区",
						"pid": 1163
					},
					{
						"id": 1165,
						"name": "台江区",
						"pid": 1163
					},
					{
						"id": 1166,
						"name": "仓山区",
						"pid": 1163
					},
					{
						"id": 1167,
						"name": "马尾区",
						"pid": 1163
					},
					{
						"id": 1168,
						"name": "晋安区",
						"pid": 1163
					},
					{
						"id": 1169,
						"name": "长乐区",
						"pid": 1163
					},
					{
						"id": 1170,
						"name": "闽侯县",
						"pid": 1163
					},
					{
						"id": 1171,
						"name": "连江县",
						"pid": 1163
					},
					{
						"id": 1172,
						"name": "罗源县",
						"pid": 1163
					},
					{
						"id": 1173,
						"name": "闽清县",
						"pid": 1163
					},
					{
						"id": 1174,
						"name": "永泰县",
						"pid": 1163
					},
					{
						"id": 1175,
						"name": "平潭县",
						"pid": 1163
					},
					{
						"id": 1176,
						"name": "福清市",
						"pid": 1163
					}
				]
			},
			{
				"id": 1177,
				"name": "厦门市",
				"pid": 13,
				"children": [{
						"id": 1178,
						"name": "思明区",
						"pid": 1177
					},
					{
						"id": 1179,
						"name": "海沧区",
						"pid": 1177
					},
					{
						"id": 1180,
						"name": "湖里区",
						"pid": 1177
					},
					{
						"id": 1181,
						"name": "集美区",
						"pid": 1177
					},
					{
						"id": 1182,
						"name": "同安区",
						"pid": 1177
					},
					{
						"id": 1183,
						"name": "翔安区",
						"pid": 1177
					}
				]
			},
			{
				"id": 1184,
				"name": "莆田市",
				"pid": 13,
				"children": [{
						"id": 1185,
						"name": "城厢区",
						"pid": 1184
					},
					{
						"id": 1186,
						"name": "涵江区",
						"pid": 1184
					},
					{
						"id": 1187,
						"name": "荔城区",
						"pid": 1184
					},
					{
						"id": 1188,
						"name": "秀屿区",
						"pid": 1184
					},
					{
						"id": 1189,
						"name": "仙游县",
						"pid": 1184
					}
				]
			},
			{
				"id": 1190,
				"name": "三明市",
				"pid": 13,
				"children": [{
						"id": 1191,
						"name": "梅列区",
						"pid": 1190
					},
					{
						"id": 1192,
						"name": "三元区",
						"pid": 1190
					},
					{
						"id": 1193,
						"name": "明溪县",
						"pid": 1190
					},
					{
						"id": 1194,
						"name": "清流县",
						"pid": 1190
					},
					{
						"id": 1195,
						"name": "宁化县",
						"pid": 1190
					},
					{
						"id": 1196,
						"name": "大田县",
						"pid": 1190
					},
					{
						"id": 1197,
						"name": "尤溪县",
						"pid": 1190
					},
					{
						"id": 1198,
						"name": "沙县",
						"pid": 1190
					},
					{
						"id": 1199,
						"name": "将乐县",
						"pid": 1190
					},
					{
						"id": 1200,
						"name": "泰宁县",
						"pid": 1190
					},
					{
						"id": 1201,
						"name": "建宁县",
						"pid": 1190
					},
					{
						"id": 1202,
						"name": "永安市",
						"pid": 1190
					}
				]
			},
			{
				"id": 1203,
				"name": "泉州市",
				"pid": 13,
				"children": [{
						"id": 1204,
						"name": "鲤城区",
						"pid": 1203
					},
					{
						"id": 1205,
						"name": "丰泽区",
						"pid": 1203
					},
					{
						"id": 1206,
						"name": "洛江区",
						"pid": 1203
					},
					{
						"id": 1207,
						"name": "泉港区",
						"pid": 1203
					},
					{
						"id": 1208,
						"name": "惠安县",
						"pid": 1203
					},
					{
						"id": 1209,
						"name": "安溪县",
						"pid": 1203
					},
					{
						"id": 1210,
						"name": "永春县",
						"pid": 1203
					},
					{
						"id": 1211,
						"name": "德化县",
						"pid": 1203
					},
					{
						"id": 1212,
						"name": "金门县",
						"pid": 1203
					},
					{
						"id": 1213,
						"name": "石狮市",
						"pid": 1203
					},
					{
						"id": 1214,
						"name": "晋江市",
						"pid": 1203
					},
					{
						"id": 1215,
						"name": "南安市",
						"pid": 1203
					}
				]
			},
			{
				"id": 1216,
				"name": "漳州市",
				"pid": 13,
				"children": [{
						"id": 1217,
						"name": "芗城区",
						"pid": 1216
					},
					{
						"id": 1218,
						"name": "龙文区",
						"pid": 1216
					},
					{
						"id": 1219,
						"name": "云霄县",
						"pid": 1216
					},
					{
						"id": 1220,
						"name": "漳浦县",
						"pid": 1216
					},
					{
						"id": 1221,
						"name": "诏安县",
						"pid": 1216
					},
					{
						"id": 1222,
						"name": "长泰县",
						"pid": 1216
					},
					{
						"id": 1223,
						"name": "东山县",
						"pid": 1216
					},
					{
						"id": 1224,
						"name": "南靖县",
						"pid": 1216
					},
					{
						"id": 1225,
						"name": "平和县",
						"pid": 1216
					},
					{
						"id": 1226,
						"name": "华安县",
						"pid": 1216
					},
					{
						"id": 1227,
						"name": "龙海市",
						"pid": 1216
					}
				]
			},
			{
				"id": 1228,
				"name": "南平市",
				"pid": 13,
				"children": [{
						"id": 1229,
						"name": "延平区",
						"pid": 1228
					},
					{
						"id": 1230,
						"name": "建阳区",
						"pid": 1228
					},
					{
						"id": 1231,
						"name": "顺昌县",
						"pid": 1228
					},
					{
						"id": 1232,
						"name": "浦城县",
						"pid": 1228
					},
					{
						"id": 1233,
						"name": "光泽县",
						"pid": 1228
					},
					{
						"id": 1234,
						"name": "松溪县",
						"pid": 1228
					},
					{
						"id": 1235,
						"name": "政和县",
						"pid": 1228
					},
					{
						"id": 1236,
						"name": "邵武市",
						"pid": 1228
					},
					{
						"id": 1237,
						"name": "武夷山市",
						"pid": 1228
					},
					{
						"id": 1238,
						"name": "建瓯市",
						"pid": 1228
					}
				]
			},
			{
				"id": 1239,
				"name": "龙岩市",
				"pid": 13,
				"children": [{
						"id": 1240,
						"name": "新罗区",
						"pid": 1239
					},
					{
						"id": 1241,
						"name": "永定区",
						"pid": 1239
					},
					{
						"id": 1242,
						"name": "长汀县",
						"pid": 1239
					},
					{
						"id": 1243,
						"name": "上杭县",
						"pid": 1239
					},
					{
						"id": 1244,
						"name": "武平县",
						"pid": 1239
					},
					{
						"id": 1245,
						"name": "连城县",
						"pid": 1239
					},
					{
						"id": 1246,
						"name": "漳平市",
						"pid": 1239
					}
				]
			},
			{
				"id": 1247,
				"name": "宁德市",
				"pid": 13,
				"children": [{
						"id": 1248,
						"name": "蕉城区",
						"pid": 1247
					},
					{
						"id": 1249,
						"name": "霞浦县",
						"pid": 1247
					},
					{
						"id": 1250,
						"name": "古田县",
						"pid": 1247
					},
					{
						"id": 1251,
						"name": "屏南县",
						"pid": 1247
					},
					{
						"id": 1252,
						"name": "寿宁县",
						"pid": 1247
					},
					{
						"id": 1253,
						"name": "周宁县",
						"pid": 1247
					},
					{
						"id": 1254,
						"name": "柘荣县",
						"pid": 1247
					},
					{
						"id": 1255,
						"name": "福安市",
						"pid": 1247
					},
					{
						"id": 1256,
						"name": "福鼎市",
						"pid": 1247
					}
				]
			}
		]
	},
	{
		"id": 14,
		"name": "江西省",
		"pid": 0,
		"children": [{
				"id": 1257,
				"name": "南昌市",
				"pid": 14,
				"children": [{
						"id": 1258,
						"name": "东湖区",
						"pid": 1257
					},
					{
						"id": 1259,
						"name": "西湖区",
						"pid": 1257
					},
					{
						"id": 1260,
						"name": "青云谱区",
						"pid": 1257
					},
					{
						"id": 1261,
						"name": "湾里区",
						"pid": 1257
					},
					{
						"id": 1262,
						"name": "青山湖区",
						"pid": 1257
					},
					{
						"id": 1263,
						"name": "新建区",
						"pid": 1257
					},
					{
						"id": 1264,
						"name": "南昌县",
						"pid": 1257
					},
					{
						"id": 1265,
						"name": "安义县",
						"pid": 1257
					},
					{
						"id": 1266,
						"name": "进贤县",
						"pid": 1257
					}
				]
			},
			{
				"id": 1267,
				"name": "景德镇市",
				"pid": 14,
				"children": [{
						"id": 1268,
						"name": "昌江区",
						"pid": 1267
					},
					{
						"id": 1269,
						"name": "珠山区",
						"pid": 1267
					},
					{
						"id": 1270,
						"name": "浮梁县",
						"pid": 1267
					},
					{
						"id": 1271,
						"name": "乐平市",
						"pid": 1267
					}
				]
			},
			{
				"id": 1272,
				"name": "萍乡市",
				"pid": 14,
				"children": [{
						"id": 1273,
						"name": "安源区",
						"pid": 1272
					},
					{
						"id": 1274,
						"name": "湘东区",
						"pid": 1272
					},
					{
						"id": 1275,
						"name": "莲花县",
						"pid": 1272
					},
					{
						"id": 1276,
						"name": "上栗县",
						"pid": 1272
					},
					{
						"id": 1277,
						"name": "芦溪县",
						"pid": 1272
					}
				]
			},
			{
				"id": 1278,
				"name": "九江市",
				"pid": 14,
				"children": [{
						"id": 1279,
						"name": "濂溪区",
						"pid": 1278
					},
					{
						"id": 1280,
						"name": "浔阳区",
						"pid": 1278
					},
					{
						"id": 1281,
						"name": "柴桑区",
						"pid": 1278
					},
					{
						"id": 1282,
						"name": "武宁县",
						"pid": 1278
					},
					{
						"id": 1283,
						"name": "修水县",
						"pid": 1278
					},
					{
						"id": 1284,
						"name": "永修县",
						"pid": 1278
					},
					{
						"id": 1285,
						"name": "德安县",
						"pid": 1278
					},
					{
						"id": 1286,
						"name": "都昌县",
						"pid": 1278
					},
					{
						"id": 1287,
						"name": "湖口县",
						"pid": 1278
					},
					{
						"id": 1288,
						"name": "彭泽县",
						"pid": 1278
					},
					{
						"id": 1289,
						"name": "瑞昌市",
						"pid": 1278
					},
					{
						"id": 1290,
						"name": "共青城市",
						"pid": 1278
					},
					{
						"id": 1291,
						"name": "庐山市",
						"pid": 1278
					}
				]
			},
			{
				"id": 1292,
				"name": "新余市",
				"pid": 14,
				"children": [{
						"id": 1293,
						"name": "渝水区",
						"pid": 1292
					},
					{
						"id": 1294,
						"name": "分宜县",
						"pid": 1292
					}
				]
			},
			{
				"id": 1295,
				"name": "鹰潭市",
				"pid": 14,
				"children": [{
						"id": 1296,
						"name": "月湖区",
						"pid": 1295
					},
					{
						"id": 1297,
						"name": "余江县",
						"pid": 1295
					},
					{
						"id": 1298,
						"name": "贵溪市",
						"pid": 1295
					}
				]
			},
			{
				"id": 1299,
				"name": "赣州市",
				"pid": 14,
				"children": [{
						"id": 1300,
						"name": "章贡区",
						"pid": 1299
					},
					{
						"id": 1301,
						"name": "南康区",
						"pid": 1299
					},
					{
						"id": 1302,
						"name": "赣县区",
						"pid": 1299
					},
					{
						"id": 1303,
						"name": "信丰县",
						"pid": 1299
					},
					{
						"id": 1304,
						"name": "大余县",
						"pid": 1299
					},
					{
						"id": 1305,
						"name": "上犹县",
						"pid": 1299
					},
					{
						"id": 1306,
						"name": "崇义县",
						"pid": 1299
					},
					{
						"id": 1307,
						"name": "安远县",
						"pid": 1299
					},
					{
						"id": 1308,
						"name": "龙南县",
						"pid": 1299
					},
					{
						"id": 1309,
						"name": "定南县",
						"pid": 1299
					},
					{
						"id": 1310,
						"name": "全南县",
						"pid": 1299
					},
					{
						"id": 1311,
						"name": "宁都县",
						"pid": 1299
					},
					{
						"id": 1312,
						"name": "于都县",
						"pid": 1299
					},
					{
						"id": 1313,
						"name": "兴国县",
						"pid": 1299
					},
					{
						"id": 1314,
						"name": "会昌县",
						"pid": 1299
					},
					{
						"id": 1315,
						"name": "寻乌县",
						"pid": 1299
					},
					{
						"id": 1316,
						"name": "石城县",
						"pid": 1299
					},
					{
						"id": 1317,
						"name": "瑞金市",
						"pid": 1299
					}
				]
			},
			{
				"id": 1318,
				"name": "吉安市",
				"pid": 14,
				"children": [{
						"id": 1319,
						"name": "吉州区",
						"pid": 1318
					},
					{
						"id": 1320,
						"name": "青原区",
						"pid": 1318
					},
					{
						"id": 1321,
						"name": "吉安县",
						"pid": 1318
					},
					{
						"id": 1322,
						"name": "吉水县",
						"pid": 1318
					},
					{
						"id": 1323,
						"name": "峡江县",
						"pid": 1318
					},
					{
						"id": 1324,
						"name": "新干县",
						"pid": 1318
					},
					{
						"id": 1325,
						"name": "永丰县",
						"pid": 1318
					},
					{
						"id": 1326,
						"name": "泰和县",
						"pid": 1318
					},
					{
						"id": 1327,
						"name": "遂川县",
						"pid": 1318
					},
					{
						"id": 1328,
						"name": "万安县",
						"pid": 1318
					},
					{
						"id": 1329,
						"name": "安福县",
						"pid": 1318
					},
					{
						"id": 1330,
						"name": "永新县",
						"pid": 1318
					},
					{
						"id": 1331,
						"name": "井冈山市",
						"pid": 1318
					}
				]
			},
			{
				"id": 1332,
				"name": "宜春市",
				"pid": 14,
				"children": [{
						"id": 1333,
						"name": "袁州区",
						"pid": 1332
					},
					{
						"id": 1334,
						"name": "奉新县",
						"pid": 1332
					},
					{
						"id": 1335,
						"name": "万载县",
						"pid": 1332
					},
					{
						"id": 1336,
						"name": "上高县",
						"pid": 1332
					},
					{
						"id": 1337,
						"name": "宜丰县",
						"pid": 1332
					},
					{
						"id": 1338,
						"name": "靖安县",
						"pid": 1332
					},
					{
						"id": 1339,
						"name": "铜鼓县",
						"pid": 1332
					},
					{
						"id": 1340,
						"name": "丰城市",
						"pid": 1332
					},
					{
						"id": 1341,
						"name": "樟树市",
						"pid": 1332
					},
					{
						"id": 1342,
						"name": "高安市",
						"pid": 1332
					}
				]
			},
			{
				"id": 1343,
				"name": "抚州市",
				"pid": 14,
				"children": [{
						"id": 1344,
						"name": "临川区",
						"pid": 1343
					},
					{
						"id": 1345,
						"name": "东乡区",
						"pid": 1343
					},
					{
						"id": 1346,
						"name": "南城县",
						"pid": 1343
					},
					{
						"id": 1347,
						"name": "黎川县",
						"pid": 1343
					},
					{
						"id": 1348,
						"name": "南丰县",
						"pid": 1343
					},
					{
						"id": 1349,
						"name": "崇仁县",
						"pid": 1343
					},
					{
						"id": 1350,
						"name": "乐安县",
						"pid": 1343
					},
					{
						"id": 1351,
						"name": "宜黄县",
						"pid": 1343
					},
					{
						"id": 1352,
						"name": "金溪县",
						"pid": 1343
					},
					{
						"id": 1353,
						"name": "资溪县",
						"pid": 1343
					},
					{
						"id": 1354,
						"name": "广昌县",
						"pid": 1343
					}
				]
			},
			{
				"id": 1355,
				"name": "上饶市",
				"pid": 14,
				"children": [{
						"id": 1356,
						"name": "信州区",
						"pid": 1355
					},
					{
						"id": 1357,
						"name": "广丰区",
						"pid": 1355
					},
					{
						"id": 1358,
						"name": "上饶县",
						"pid": 1355
					},
					{
						"id": 1359,
						"name": "玉山县",
						"pid": 1355
					},
					{
						"id": 1360,
						"name": "铅山县",
						"pid": 1355
					},
					{
						"id": 1361,
						"name": "横峰县",
						"pid": 1355
					},
					{
						"id": 1362,
						"name": "弋阳县",
						"pid": 1355
					},
					{
						"id": 1363,
						"name": "余干县",
						"pid": 1355
					},
					{
						"id": 1364,
						"name": "鄱阳县",
						"pid": 1355
					},
					{
						"id": 1365,
						"name": "万年县",
						"pid": 1355
					},
					{
						"id": 1366,
						"name": "婺源县",
						"pid": 1355
					},
					{
						"id": 1367,
						"name": "德兴市",
						"pid": 1355
					}
				]
			}
		]
	},
	{
		"id": 15,
		"name": "山东省",
		"pid": 0,
		"children": [{
				"id": 1368,
				"name": "济南市",
				"pid": 15,
				"children": [{
						"id": 1369,
						"name": "历下区",
						"pid": 1368
					},
					{
						"id": 1370,
						"name": "市中区",
						"pid": 1368
					},
					{
						"id": 1371,
						"name": "槐荫区",
						"pid": 1368
					},
					{
						"id": 1372,
						"name": "天桥区",
						"pid": 1368
					},
					{
						"id": 1373,
						"name": "历城区",
						"pid": 1368
					},
					{
						"id": 1374,
						"name": "长清区",
						"pid": 1368
					},
					{
						"id": 1375,
						"name": "章丘区",
						"pid": 1368
					},
					{
						"id": 1376,
						"name": "平阴县",
						"pid": 1368
					},
					{
						"id": 1377,
						"name": "济阳县",
						"pid": 1368
					},
					{
						"id": 1378,
						"name": "商河县",
						"pid": 1368
					}
				]
			},
			{
				"id": 1379,
				"name": "青岛市",
				"pid": 15,
				"children": [{
						"id": 1380,
						"name": "市南区",
						"pid": 1379
					},
					{
						"id": 1381,
						"name": "市北区",
						"pid": 1379
					},
					{
						"id": 1382,
						"name": "黄岛区",
						"pid": 1379
					},
					{
						"id": 1383,
						"name": "崂山区",
						"pid": 1379
					},
					{
						"id": 1384,
						"name": "李沧区",
						"pid": 1379
					},
					{
						"id": 1385,
						"name": "城阳区",
						"pid": 1379
					},
					{
						"id": 1386,
						"name": "即墨区",
						"pid": 1379
					},
					{
						"id": 1387,
						"name": "胶州市",
						"pid": 1379
					},
					{
						"id": 1388,
						"name": "平度市",
						"pid": 1379
					},
					{
						"id": 1389,
						"name": "莱西市",
						"pid": 1379
					}
				]
			},
			{
				"id": 1390,
				"name": "淄博市",
				"pid": 15,
				"children": [{
						"id": 1391,
						"name": "淄川区",
						"pid": 1390
					},
					{
						"id": 1392,
						"name": "张店区",
						"pid": 1390
					},
					{
						"id": 1393,
						"name": "博山区",
						"pid": 1390
					},
					{
						"id": 1394,
						"name": "临淄区",
						"pid": 1390
					},
					{
						"id": 1395,
						"name": "周村区",
						"pid": 1390
					},
					{
						"id": 1396,
						"name": "桓台县",
						"pid": 1390
					},
					{
						"id": 1397,
						"name": "高青县",
						"pid": 1390
					},
					{
						"id": 1398,
						"name": "沂源县",
						"pid": 1390
					}
				]
			},
			{
				"id": 1399,
				"name": "枣庄市",
				"pid": 15,
				"children": [{
						"id": 1400,
						"name": "市中区",
						"pid": 1399
					},
					{
						"id": 1401,
						"name": "薛城区",
						"pid": 1399
					},
					{
						"id": 1402,
						"name": "峄城区",
						"pid": 1399
					},
					{
						"id": 1403,
						"name": "台儿庄区",
						"pid": 1399
					},
					{
						"id": 1404,
						"name": "山亭区",
						"pid": 1399
					},
					{
						"id": 1405,
						"name": "滕州市",
						"pid": 1399
					}
				]
			},
			{
				"id": 1406,
				"name": "东营市",
				"pid": 15,
				"children": [{
						"id": 1407,
						"name": "东营区",
						"pid": 1406
					},
					{
						"id": 1408,
						"name": "河口区",
						"pid": 1406
					},
					{
						"id": 1409,
						"name": "垦利区",
						"pid": 1406
					},
					{
						"id": 1410,
						"name": "利津县",
						"pid": 1406
					},
					{
						"id": 1411,
						"name": "广饶县",
						"pid": 1406
					}
				]
			},
			{
				"id": 1412,
				"name": "烟台市",
				"pid": 15,
				"children": [{
						"id": 1413,
						"name": "芝罘区",
						"pid": 1412
					},
					{
						"id": 1414,
						"name": "福山区",
						"pid": 1412
					},
					{
						"id": 1415,
						"name": "牟平区",
						"pid": 1412
					},
					{
						"id": 1416,
						"name": "莱山区",
						"pid": 1412
					},
					{
						"id": 1417,
						"name": "长岛县",
						"pid": 1412
					},
					{
						"id": 1418,
						"name": "龙口市",
						"pid": 1412
					},
					{
						"id": 1419,
						"name": "莱阳市",
						"pid": 1412
					},
					{
						"id": 1420,
						"name": "莱州市",
						"pid": 1412
					},
					{
						"id": 1421,
						"name": "蓬莱市",
						"pid": 1412
					},
					{
						"id": 1422,
						"name": "招远市",
						"pid": 1412
					},
					{
						"id": 1423,
						"name": "栖霞市",
						"pid": 1412
					},
					{
						"id": 1424,
						"name": "海阳市",
						"pid": 1412
					}
				]
			},
			{
				"id": 1425,
				"name": "潍坊市",
				"pid": 15,
				"children": [{
						"id": 1426,
						"name": "潍城区",
						"pid": 1425
					},
					{
						"id": 1427,
						"name": "寒亭区",
						"pid": 1425
					},
					{
						"id": 1428,
						"name": "坊子区",
						"pid": 1425
					},
					{
						"id": 1429,
						"name": "奎文区",
						"pid": 1425
					},
					{
						"id": 1430,
						"name": "临朐县",
						"pid": 1425
					},
					{
						"id": 1431,
						"name": "昌乐县",
						"pid": 1425
					},
					{
						"id": 1432,
						"name": "青州市",
						"pid": 1425
					},
					{
						"id": 1433,
						"name": "诸城市",
						"pid": 1425
					},
					{
						"id": 1434,
						"name": "寿光市",
						"pid": 1425
					},
					{
						"id": 1435,
						"name": "安丘市",
						"pid": 1425
					},
					{
						"id": 1436,
						"name": "高密市",
						"pid": 1425
					},
					{
						"id": 1437,
						"name": "昌邑市",
						"pid": 1425
					}
				]
			},
			{
				"id": 1438,
				"name": "济宁市",
				"pid": 15,
				"children": [{
						"id": 1439,
						"name": "任城区",
						"pid": 1438
					},
					{
						"id": 1440,
						"name": "兖州区",
						"pid": 1438
					},
					{
						"id": 1441,
						"name": "微山县",
						"pid": 1438
					},
					{
						"id": 1442,
						"name": "鱼台县",
						"pid": 1438
					},
					{
						"id": 1443,
						"name": "金乡县",
						"pid": 1438
					},
					{
						"id": 1444,
						"name": "嘉祥县",
						"pid": 1438
					},
					{
						"id": 1445,
						"name": "汶上县",
						"pid": 1438
					},
					{
						"id": 1446,
						"name": "泗水县",
						"pid": 1438
					},
					{
						"id": 1447,
						"name": "梁山县",
						"pid": 1438
					},
					{
						"id": 1448,
						"name": "曲阜市",
						"pid": 1438
					},
					{
						"id": 1449,
						"name": "邹城市",
						"pid": 1438
					}
				]
			},
			{
				"id": 1450,
				"name": "泰安市",
				"pid": 15,
				"children": [{
						"id": 1451,
						"name": "泰山区",
						"pid": 1450
					},
					{
						"id": 1452,
						"name": "岱岳区",
						"pid": 1450
					},
					{
						"id": 1453,
						"name": "宁阳县",
						"pid": 1450
					},
					{
						"id": 1454,
						"name": "东平县",
						"pid": 1450
					},
					{
						"id": 1455,
						"name": "新泰市",
						"pid": 1450
					},
					{
						"id": 1456,
						"name": "肥城市",
						"pid": 1450
					}
				]
			},
			{
				"id": 1457,
				"name": "威海市",
				"pid": 15,
				"children": [{
						"id": 1458,
						"name": "环翠区",
						"pid": 1457
					},
					{
						"id": 1459,
						"name": "文登区",
						"pid": 1457
					},
					{
						"id": 1460,
						"name": "荣成市",
						"pid": 1457
					},
					{
						"id": 1461,
						"name": "乳山市",
						"pid": 1457
					}
				]
			},
			{
				"id": 1462,
				"name": "日照市",
				"pid": 15,
				"children": [{
						"id": 1463,
						"name": "东港区",
						"pid": 1462
					},
					{
						"id": 1464,
						"name": "岚山区",
						"pid": 1462
					},
					{
						"id": 1465,
						"name": "五莲县",
						"pid": 1462
					},
					{
						"id": 1466,
						"name": "莒县",
						"pid": 1462
					}
				]
			},
			{
				"id": 1467,
				"name": "莱芜市",
				"pid": 15,
				"children": [{
						"id": 1468,
						"name": "莱城区",
						"pid": 1467
					},
					{
						"id": 1469,
						"name": "钢城区",
						"pid": 1467
					}
				]
			},
			{
				"id": 1470,
				"name": "临沂市",
				"pid": 15,
				"children": [{
						"id": 1471,
						"name": "兰山区",
						"pid": 1470
					},
					{
						"id": 1472,
						"name": "罗庄区",
						"pid": 1470
					},
					{
						"id": 1473,
						"name": "河东区",
						"pid": 1470
					},
					{
						"id": 1474,
						"name": "沂南县",
						"pid": 1470
					},
					{
						"id": 1475,
						"name": "郯城县",
						"pid": 1470
					},
					{
						"id": 1476,
						"name": "沂水县",
						"pid": 1470
					},
					{
						"id": 1477,
						"name": "兰陵县",
						"pid": 1470
					},
					{
						"id": 1478,
						"name": "费县",
						"pid": 1470
					},
					{
						"id": 1479,
						"name": "平邑县",
						"pid": 1470
					},
					{
						"id": 1480,
						"name": "莒南县",
						"pid": 1470
					},
					{
						"id": 1481,
						"name": "蒙阴县",
						"pid": 1470
					},
					{
						"id": 1482,
						"name": "临沭县",
						"pid": 1470
					}
				]
			},
			{
				"id": 1483,
				"name": "德州市",
				"pid": 15,
				"children": [{
						"id": 1484,
						"name": "德城区",
						"pid": 1483
					},
					{
						"id": 1485,
						"name": "陵城区",
						"pid": 1483
					},
					{
						"id": 1486,
						"name": "宁津县",
						"pid": 1483
					},
					{
						"id": 1487,
						"name": "庆云县",
						"pid": 1483
					},
					{
						"id": 1488,
						"name": "临邑县",
						"pid": 1483
					},
					{
						"id": 1489,
						"name": "齐河县",
						"pid": 1483
					},
					{
						"id": 1490,
						"name": "平原县",
						"pid": 1483
					},
					{
						"id": 1491,
						"name": "夏津县",
						"pid": 1483
					},
					{
						"id": 1492,
						"name": "武城县",
						"pid": 1483
					},
					{
						"id": 1493,
						"name": "乐陵市",
						"pid": 1483
					},
					{
						"id": 1494,
						"name": "禹城市",
						"pid": 1483
					}
				]
			},
			{
				"id": 1495,
				"name": "聊城市",
				"pid": 15,
				"children": [{
						"id": 1496,
						"name": "东昌府区",
						"pid": 1495
					},
					{
						"id": 1497,
						"name": "阳谷县",
						"pid": 1495
					},
					{
						"id": 1498,
						"name": "莘县",
						"pid": 1495
					},
					{
						"id": 1499,
						"name": "茌平县",
						"pid": 1495
					},
					{
						"id": 1500,
						"name": "东阿县",
						"pid": 1495
					},
					{
						"id": 1501,
						"name": "冠县",
						"pid": 1495
					},
					{
						"id": 1502,
						"name": "高唐县",
						"pid": 1495
					},
					{
						"id": 1503,
						"name": "临清市",
						"pid": 1495
					}
				]
			},
			{
				"id": 1504,
				"name": "滨州市",
				"pid": 15,
				"children": [{
						"id": 1505,
						"name": "滨城区",
						"pid": 1504
					},
					{
						"id": 1506,
						"name": "沾化区",
						"pid": 1504
					},
					{
						"id": 1507,
						"name": "惠民县",
						"pid": 1504
					},
					{
						"id": 1508,
						"name": "阳信县",
						"pid": 1504
					},
					{
						"id": 1509,
						"name": "无棣县",
						"pid": 1504
					},
					{
						"id": 1510,
						"name": "博兴县",
						"pid": 1504
					},
					{
						"id": 1511,
						"name": "邹平县",
						"pid": 1504
					}
				]
			},
			{
				"id": 1512,
				"name": "菏泽市",
				"pid": 15,
				"children": [{
						"id": 1513,
						"name": "牡丹区",
						"pid": 1512
					},
					{
						"id": 1514,
						"name": "定陶区",
						"pid": 1512
					},
					{
						"id": 1515,
						"name": "曹县",
						"pid": 1512
					},
					{
						"id": 1516,
						"name": "单县",
						"pid": 1512
					},
					{
						"id": 1517,
						"name": "成武县",
						"pid": 1512
					},
					{
						"id": 1518,
						"name": "巨野县",
						"pid": 1512
					},
					{
						"id": 1519,
						"name": "郓城县",
						"pid": 1512
					},
					{
						"id": 1520,
						"name": "鄄城县",
						"pid": 1512
					},
					{
						"id": 1521,
						"name": "东明县",
						"pid": 1512
					}
				]
			}
		]
	},
	{
		"id": 16,
		"name": "河南省",
		"pid": 0,
		"children": [{
				"id": 1522,
				"name": "郑州市",
				"pid": 16,
				"children": [{
						"id": 1523,
						"name": "中原区",
						"pid": 1522
					},
					{
						"id": 1524,
						"name": "二七区",
						"pid": 1522
					},
					{
						"id": 1525,
						"name": "管城回族区",
						"pid": 1522
					},
					{
						"id": 1526,
						"name": "金水区",
						"pid": 1522
					},
					{
						"id": 1527,
						"name": "上街区",
						"pid": 1522
					},
					{
						"id": 1528,
						"name": "惠济区",
						"pid": 1522
					},
					{
						"id": 1529,
						"name": "中牟县",
						"pid": 1522
					},
					{
						"id": 1530,
						"name": "巩义市",
						"pid": 1522
					},
					{
						"id": 1531,
						"name": "荥阳市",
						"pid": 1522
					},
					{
						"id": 1532,
						"name": "新密市",
						"pid": 1522
					},
					{
						"id": 1533,
						"name": "新郑市",
						"pid": 1522
					},
					{
						"id": 1534,
						"name": "登封市",
						"pid": 1522
					}
				]
			},
			{
				"id": 1535,
				"name": "开封市",
				"pid": 16,
				"children": [{
						"id": 1536,
						"name": "龙亭区",
						"pid": 1535
					},
					{
						"id": 1537,
						"name": "顺河回族区",
						"pid": 1535
					},
					{
						"id": 1538,
						"name": "鼓楼区",
						"pid": 1535
					},
					{
						"id": 1539,
						"name": "禹王台区",
						"pid": 1535
					},
					{
						"id": 1540,
						"name": "祥符区",
						"pid": 1535
					},
					{
						"id": 1541,
						"name": "杞县",
						"pid": 1535
					},
					{
						"id": 1542,
						"name": "通许县",
						"pid": 1535
					},
					{
						"id": 1543,
						"name": "尉氏县",
						"pid": 1535
					},
					{
						"id": 1544,
						"name": "兰考县",
						"pid": 1535
					}
				]
			},
			{
				"id": 1545,
				"name": "洛阳市",
				"pid": 16,
				"children": [{
						"id": 1546,
						"name": "老城区",
						"pid": 1545
					},
					{
						"id": 1547,
						"name": "西工区",
						"pid": 1545
					},
					{
						"id": 1548,
						"name": "瀍河回族区",
						"pid": 1545
					},
					{
						"id": 1549,
						"name": "涧西区",
						"pid": 1545
					},
					{
						"id": 1550,
						"name": "吉利区",
						"pid": 1545
					},
					{
						"id": 1551,
						"name": "洛龙区",
						"pid": 1545
					},
					{
						"id": 1552,
						"name": "孟津县",
						"pid": 1545
					},
					{
						"id": 1553,
						"name": "新安县",
						"pid": 1545
					},
					{
						"id": 1554,
						"name": "栾川县",
						"pid": 1545
					},
					{
						"id": 1555,
						"name": "嵩县",
						"pid": 1545
					},
					{
						"id": 1556,
						"name": "汝阳县",
						"pid": 1545
					},
					{
						"id": 1557,
						"name": "宜阳县",
						"pid": 1545
					},
					{
						"id": 1558,
						"name": "洛宁县",
						"pid": 1545
					},
					{
						"id": 1559,
						"name": "伊川县",
						"pid": 1545
					},
					{
						"id": 1560,
						"name": "偃师市",
						"pid": 1545
					}
				]
			},
			{
				"id": 1561,
				"name": "平顶山市",
				"pid": 16,
				"children": [{
						"id": 1562,
						"name": "新华区",
						"pid": 1561
					},
					{
						"id": 1563,
						"name": "卫东区",
						"pid": 1561
					},
					{
						"id": 1564,
						"name": "石龙区",
						"pid": 1561
					},
					{
						"id": 1565,
						"name": "湛河区",
						"pid": 1561
					},
					{
						"id": 1566,
						"name": "宝丰县",
						"pid": 1561
					},
					{
						"id": 1567,
						"name": "叶县",
						"pid": 1561
					},
					{
						"id": 1568,
						"name": "鲁山县",
						"pid": 1561
					},
					{
						"id": 1569,
						"name": "郏县",
						"pid": 1561
					},
					{
						"id": 1570,
						"name": "舞钢市",
						"pid": 1561
					},
					{
						"id": 1571,
						"name": "汝州市",
						"pid": 1561
					}
				]
			},
			{
				"id": 1572,
				"name": "安阳市",
				"pid": 16,
				"children": [{
						"id": 1573,
						"name": "文峰区",
						"pid": 1572
					},
					{
						"id": 1574,
						"name": "北关区",
						"pid": 1572
					},
					{
						"id": 1575,
						"name": "殷都区",
						"pid": 1572
					},
					{
						"id": 1576,
						"name": "龙安区",
						"pid": 1572
					},
					{
						"id": 1577,
						"name": "安阳县",
						"pid": 1572
					},
					{
						"id": 1578,
						"name": "汤阴县",
						"pid": 1572
					},
					{
						"id": 1579,
						"name": "滑县",
						"pid": 1572
					},
					{
						"id": 1580,
						"name": "内黄县",
						"pid": 1572
					},
					{
						"id": 1581,
						"name": "林州市",
						"pid": 1572
					}
				]
			},
			{
				"id": 1582,
				"name": "鹤壁市",
				"pid": 16,
				"children": [{
						"id": 1583,
						"name": "鹤山区",
						"pid": 1582
					},
					{
						"id": 1584,
						"name": "山城区",
						"pid": 1582
					},
					{
						"id": 1585,
						"name": "淇滨区",
						"pid": 1582
					},
					{
						"id": 1586,
						"name": "浚县",
						"pid": 1582
					},
					{
						"id": 1587,
						"name": "淇县",
						"pid": 1582
					}
				]
			},
			{
				"id": 1588,
				"name": "新乡市",
				"pid": 16,
				"children": [{
						"id": 1589,
						"name": "红旗区",
						"pid": 1588
					},
					{
						"id": 1590,
						"name": "卫滨区",
						"pid": 1588
					},
					{
						"id": 1591,
						"name": "凤泉区",
						"pid": 1588
					},
					{
						"id": 1592,
						"name": "牧野区",
						"pid": 1588
					},
					{
						"id": 1593,
						"name": "新乡县",
						"pid": 1588
					},
					{
						"id": 1594,
						"name": "获嘉县",
						"pid": 1588
					},
					{
						"id": 1595,
						"name": "原阳县",
						"pid": 1588
					},
					{
						"id": 1596,
						"name": "延津县",
						"pid": 1588
					},
					{
						"id": 1597,
						"name": "封丘县",
						"pid": 1588
					},
					{
						"id": 1598,
						"name": "长垣县",
						"pid": 1588
					},
					{
						"id": 1599,
						"name": "卫辉市",
						"pid": 1588
					},
					{
						"id": 1600,
						"name": "辉县市",
						"pid": 1588
					}
				]
			},
			{
				"id": 1601,
				"name": "焦作市",
				"pid": 16,
				"children": [{
						"id": 1602,
						"name": "解放区",
						"pid": 1601
					},
					{
						"id": 1603,
						"name": "中站区",
						"pid": 1601
					},
					{
						"id": 1604,
						"name": "马村区",
						"pid": 1601
					},
					{
						"id": 1605,
						"name": "山阳区",
						"pid": 1601
					},
					{
						"id": 1606,
						"name": "修武县",
						"pid": 1601
					},
					{
						"id": 1607,
						"name": "博爱县",
						"pid": 1601
					},
					{
						"id": 1608,
						"name": "武陟县",
						"pid": 1601
					},
					{
						"id": 1609,
						"name": "温县",
						"pid": 1601
					},
					{
						"id": 1610,
						"name": "沁阳市",
						"pid": 1601
					},
					{
						"id": 1611,
						"name": "孟州市",
						"pid": 1601
					}
				]
			},
			{
				"id": 1612,
				"name": "濮阳市",
				"pid": 16,
				"children": [{
						"id": 1613,
						"name": "华龙区",
						"pid": 1612
					},
					{
						"id": 1614,
						"name": "清丰县",
						"pid": 1612
					},
					{
						"id": 1615,
						"name": "南乐县",
						"pid": 1612
					},
					{
						"id": 1616,
						"name": "范县",
						"pid": 1612
					},
					{
						"id": 1617,
						"name": "台前县",
						"pid": 1612
					},
					{
						"id": 1618,
						"name": "濮阳县",
						"pid": 1612
					}
				]
			},
			{
				"id": 1619,
				"name": "许昌市",
				"pid": 16,
				"children": [{
						"id": 1620,
						"name": "魏都区",
						"pid": 1619
					},
					{
						"id": 1621,
						"name": "建安区",
						"pid": 1619
					},
					{
						"id": 1622,
						"name": "鄢陵县",
						"pid": 1619
					},
					{
						"id": 1623,
						"name": "襄城县",
						"pid": 1619
					},
					{
						"id": 1624,
						"name": "禹州市",
						"pid": 1619
					},
					{
						"id": 1625,
						"name": "长葛市",
						"pid": 1619
					}
				]
			},
			{
				"id": 1626,
				"name": "漯河市",
				"pid": 16,
				"children": [{
						"id": 1627,
						"name": "源汇区",
						"pid": 1626
					},
					{
						"id": 1628,
						"name": "郾城区",
						"pid": 1626
					},
					{
						"id": 1629,
						"name": "召陵区",
						"pid": 1626
					},
					{
						"id": 1630,
						"name": "舞阳县",
						"pid": 1626
					},
					{
						"id": 1631,
						"name": "临颍县",
						"pid": 1626
					}
				]
			},
			{
				"id": 1632,
				"name": "三门峡市",
				"pid": 16,
				"children": [{
						"id": 1633,
						"name": "湖滨区",
						"pid": 1632
					},
					{
						"id": 1634,
						"name": "陕州区",
						"pid": 1632
					},
					{
						"id": 1635,
						"name": "渑池县",
						"pid": 1632
					},
					{
						"id": 1636,
						"name": "卢氏县",
						"pid": 1632
					},
					{
						"id": 1637,
						"name": "义马市",
						"pid": 1632
					},
					{
						"id": 1638,
						"name": "灵宝市",
						"pid": 1632
					}
				]
			},
			{
				"id": 1639,
				"name": "南阳市",
				"pid": 16,
				"children": [{
						"id": 1640,
						"name": "宛城区",
						"pid": 1639
					},
					{
						"id": 1641,
						"name": "卧龙区",
						"pid": 1639
					},
					{
						"id": 1642,
						"name": "南召县",
						"pid": 1639
					},
					{
						"id": 1643,
						"name": "方城县",
						"pid": 1639
					},
					{
						"id": 1644,
						"name": "西峡县",
						"pid": 1639
					},
					{
						"id": 1645,
						"name": "镇平县",
						"pid": 1639
					},
					{
						"id": 1646,
						"name": "内乡县",
						"pid": 1639
					},
					{
						"id": 1647,
						"name": "淅川县",
						"pid": 1639
					},
					{
						"id": 1648,
						"name": "社旗县",
						"pid": 1639
					},
					{
						"id": 1649,
						"name": "唐河县",
						"pid": 1639
					},
					{
						"id": 1650,
						"name": "新野县",
						"pid": 1639
					},
					{
						"id": 1651,
						"name": "桐柏县",
						"pid": 1639
					},
					{
						"id": 1652,
						"name": "邓州市",
						"pid": 1639
					}
				]
			},
			{
				"id": 1653,
				"name": "商丘市",
				"pid": 16,
				"children": [{
						"id": 1654,
						"name": "梁园区",
						"pid": 1653
					},
					{
						"id": 1655,
						"name": "睢阳区",
						"pid": 1653
					},
					{
						"id": 1656,
						"name": "民权县",
						"pid": 1653
					},
					{
						"id": 1657,
						"name": "睢县",
						"pid": 1653
					},
					{
						"id": 1658,
						"name": "宁陵县",
						"pid": 1653
					},
					{
						"id": 1659,
						"name": "柘城县",
						"pid": 1653
					},
					{
						"id": 1660,
						"name": "虞城县",
						"pid": 1653
					},
					{
						"id": 1661,
						"name": "夏邑县",
						"pid": 1653
					},
					{
						"id": 1662,
						"name": "永城市",
						"pid": 1653
					}
				]
			},
			{
				"id": 1663,
				"name": "信阳市",
				"pid": 16,
				"children": [{
						"id": 1664,
						"name": "浉河区",
						"pid": 1663
					},
					{
						"id": 1665,
						"name": "平桥区",
						"pid": 1663
					},
					{
						"id": 1666,
						"name": "罗山县",
						"pid": 1663
					},
					{
						"id": 1667,
						"name": "光山县",
						"pid": 1663
					},
					{
						"id": 1668,
						"name": "新县",
						"pid": 1663
					},
					{
						"id": 1669,
						"name": "商城县",
						"pid": 1663
					},
					{
						"id": 1670,
						"name": "固始县",
						"pid": 1663
					},
					{
						"id": 1671,
						"name": "潢川县",
						"pid": 1663
					},
					{
						"id": 1672,
						"name": "淮滨县",
						"pid": 1663
					},
					{
						"id": 1673,
						"name": "息县",
						"pid": 1663
					}
				]
			},
			{
				"id": 1674,
				"name": "周口市",
				"pid": 16,
				"children": [{
						"id": 1675,
						"name": "川汇区",
						"pid": 1674
					},
					{
						"id": 1676,
						"name": "扶沟县",
						"pid": 1674
					},
					{
						"id": 1677,
						"name": "西华县",
						"pid": 1674
					},
					{
						"id": 1678,
						"name": "商水县",
						"pid": 1674
					},
					{
						"id": 1679,
						"name": "沈丘县",
						"pid": 1674
					},
					{
						"id": 1680,
						"name": "郸城县",
						"pid": 1674
					},
					{
						"id": 1681,
						"name": "淮阳县",
						"pid": 1674
					},
					{
						"id": 1682,
						"name": "太康县",
						"pid": 1674
					},
					{
						"id": 1683,
						"name": "鹿邑县",
						"pid": 1674
					},
					{
						"id": 1684,
						"name": "项城市",
						"pid": 1674
					}
				]
			},
			{
				"id": 1685,
				"name": "驻马店市",
				"pid": 16,
				"children": [{
						"id": 1686,
						"name": "驿城区",
						"pid": 1685
					},
					{
						"id": 1687,
						"name": "西平县",
						"pid": 1685
					},
					{
						"id": 1688,
						"name": "上蔡县",
						"pid": 1685
					},
					{
						"id": 1689,
						"name": "平舆县",
						"pid": 1685
					},
					{
						"id": 1690,
						"name": "正阳县",
						"pid": 1685
					},
					{
						"id": 1691,
						"name": "确山县",
						"pid": 1685
					},
					{
						"id": 1692,
						"name": "泌阳县",
						"pid": 1685
					},
					{
						"id": 1693,
						"name": "汝南县",
						"pid": 1685
					},
					{
						"id": 1694,
						"name": "遂平县",
						"pid": 1685
					},
					{
						"id": 1695,
						"name": "新蔡县",
						"pid": 1685
					}
				]
			},
			{
				"id": 1696,
				"name": "济源市",
				"pid": 16,
				"children": [{
					"id": 1697,
					"name": "济源市",
					"pid": 1696
				}]
			}
		]
	},
	{
		"id": 17,
		"name": "湖北省",
		"pid": 0,
		"children": [{
				"id": 1698,
				"name": "武汉市",
				"pid": 17,
				"children": [{
						"id": 1699,
						"name": "江岸区",
						"pid": 1698
					},
					{
						"id": 1700,
						"name": "江汉区",
						"pid": 1698
					},
					{
						"id": 1701,
						"name": "硚口区",
						"pid": 1698
					},
					{
						"id": 1702,
						"name": "汉阳区",
						"pid": 1698
					},
					{
						"id": 1703,
						"name": "武昌区",
						"pid": 1698
					},
					{
						"id": 1704,
						"name": "青山区",
						"pid": 1698
					},
					{
						"id": 1705,
						"name": "洪山区",
						"pid": 1698
					},
					{
						"id": 1706,
						"name": "东西湖区",
						"pid": 1698
					},
					{
						"id": 1707,
						"name": "汉南区",
						"pid": 1698
					},
					{
						"id": 1708,
						"name": "蔡甸区",
						"pid": 1698
					},
					{
						"id": 1709,
						"name": "江夏区",
						"pid": 1698
					},
					{
						"id": 1710,
						"name": "黄陂区",
						"pid": 1698
					},
					{
						"id": 1711,
						"name": "新洲区",
						"pid": 1698
					}
				]
			},
			{
				"id": 1712,
				"name": "黄石市",
				"pid": 17,
				"children": [{
						"id": 1713,
						"name": "黄石港区",
						"pid": 1712
					},
					{
						"id": 1714,
						"name": "西塞山区",
						"pid": 1712
					},
					{
						"id": 1715,
						"name": "下陆区",
						"pid": 1712
					},
					{
						"id": 1716,
						"name": "铁山区",
						"pid": 1712
					},
					{
						"id": 1717,
						"name": "阳新县",
						"pid": 1712
					},
					{
						"id": 1718,
						"name": "大冶市",
						"pid": 1712
					}
				]
			},
			{
				"id": 1719,
				"name": "十堰市",
				"pid": 17,
				"children": [{
						"id": 1720,
						"name": "茅箭区",
						"pid": 1719
					},
					{
						"id": 1721,
						"name": "张湾区",
						"pid": 1719
					},
					{
						"id": 1722,
						"name": "郧阳区",
						"pid": 1719
					},
					{
						"id": 1723,
						"name": "郧西县",
						"pid": 1719
					},
					{
						"id": 1724,
						"name": "竹山县",
						"pid": 1719
					},
					{
						"id": 1725,
						"name": "竹溪县",
						"pid": 1719
					},
					{
						"id": 1726,
						"name": "房县",
						"pid": 1719
					},
					{
						"id": 1727,
						"name": "丹江口市",
						"pid": 1719
					}
				]
			},
			{
				"id": 1728,
				"name": "宜昌市",
				"pid": 17,
				"children": [{
						"id": 1729,
						"name": "西陵区",
						"pid": 1728
					},
					{
						"id": 1730,
						"name": "伍家岗区",
						"pid": 1728
					},
					{
						"id": 1731,
						"name": "点军区",
						"pid": 1728
					},
					{
						"id": 1732,
						"name": "猇亭区",
						"pid": 1728
					},
					{
						"id": 1733,
						"name": "夷陵区",
						"pid": 1728
					},
					{
						"id": 1734,
						"name": "远安县",
						"pid": 1728
					},
					{
						"id": 1735,
						"name": "兴山县",
						"pid": 1728
					},
					{
						"id": 1736,
						"name": "秭归县",
						"pid": 1728
					},
					{
						"id": 1737,
						"name": "长阳土家族自治县",
						"pid": 1728
					},
					{
						"id": 1738,
						"name": "五峰土家族自治县",
						"pid": 1728
					},
					{
						"id": 1739,
						"name": "宜都市",
						"pid": 1728
					},
					{
						"id": 1740,
						"name": "当阳市",
						"pid": 1728
					},
					{
						"id": 1741,
						"name": "枝江市",
						"pid": 1728
					}
				]
			},
			{
				"id": 1742,
				"name": "襄阳市",
				"pid": 17,
				"children": [{
						"id": 1743,
						"name": "襄城区",
						"pid": 1742
					},
					{
						"id": 1744,
						"name": "樊城区",
						"pid": 1742
					},
					{
						"id": 1745,
						"name": "襄州区",
						"pid": 1742
					},
					{
						"id": 1746,
						"name": "南漳县",
						"pid": 1742
					},
					{
						"id": 1747,
						"name": "谷城县",
						"pid": 1742
					},
					{
						"id": 1748,
						"name": "保康县",
						"pid": 1742
					},
					{
						"id": 1749,
						"name": "老河口市",
						"pid": 1742
					},
					{
						"id": 1750,
						"name": "枣阳市",
						"pid": 1742
					},
					{
						"id": 1751,
						"name": "宜城市",
						"pid": 1742
					}
				]
			},
			{
				"id": 1752,
				"name": "鄂州市",
				"pid": 17,
				"children": [{
						"id": 1753,
						"name": "梁子湖区",
						"pid": 1752
					},
					{
						"id": 1754,
						"name": "华容区",
						"pid": 1752
					},
					{
						"id": 1755,
						"name": "鄂城区",
						"pid": 1752
					}
				]
			},
			{
				"id": 1756,
				"name": "荆门市",
				"pid": 17,
				"children": [{
						"id": 1757,
						"name": "东宝区",
						"pid": 1756
					},
					{
						"id": 1758,
						"name": "掇刀区",
						"pid": 1756
					},
					{
						"id": 1759,
						"name": "京山县",
						"pid": 1756
					},
					{
						"id": 1760,
						"name": "沙洋县",
						"pid": 1756
					},
					{
						"id": 1761,
						"name": "钟祥市",
						"pid": 1756
					}
				]
			},
			{
				"id": 1762,
				"name": "孝感市",
				"pid": 17,
				"children": [{
						"id": 1763,
						"name": "孝南区",
						"pid": 1762
					},
					{
						"id": 1764,
						"name": "孝昌县",
						"pid": 1762
					},
					{
						"id": 1765,
						"name": "大悟县",
						"pid": 1762
					},
					{
						"id": 1766,
						"name": "云梦县",
						"pid": 1762
					},
					{
						"id": 1767,
						"name": "应城市",
						"pid": 1762
					},
					{
						"id": 1768,
						"name": "安陆市",
						"pid": 1762
					},
					{
						"id": 1769,
						"name": "汉川市",
						"pid": 1762
					}
				]
			},
			{
				"id": 1770,
				"name": "荆州市",
				"pid": 17,
				"children": [{
						"id": 1771,
						"name": "沙市区",
						"pid": 1770
					},
					{
						"id": 1772,
						"name": "荆州区",
						"pid": 1770
					},
					{
						"id": 1773,
						"name": "公安县",
						"pid": 1770
					},
					{
						"id": 1774,
						"name": "监利县",
						"pid": 1770
					},
					{
						"id": 1775,
						"name": "江陵县",
						"pid": 1770
					},
					{
						"id": 1776,
						"name": "石首市",
						"pid": 1770
					},
					{
						"id": 1777,
						"name": "洪湖市",
						"pid": 1770
					},
					{
						"id": 1778,
						"name": "松滋市",
						"pid": 1770
					}
				]
			},
			{
				"id": 1779,
				"name": "黄冈市",
				"pid": 17,
				"children": []
			},
			{
				"id": 1790,
				"name": "咸宁市",
				"pid": 17,
				"children": [{
						"id": 1791,
						"name": "咸安区",
						"pid": 1790
					},
					{
						"id": 1792,
						"name": "嘉鱼县",
						"pid": 1790
					},
					{
						"id": 1793,
						"name": "通城县",
						"pid": 1790
					},
					{
						"id": 1794,
						"name": "崇阳县",
						"pid": 1790
					},
					{
						"id": 1795,
						"name": "通山县",
						"pid": 1790
					},
					{
						"id": 1796,
						"name": "赤壁市",
						"pid": 1790
					}
				]
			},
			{
				"id": 1797,
				"name": "随州市",
				"pid": 17,
				"children": [{
						"id": 1798,
						"name": "曾都区",
						"pid": 1797
					},
					{
						"id": 1799,
						"name": "随县",
						"pid": 1797
					},
					{
						"id": 1800,
						"name": "广水市",
						"pid": 1797
					}
				]
			},
			{
				"id": 1801,
				"name": "恩施土家族苗族自治州",
				"pid": 17,
				"children": [{
						"id": 1802,
						"name": "恩施市",
						"pid": 1801
					},
					{
						"id": 1803,
						"name": "利川市",
						"pid": 1801
					},
					{
						"id": 1804,
						"name": "建始县",
						"pid": 1801
					},
					{
						"id": 1805,
						"name": "巴东县",
						"pid": 1801
					},
					{
						"id": 1806,
						"name": "宣恩县",
						"pid": 1801
					},
					{
						"id": 1807,
						"name": "咸丰县",
						"pid": 1801
					},
					{
						"id": 1808,
						"name": "来凤县",
						"pid": 1801
					},
					{
						"id": 1809,
						"name": "鹤峰县",
						"pid": 1801
					}
				]
			},
			{
				"id": 1810,
				"name": "仙桃市",
				"pid": 17,
				"children": [{
					"id": 1814,
					"name": "仙桃市",
					"pid": 1810
				}]
			},
			{
				"id": 1811,
				"name": "潜江市",
				"pid": 17,
				"children": [{
					"id": 1815,
					"name": "潜江市",
					"pid": 1811
				}]
			},
			{
				"id": 1812,
				"name": "天门市",
				"pid": 17,
				"children": [{
					"id": 1816,
					"name": "天门市",
					"pid": 1812
				}]
			},
			{
				"id": 1813,
				"name": "神农架林区",
				"pid": 17,
				"children": [{
					"id": 1817,
					"name": "神农架林区",
					"pid": 1813
				}]
			}
		]
	},
	{
		"id": 18,
		"name": "湖南省",
		"pid": 0,
		"children": [{
				"id": 1818,
				"name": "长沙市",
				"pid": 18,
				"children": [{
						"id": 1819,
						"name": "芙蓉区",
						"pid": 1818
					},
					{
						"id": 1820,
						"name": "天心区",
						"pid": 1818
					},
					{
						"id": 1821,
						"name": "岳麓区",
						"pid": 1818
					},
					{
						"id": 1822,
						"name": "开福区",
						"pid": 1818
					},
					{
						"id": 1823,
						"name": "雨花区",
						"pid": 1818
					},
					{
						"id": 1824,
						"name": "望城区",
						"pid": 1818
					},
					{
						"id": 1825,
						"name": "长沙县",
						"pid": 1818
					},
					{
						"id": 1826,
						"name": "浏阳市",
						"pid": 1818
					},
					{
						"id": 1827,
						"name": "宁乡市",
						"pid": 1818
					}
				]
			},
			{
				"id": 1828,
				"name": "株洲市",
				"pid": 18,
				"children": [{
						"id": 1829,
						"name": "荷塘区",
						"pid": 1828
					},
					{
						"id": 1830,
						"name": "芦淞区",
						"pid": 1828
					},
					{
						"id": 1831,
						"name": "石峰区",
						"pid": 1828
					},
					{
						"id": 1832,
						"name": "天元区",
						"pid": 1828
					},
					{
						"id": 1833,
						"name": "株洲县",
						"pid": 1828
					},
					{
						"id": 1834,
						"name": "攸县",
						"pid": 1828
					},
					{
						"id": 1835,
						"name": "茶陵县",
						"pid": 1828
					},
					{
						"id": 1836,
						"name": "炎陵县",
						"pid": 1828
					},
					{
						"id": 1837,
						"name": "醴陵市",
						"pid": 1828
					}
				]
			},
			{
				"id": 1838,
				"name": "湘潭市",
				"pid": 18,
				"children": [{
						"id": 1839,
						"name": "雨湖区",
						"pid": 1838
					},
					{
						"id": 1840,
						"name": "岳塘区",
						"pid": 1838
					},
					{
						"id": 1841,
						"name": "湘潭县",
						"pid": 1838
					},
					{
						"id": 1842,
						"name": "湘乡市",
						"pid": 1838
					},
					{
						"id": 1843,
						"name": "韶山市",
						"pid": 1838
					}
				]
			},
			{
				"id": 1844,
				"name": "衡阳市",
				"pid": 18,
				"children": [{
						"id": 1845,
						"name": "珠晖区",
						"pid": 1844
					},
					{
						"id": 1846,
						"name": "雁峰区",
						"pid": 1844
					},
					{
						"id": 1847,
						"name": "石鼓区",
						"pid": 1844
					},
					{
						"id": 1848,
						"name": "蒸湘区",
						"pid": 1844
					},
					{
						"id": 1849,
						"name": "南岳区",
						"pid": 1844
					},
					{
						"id": 1850,
						"name": "衡阳县",
						"pid": 1844
					},
					{
						"id": 1851,
						"name": "衡南县",
						"pid": 1844
					},
					{
						"id": 1852,
						"name": "衡山县",
						"pid": 1844
					},
					{
						"id": 1853,
						"name": "衡东县",
						"pid": 1844
					},
					{
						"id": 1854,
						"name": "祁东县",
						"pid": 1844
					},
					{
						"id": 1855,
						"name": "耒阳市",
						"pid": 1844
					},
					{
						"id": 1856,
						"name": "常宁市",
						"pid": 1844
					}
				]
			},
			{
				"id": 1857,
				"name": "邵阳市",
				"pid": 18,
				"children": [{
						"id": 1858,
						"name": "双清区",
						"pid": 1857
					},
					{
						"id": 1859,
						"name": "大祥区",
						"pid": 1857
					},
					{
						"id": 1860,
						"name": "北塔区",
						"pid": 1857
					},
					{
						"id": 1861,
						"name": "邵东县",
						"pid": 1857
					},
					{
						"id": 1862,
						"name": "新邵县",
						"pid": 1857
					},
					{
						"id": 1863,
						"name": "邵阳县",
						"pid": 1857
					},
					{
						"id": 1864,
						"name": "隆回县",
						"pid": 1857
					},
					{
						"id": 1865,
						"name": "洞口县",
						"pid": 1857
					},
					{
						"id": 1866,
						"name": "绥宁县",
						"pid": 1857
					},
					{
						"id": 1867,
						"name": "新宁县",
						"pid": 1857
					},
					{
						"id": 1868,
						"name": "城步苗族自治县",
						"pid": 1857
					},
					{
						"id": 1869,
						"name": "武冈市",
						"pid": 1857
					}
				]
			},
			{
				"id": 1870,
				"name": "岳阳市",
				"pid": 18,
				"children": [{
						"id": 1871,
						"name": "岳阳楼区",
						"pid": 1870
					},
					{
						"id": 1872,
						"name": "云溪区",
						"pid": 1870
					},
					{
						"id": 1873,
						"name": "君山区",
						"pid": 1870
					},
					{
						"id": 1874,
						"name": "岳阳县",
						"pid": 1870
					},
					{
						"id": 1875,
						"name": "华容县",
						"pid": 1870
					},
					{
						"id": 1876,
						"name": "湘阴县",
						"pid": 1870
					},
					{
						"id": 1877,
						"name": "平江县",
						"pid": 1870
					},
					{
						"id": 1878,
						"name": "汨罗市",
						"pid": 1870
					},
					{
						"id": 1879,
						"name": "临湘市",
						"pid": 1870
					}
				]
			},
			{
				"id": 1880,
				"name": "常德市",
				"pid": 18,
				"children": [{
						"id": 1881,
						"name": "武陵区",
						"pid": 1880
					},
					{
						"id": 1882,
						"name": "鼎城区",
						"pid": 1880
					},
					{
						"id": 1883,
						"name": "安乡县",
						"pid": 1880
					},
					{
						"id": 1884,
						"name": "汉寿县",
						"pid": 1880
					},
					{
						"id": 1885,
						"name": "澧县",
						"pid": 1880
					},
					{
						"id": 1886,
						"name": "临澧县",
						"pid": 1880
					},
					{
						"id": 1887,
						"name": "桃源县",
						"pid": 1880
					},
					{
						"id": 1888,
						"name": "石门县",
						"pid": 1880
					},
					{
						"id": 1889,
						"name": "津市市",
						"pid": 1880
					}
				]
			},
			{
				"id": 1890,
				"name": "张家界市",
				"pid": 18,
				"children": [{
						"id": 1891,
						"name": "永定区",
						"pid": 1890
					},
					{
						"id": 1892,
						"name": "武陵源区",
						"pid": 1890
					},
					{
						"id": 1893,
						"name": "慈利县",
						"pid": 1890
					},
					{
						"id": 1894,
						"name": "桑植县",
						"pid": 1890
					}
				]
			},
			{
				"id": 1895,
				"name": "益阳市",
				"pid": 18,
				"children": [{
						"id": 1896,
						"name": "资阳区",
						"pid": 1895
					},
					{
						"id": 1897,
						"name": "赫山区",
						"pid": 1895
					},
					{
						"id": 1898,
						"name": "南县",
						"pid": 1895
					},
					{
						"id": 1899,
						"name": "桃江县",
						"pid": 1895
					},
					{
						"id": 1900,
						"name": "安化县",
						"pid": 1895
					},
					{
						"id": 1901,
						"name": "沅江市",
						"pid": 1895
					}
				]
			},
			{
				"id": 1902,
				"name": "郴州市",
				"pid": 18,
				"children": [{
						"id": 1903,
						"name": "北湖区",
						"pid": 1902
					},
					{
						"id": 1904,
						"name": "苏仙区",
						"pid": 1902
					},
					{
						"id": 1905,
						"name": "桂阳县",
						"pid": 1902
					},
					{
						"id": 1906,
						"name": "宜章县",
						"pid": 1902
					},
					{
						"id": 1907,
						"name": "永兴县",
						"pid": 1902
					},
					{
						"id": 1908,
						"name": "嘉禾县",
						"pid": 1902
					},
					{
						"id": 1909,
						"name": "临武县",
						"pid": 1902
					},
					{
						"id": 1910,
						"name": "汝城县",
						"pid": 1902
					},
					{
						"id": 1911,
						"name": "桂东县",
						"pid": 1902
					},
					{
						"id": 1912,
						"name": "安仁县",
						"pid": 1902
					},
					{
						"id": 1913,
						"name": "资兴市",
						"pid": 1902
					}
				]
			},
			{
				"id": 1914,
				"name": "永州市",
				"pid": 18,
				"children": [{
						"id": 1915,
						"name": "零陵区",
						"pid": 1914
					},
					{
						"id": 1916,
						"name": "冷水滩区",
						"pid": 1914
					},
					{
						"id": 1917,
						"name": "祁阳县",
						"pid": 1914
					},
					{
						"id": 1918,
						"name": "东安县",
						"pid": 1914
					},
					{
						"id": 1919,
						"name": "双牌县",
						"pid": 1914
					},
					{
						"id": 1920,
						"name": "道县",
						"pid": 1914
					},
					{
						"id": 1921,
						"name": "江永县",
						"pid": 1914
					},
					{
						"id": 1922,
						"name": "宁远县",
						"pid": 1914
					},
					{
						"id": 1923,
						"name": "蓝山县",
						"pid": 1914
					},
					{
						"id": 1924,
						"name": "新田县",
						"pid": 1914
					},
					{
						"id": 1925,
						"name": "江华瑶族自治县",
						"pid": 1914
					}
				]
			},
			{
				"id": 1926,
				"name": "怀化市",
				"pid": 18,
				"children": []
			},
			{
				"id": 1939,
				"name": "娄底市",
				"pid": 18,
				"children": [{
						"id": 1940,
						"name": "娄星区",
						"pid": 1939
					},
					{
						"id": 1941,
						"name": "双峰县",
						"pid": 1939
					},
					{
						"id": 1942,
						"name": "新化县",
						"pid": 1939
					},
					{
						"id": 1943,
						"name": "冷水江市",
						"pid": 1939
					},
					{
						"id": 1944,
						"name": "涟源市",
						"pid": 1939
					}
				]
			},
			{
				"id": 1945,
				"name": "湘西土家族苗族自治州",
				"pid": 18,
				"children": [{
						"id": 1946,
						"name": "吉首市",
						"pid": 1945
					},
					{
						"id": 1947,
						"name": "泸溪县",
						"pid": 1945
					},
					{
						"id": 1948,
						"name": "凤凰县",
						"pid": 1945
					},
					{
						"id": 1949,
						"name": "花垣县",
						"pid": 1945
					},
					{
						"id": 1950,
						"name": "保靖县",
						"pid": 1945
					},
					{
						"id": 1951,
						"name": "古丈县",
						"pid": 1945
					},
					{
						"id": 1952,
						"name": "永顺县",
						"pid": 1945
					},
					{
						"id": 1953,
						"name": "龙山县",
						"pid": 1945
					}
				]
			}
		]
	},
	{
		"id": 19,
		"name": "广东省",
		"pid": 0,
		"children": [{
				"id": 1954,
				"name": "广州市",
				"pid": 19,
				"children": [{
						"id": 1955,
						"name": "荔湾区",
						"pid": 1954
					},
					{
						"id": 1956,
						"name": "越秀区",
						"pid": 1954
					},
					{
						"id": 1957,
						"name": "海珠区",
						"pid": 1954
					},
					{
						"id": 1958,
						"name": "天河区",
						"pid": 1954
					},
					{
						"id": 1959,
						"name": "白云区",
						"pid": 1954
					},
					{
						"id": 1960,
						"name": "黄埔区",
						"pid": 1954
					},
					{
						"id": 1961,
						"name": "番禺区",
						"pid": 1954
					},
					{
						"id": 1962,
						"name": "花都区",
						"pid": 1954
					},
					{
						"id": 1963,
						"name": "南沙区",
						"pid": 1954
					},
					{
						"id": 1964,
						"name": "从化区",
						"pid": 1954
					},
					{
						"id": 1965,
						"name": "增城区",
						"pid": 1954
					}
				]
			},
			{
				"id": 1966,
				"name": "韶关市",
				"pid": 19,
				"children": [{
						"id": 1967,
						"name": "武江区",
						"pid": 1966
					},
					{
						"id": 1968,
						"name": "浈江区",
						"pid": 1966
					},
					{
						"id": 1969,
						"name": "曲江区",
						"pid": 1966
					},
					{
						"id": 1970,
						"name": "始兴县",
						"pid": 1966
					},
					{
						"id": 1971,
						"name": "仁化县",
						"pid": 1966
					},
					{
						"id": 1972,
						"name": "翁源县",
						"pid": 1966
					},
					{
						"id": 1973,
						"name": "乳源瑶族自治县",
						"pid": 1966
					},
					{
						"id": 1974,
						"name": "新丰县",
						"pid": 1966
					},
					{
						"id": 1975,
						"name": "乐昌市",
						"pid": 1966
					},
					{
						"id": 1976,
						"name": "南雄市",
						"pid": 1966
					}
				]
			},
			{
				"id": 1977,
				"name": "深圳市",
				"pid": 19,
				"children": [{
						"id": 1978,
						"name": "罗湖区",
						"pid": 1977
					},
					{
						"id": 1979,
						"name": "福田区",
						"pid": 1977
					},
					{
						"id": 1980,
						"name": "南山区",
						"pid": 1977
					},
					{
						"id": 1981,
						"name": "宝安区",
						"pid": 1977
					},
					{
						"id": 1982,
						"name": "龙岗区",
						"pid": 1977
					},
					{
						"id": 1983,
						"name": "盐田区",
						"pid": 1977
					},
					{
						"id": 1984,
						"name": "龙华区",
						"pid": 1977
					},
					{
						"id": 1985,
						"name": "坪山区",
						"pid": 1977
					}
				]
			},
			{
				"id": 1986,
				"name": "珠海市",
				"pid": 19,
				"children": [{
						"id": 1987,
						"name": "香洲区",
						"pid": 1986
					},
					{
						"id": 1988,
						"name": "斗门区",
						"pid": 1986
					},
					{
						"id": 1989,
						"name": "金湾区",
						"pid": 1986
					}
				]
			},
			{
				"id": 1990,
				"name": "汕头市",
				"pid": 19,
				"children": [{
						"id": 1991,
						"name": "龙湖区",
						"pid": 1990
					},
					{
						"id": 1992,
						"name": "金平区",
						"pid": 1990
					},
					{
						"id": 1993,
						"name": "濠江区",
						"pid": 1990
					},
					{
						"id": 1994,
						"name": "潮阳区",
						"pid": 1990
					},
					{
						"id": 1995,
						"name": "潮南区",
						"pid": 1990
					},
					{
						"id": 1996,
						"name": "澄海区",
						"pid": 1990
					},
					{
						"id": 1997,
						"name": "南澳县",
						"pid": 1990
					}
				]
			},
			{
				"id": 1998,
				"name": "佛山市",
				"pid": 19,
				"children": [{
						"id": 1999,
						"name": "禅城区",
						"pid": 1998
					},
					{
						"id": 2000,
						"name": "南海区",
						"pid": 1998
					},
					{
						"id": 2001,
						"name": "顺德区",
						"pid": 1998
					},
					{
						"id": 2002,
						"name": "三水区",
						"pid": 1998
					},
					{
						"id": 2003,
						"name": "高明区",
						"pid": 1998
					}
				]
			},
			{
				"id": 2004,
				"name": "江门市",
				"pid": 19,
				"children": [{
						"id": 2005,
						"name": "蓬江区",
						"pid": 2004
					},
					{
						"id": 2006,
						"name": "江海区",
						"pid": 2004
					},
					{
						"id": 2007,
						"name": "新会区",
						"pid": 2004
					},
					{
						"id": 2008,
						"name": "台山市",
						"pid": 2004
					},
					{
						"id": 2009,
						"name": "开平市",
						"pid": 2004
					},
					{
						"id": 2010,
						"name": "鹤山市",
						"pid": 2004
					},
					{
						"id": 2011,
						"name": "恩平市",
						"pid": 2004
					}
				]
			},
			{
				"id": 2012,
				"name": "湛江市",
				"pid": 19,
				"children": [{
						"id": 2013,
						"name": "赤坎区",
						"pid": 2012
					},
					{
						"id": 2014,
						"name": "霞山区",
						"pid": 2012
					},
					{
						"id": 2015,
						"name": "坡头区",
						"pid": 2012
					},
					{
						"id": 2016,
						"name": "麻章区",
						"pid": 2012
					},
					{
						"id": 2017,
						"name": "遂溪县",
						"pid": 2012
					},
					{
						"id": 2018,
						"name": "徐闻县",
						"pid": 2012
					},
					{
						"id": 2019,
						"name": "廉江市",
						"pid": 2012
					},
					{
						"id": 2020,
						"name": "雷州市",
						"pid": 2012
					},
					{
						"id": 2021,
						"name": "吴川市",
						"pid": 2012
					}
				]
			},
			{
				"id": 2022,
				"name": "茂名市",
				"pid": 19,
				"children": [{
						"id": 2023,
						"name": "茂南区",
						"pid": 2022
					},
					{
						"id": 2024,
						"name": "电白区",
						"pid": 2022
					},
					{
						"id": 2025,
						"name": "高州市",
						"pid": 2022
					},
					{
						"id": 2026,
						"name": "化州市",
						"pid": 2022
					},
					{
						"id": 2027,
						"name": "信宜市",
						"pid": 2022
					}
				]
			},
			{
				"id": 2028,
				"name": "肇庆市",
				"pid": 19,
				"children": [{
						"id": 2029,
						"name": "端州区",
						"pid": 2028
					},
					{
						"id": 2030,
						"name": "鼎湖区",
						"pid": 2028
					},
					{
						"id": 2031,
						"name": "高要区",
						"pid": 2028
					},
					{
						"id": 2032,
						"name": "广宁县",
						"pid": 2028
					},
					{
						"id": 2033,
						"name": "怀集县",
						"pid": 2028
					},
					{
						"id": 2034,
						"name": "封开县",
						"pid": 2028
					},
					{
						"id": 2035,
						"name": "德庆县",
						"pid": 2028
					},
					{
						"id": 2036,
						"name": "四会市",
						"pid": 2028
					}
				]
			},
			{
				"id": 2037,
				"name": "惠州市",
				"pid": 19,
				"children": [{
						"id": 2038,
						"name": "惠城区",
						"pid": 2037
					},
					{
						"id": 2039,
						"name": "惠阳区",
						"pid": 2037
					},
					{
						"id": 2040,
						"name": "博罗县",
						"pid": 2037
					},
					{
						"id": 2041,
						"name": "惠东县",
						"pid": 2037
					},
					{
						"id": 2042,
						"name": "龙门县",
						"pid": 2037
					}
				]
			},
			{
				"id": 2043,
				"name": "梅州市",
				"pid": 19,
				"children": [{
						"id": 2044,
						"name": "梅江区",
						"pid": 2043
					},
					{
						"id": 2045,
						"name": "梅县区",
						"pid": 2043
					},
					{
						"id": 2046,
						"name": "大埔县",
						"pid": 2043
					},
					{
						"id": 2047,
						"name": "丰顺县",
						"pid": 2043
					},
					{
						"id": 2048,
						"name": "五华县",
						"pid": 2043
					},
					{
						"id": 2049,
						"name": "平远县",
						"pid": 2043
					},
					{
						"id": 2050,
						"name": "蕉岭县",
						"pid": 2043
					},
					{
						"id": 2051,
						"name": "兴宁市",
						"pid": 2043
					}
				]
			},
			{
				"id": 2052,
				"name": "汕尾市",
				"pid": 19,
				"children": [{
						"id": 2053,
						"name": "城区",
						"pid": 2052
					},
					{
						"id": 2054,
						"name": "海丰县",
						"pid": 2052
					},
					{
						"id": 2055,
						"name": "陆河县",
						"pid": 2052
					},
					{
						"id": 2056,
						"name": "陆丰市",
						"pid": 2052
					}
				]
			},
			{
				"id": 2057,
				"name": "河源市",
				"pid": 19,
				"children": [{
						"id": 2058,
						"name": "源城区",
						"pid": 2057
					},
					{
						"id": 2059,
						"name": "紫金县",
						"pid": 2057
					},
					{
						"id": 2060,
						"name": "龙川县",
						"pid": 2057
					},
					{
						"id": 2061,
						"name": "连平县",
						"pid": 2057
					},
					{
						"id": 2062,
						"name": "和平县",
						"pid": 2057
					},
					{
						"id": 2063,
						"name": "东源县",
						"pid": 2057
					}
				]
			},
			{
				"id": 2064,
				"name": "阳江市",
				"pid": 19,
				"children": [{
						"id": 2065,
						"name": "江城区",
						"pid": 2064
					},
					{
						"id": 2066,
						"name": "阳东区",
						"pid": 2064
					},
					{
						"id": 2067,
						"name": "阳西县",
						"pid": 2064
					},
					{
						"id": 2068,
						"name": "阳春市",
						"pid": 2064
					}
				]
			},
			{
				"id": 2069,
				"name": "清远市",
				"pid": 19,
				"children": [{
						"id": 2070,
						"name": "清城区",
						"pid": 2069
					},
					{
						"id": 2071,
						"name": "清新区",
						"pid": 2069
					},
					{
						"id": 2072,
						"name": "佛冈县",
						"pid": 2069
					},
					{
						"id": 2073,
						"name": "阳山县",
						"pid": 2069
					},
					{
						"id": 2074,
						"name": "连山壮族瑶族自治县",
						"pid": 2069
					},
					{
						"id": 2075,
						"name": "连南瑶族自治县",
						"pid": 2069
					},
					{
						"id": 2076,
						"name": "英德市",
						"pid": 2069
					},
					{
						"id": 2077,
						"name": "连州市",
						"pid": 2069
					}
				]
			},
			{
				"id": 2078,
				"name": "东莞市",
				"pid": 19,
				"children": [{
					"id": 2096,
					"name": "东莞市",
					"pid": 2078
				}]
			},
			{
				"id": 2079,
				"name": "中山市",
				"pid": 19,
				"children": [{
					"id": 2097,
					"name": "中山市",
					"pid": 2079
				}]
			},
			{
				"id": 2080,
				"name": "潮州市",
				"pid": 19,
				"children": [{
						"id": 2081,
						"name": "湘桥区",
						"pid": 2080
					},
					{
						"id": 2082,
						"name": "潮安区",
						"pid": 2080
					},
					{
						"id": 2083,
						"name": "饶平县",
						"pid": 2080
					}
				]
			},
			{
				"id": 2084,
				"name": "揭阳市",
				"pid": 19,
				"children": [{
						"id": 2085,
						"name": "榕城区",
						"pid": 2084
					},
					{
						"id": 2086,
						"name": "揭东区",
						"pid": 2084
					},
					{
						"id": 2087,
						"name": "揭西县",
						"pid": 2084
					},
					{
						"id": 2088,
						"name": "惠来县",
						"pid": 2084
					},
					{
						"id": 2089,
						"name": "普宁市",
						"pid": 2084
					}
				]
			},
			{
				"id": 2090,
				"name": "云浮市",
				"pid": 19,
				"children": [{
						"id": 2091,
						"name": "云城区",
						"pid": 2090
					},
					{
						"id": 2092,
						"name": "云安区",
						"pid": 2090
					},
					{
						"id": 2093,
						"name": "新兴县",
						"pid": 2090
					},
					{
						"id": 2094,
						"name": "郁南县",
						"pid": 2090
					},
					{
						"id": 2095,
						"name": "罗定市",
						"pid": 2090
					}
				]
			}
		]
	},
	{
		"id": 20,
		"name": "广西壮族自治区",
		"pid": 0,
		"children": [{
				"id": 2098,
				"name": "南宁市",
				"pid": 20,
				"children": [{
						"id": 2099,
						"name": "兴宁区",
						"pid": 2098
					},
					{
						"id": 2100,
						"name": "青秀区",
						"pid": 2098
					},
					{
						"id": 2101,
						"name": "江南区",
						"pid": 2098
					},
					{
						"id": 2102,
						"name": "西乡塘区",
						"pid": 2098
					},
					{
						"id": 2103,
						"name": "良庆区",
						"pid": 2098
					},
					{
						"id": 2104,
						"name": "邕宁区",
						"pid": 2098
					},
					{
						"id": 2105,
						"name": "武鸣区",
						"pid": 2098
					},
					{
						"id": 2106,
						"name": "隆安县",
						"pid": 2098
					},
					{
						"id": 2107,
						"name": "马山县",
						"pid": 2098
					},
					{
						"id": 2108,
						"name": "上林县",
						"pid": 2098
					},
					{
						"id": 2109,
						"name": "宾阳县",
						"pid": 2098
					},
					{
						"id": 2110,
						"name": "横县",
						"pid": 2098
					}
				]
			},
			{
				"id": 2111,
				"name": "柳州市",
				"pid": 20,
				"children": [{
						"id": 2112,
						"name": "城中区",
						"pid": 2111
					},
					{
						"id": 2113,
						"name": "鱼峰区",
						"pid": 2111
					},
					{
						"id": 2114,
						"name": "柳南区",
						"pid": 2111
					},
					{
						"id": 2115,
						"name": "柳北区",
						"pid": 2111
					},
					{
						"id": 2116,
						"name": "柳江区",
						"pid": 2111
					},
					{
						"id": 2117,
						"name": "柳城县",
						"pid": 2111
					},
					{
						"id": 2118,
						"name": "鹿寨县",
						"pid": 2111
					},
					{
						"id": 2119,
						"name": "融安县",
						"pid": 2111
					},
					{
						"id": 2120,
						"name": "融水苗族自治县",
						"pid": 2111
					},
					{
						"id": 2121,
						"name": "三江侗族自治县",
						"pid": 2111
					}
				]
			},
			{
				"id": 2122,
				"name": "桂林市",
				"pid": 20,
				"children": [{
						"id": 2123,
						"name": "秀峰区",
						"pid": 2122
					},
					{
						"id": 2124,
						"name": "叠彩区",
						"pid": 2122
					},
					{
						"id": 2125,
						"name": "象山区",
						"pid": 2122
					},
					{
						"id": 2126,
						"name": "七星区",
						"pid": 2122
					},
					{
						"id": 2127,
						"name": "雁山区",
						"pid": 2122
					},
					{
						"id": 2128,
						"name": "临桂区",
						"pid": 2122
					},
					{
						"id": 2129,
						"name": "阳朔县",
						"pid": 2122
					},
					{
						"id": 2130,
						"name": "灵川县",
						"pid": 2122
					},
					{
						"id": 2131,
						"name": "全州县",
						"pid": 2122
					},
					{
						"id": 2132,
						"name": "兴安县",
						"pid": 2122
					},
					{
						"id": 2133,
						"name": "永福县",
						"pid": 2122
					},
					{
						"id": 2134,
						"name": "灌阳县",
						"pid": 2122
					},
					{
						"id": 2135,
						"name": "龙胜各族自治县",
						"pid": 2122
					},
					{
						"id": 2136,
						"name": "资源县",
						"pid": 2122
					},
					{
						"id": 2137,
						"name": "平乐县",
						"pid": 2122
					},
					{
						"id": 2138,
						"name": "荔浦县",
						"pid": 2122
					},
					{
						"id": 2139,
						"name": "恭城瑶族自治县",
						"pid": 2122
					}
				]
			},
			{
				"id": 2140,
				"name": "梧州市",
				"pid": 20,
				"children": [{
						"id": 2141,
						"name": "万秀区",
						"pid": 2140
					},
					{
						"id": 2142,
						"name": "长洲区",
						"pid": 2140
					},
					{
						"id": 2143,
						"name": "龙圩区",
						"pid": 2140
					},
					{
						"id": 2144,
						"name": "苍梧县",
						"pid": 2140
					},
					{
						"id": 2145,
						"name": "藤县",
						"pid": 2140
					},
					{
						"id": 2146,
						"name": "蒙山县",
						"pid": 2140
					},
					{
						"id": 2147,
						"name": "岑溪市",
						"pid": 2140
					}
				]
			},
			{
				"id": 2148,
				"name": "北海市",
				"pid": 20,
				"children": [{
						"id": 2149,
						"name": "海城区",
						"pid": 2148
					},
					{
						"id": 2150,
						"name": "银海区",
						"pid": 2148
					},
					{
						"id": 2151,
						"name": "铁山港区",
						"pid": 2148
					},
					{
						"id": 2152,
						"name": "合浦县",
						"pid": 2148
					}
				]
			},
			{
				"id": 2153,
				"name": "防城港市",
				"pid": 20,
				"children": [{
						"id": 2154,
						"name": "港口区",
						"pid": 2153
					},
					{
						"id": 2155,
						"name": "防城区",
						"pid": 2153
					},
					{
						"id": 2156,
						"name": "上思县",
						"pid": 2153
					},
					{
						"id": 2157,
						"name": "东兴市",
						"pid": 2153
					}
				]
			},
			{
				"id": 2158,
				"name": "钦州市",
				"pid": 20,
				"children": [{
						"id": 2159,
						"name": "钦南区",
						"pid": 2158
					},
					{
						"id": 2160,
						"name": "钦北区",
						"pid": 2158
					},
					{
						"id": 2161,
						"name": "灵山县",
						"pid": 2158
					},
					{
						"id": 2162,
						"name": "浦北县",
						"pid": 2158
					}
				]
			},
			{
				"id": 2163,
				"name": "贵港市",
				"pid": 20,
				"children": [{
						"id": 2164,
						"name": "港北区",
						"pid": 2163
					},
					{
						"id": 2165,
						"name": "港南区",
						"pid": 2163
					},
					{
						"id": 2166,
						"name": "覃塘区",
						"pid": 2163
					},
					{
						"id": 2167,
						"name": "平南县",
						"pid": 2163
					},
					{
						"id": 2168,
						"name": "桂平市",
						"pid": 2163
					}
				]
			},
			{
				"id": 2169,
				"name": "玉林市",
				"pid": 20,
				"children": [{
						"id": 2170,
						"name": "玉州区",
						"pid": 2169
					},
					{
						"id": 2171,
						"name": "福绵区",
						"pid": 2169
					},
					{
						"id": 2172,
						"name": "容县",
						"pid": 2169
					},
					{
						"id": 2173,
						"name": "陆川县",
						"pid": 2169
					},
					{
						"id": 2174,
						"name": "博白县",
						"pid": 2169
					},
					{
						"id": 2175,
						"name": "兴业县",
						"pid": 2169
					},
					{
						"id": 2176,
						"name": "北流市",
						"pid": 2169
					}
				]
			},
			{
				"id": 2177,
				"name": "百色市",
				"pid": 20,
				"children": [{
						"id": 2178,
						"name": "右江区",
						"pid": 2177
					},
					{
						"id": 2179,
						"name": "田阳县",
						"pid": 2177
					},
					{
						"id": 2180,
						"name": "田东县",
						"pid": 2177
					},
					{
						"id": 2181,
						"name": "平果县",
						"pid": 2177
					},
					{
						"id": 2182,
						"name": "德保县",
						"pid": 2177
					},
					{
						"id": 2183,
						"name": "那坡县",
						"pid": 2177
					},
					{
						"id": 2184,
						"name": "凌云县",
						"pid": 2177
					},
					{
						"id": 2185,
						"name": "乐业县",
						"pid": 2177
					},
					{
						"id": 2186,
						"name": "田林县",
						"pid": 2177
					},
					{
						"id": 2187,
						"name": "西林县",
						"pid": 2177
					},
					{
						"id": 2188,
						"name": "隆林各族自治县",
						"pid": 2177
					},
					{
						"id": 2189,
						"name": "靖西市",
						"pid": 2177
					}
				]
			},
			{
				"id": 2190,
				"name": "贺州市",
				"pid": 20,
				"children": [{
						"id": 2191,
						"name": "八步区",
						"pid": 2190
					},
					{
						"id": 2192,
						"name": "平桂区",
						"pid": 2190
					},
					{
						"id": 2193,
						"name": "昭平县",
						"pid": 2190
					},
					{
						"id": 2194,
						"name": "钟山县",
						"pid": 2190
					},
					{
						"id": 2195,
						"name": "富川瑶族自治县",
						"pid": 2190
					}
				]
			},
			{
				"id": 2196,
				"name": "河池市",
				"pid": 20,
				"children": [{
						"id": 2197,
						"name": "金城江区",
						"pid": 2196
					},
					{
						"id": 2198,
						"name": "宜州区",
						"pid": 2196
					},
					{
						"id": 2199,
						"name": "南丹县",
						"pid": 2196
					},
					{
						"id": 2200,
						"name": "天峨县",
						"pid": 2196
					},
					{
						"id": 2201,
						"name": "凤山县",
						"pid": 2196
					},
					{
						"id": 2202,
						"name": "东兰县",
						"pid": 2196
					},
					{
						"id": 2203,
						"name": "罗城仫佬族自治县",
						"pid": 2196
					},
					{
						"id": 2204,
						"name": "环江毛南族自治县",
						"pid": 2196
					},
					{
						"id": 2205,
						"name": "巴马瑶族自治县",
						"pid": 2196
					},
					{
						"id": 2206,
						"name": "都安瑶族自治县",
						"pid": 2196
					},
					{
						"id": 2207,
						"name": "大化瑶族自治县",
						"pid": 2196
					}
				]
			},
			{
				"id": 2208,
				"name": "来宾市",
				"pid": 20,
				"children": [{
						"id": 2209,
						"name": "兴宾区",
						"pid": 2208
					},
					{
						"id": 2210,
						"name": "忻城县",
						"pid": 2208
					},
					{
						"id": 2211,
						"name": "象州县",
						"pid": 2208
					},
					{
						"id": 2212,
						"name": "武宣县",
						"pid": 2208
					},
					{
						"id": 2213,
						"name": "金秀瑶族自治县",
						"pid": 2208
					},
					{
						"id": 2214,
						"name": "合山市",
						"pid": 2208
					}
				]
			},
			{
				"id": 2215,
				"name": "崇左市",
				"pid": 20,
				"children": [{
						"id": 2216,
						"name": "江州区",
						"pid": 2215
					},
					{
						"id": 2217,
						"name": "扶绥县",
						"pid": 2215
					},
					{
						"id": 2218,
						"name": "宁明县",
						"pid": 2215
					},
					{
						"id": 2219,
						"name": "龙州县",
						"pid": 2215
					},
					{
						"id": 2220,
						"name": "大新县",
						"pid": 2215
					},
					{
						"id": 2221,
						"name": "天等县",
						"pid": 2215
					},
					{
						"id": 2222,
						"name": "凭祥市",
						"pid": 2215
					}
				]
			}
		]
	},
	{
		"id": 21,
		"name": "海南省",
		"pid": 0,
		"children": [{
				"id": 2223,
				"name": "海口市",
				"pid": 21,
				"children": [{
						"id": 2224,
						"name": "秀英区",
						"pid": 2223
					},
					{
						"id": 2225,
						"name": "龙华区",
						"pid": 2223
					},
					{
						"id": 2226,
						"name": "琼山区",
						"pid": 2223
					},
					{
						"id": 2227,
						"name": "美兰区",
						"pid": 2223
					}
				]
			},
			{
				"id": 2228,
				"name": "三亚市",
				"pid": 21,
				"children": [{
						"id": 2229,
						"name": "海棠区",
						"pid": 2228
					},
					{
						"id": 2230,
						"name": "吉阳区",
						"pid": 2228
					},
					{
						"id": 2231,
						"name": "天涯区",
						"pid": 2228
					},
					{
						"id": 2232,
						"name": "崖州区",
						"pid": 2228
					}
				]
			},
			{
				"id": 2233,
				"name": "三沙市",
				"pid": 21,
				"children": [{
					"id": 2234,
					"name": "三沙市",
					"pid": 2233
				}]
			},
			{
				"id": 2235,
				"name": "儋州市",
				"pid": 21,
				"children": [{
					"id": 2236,
					"name": "儋州市",
					"pid": 2235
				}]
			},
			{
				"id": 2237,
				"name": "五指山市",
				"pid": 21,
				"children": [{
						"id": 2238,
						"name": "五指山市",
						"pid": 2237
					},
					{
						"id": 2239,
						"name": "琼海市",
						"pid": 2237
					},
					{
						"id": 2240,
						"name": "文昌市",
						"pid": 2237
					},
					{
						"id": 2241,
						"name": "万宁市",
						"pid": 2237
					},
					{
						"id": 2242,
						"name": "东方市",
						"pid": 2237
					},
					{
						"id": 2243,
						"name": "定安县",
						"pid": 2237
					},
					{
						"id": 2244,
						"name": "屯昌县",
						"pid": 2237
					},
					{
						"id": 2245,
						"name": "澄迈县",
						"pid": 2237
					},
					{
						"id": 2246,
						"name": "临高县",
						"pid": 2237
					},
					{
						"id": 2247,
						"name": "白沙黎族自治县",
						"pid": 2237
					},
					{
						"id": 2248,
						"name": "昌江黎族自治县",
						"pid": 2237
					},
					{
						"id": 2249,
						"name": "乐东黎族自治县",
						"pid": 2237
					},
					{
						"id": 2250,
						"name": "陵水黎族自治县",
						"pid": 2237
					},
					{
						"id": 2251,
						"name": "保亭黎族苗族自治县",
						"pid": 2237
					},
					{
						"id": 2252,
						"name": "琼中黎族苗族自治县",
						"pid": 2237
					}
				]
			}
		]
	},
	{
		"id": 22,
		"name": "重庆市",
		"pid": 0,
		"children": [{
				"id": 2253,
				"name": "区级",
				"pid": 22,
				"children": [{
						"id": 2254,
						"name": "万州区",
						"pid": 2253
					},
					{
						"id": 2255,
						"name": "涪陵区",
						"pid": 2253
					},
					{
						"id": 2256,
						"name": "渝中区",
						"pid": 2253
					},
					{
						"id": 2257,
						"name": "大渡口区",
						"pid": 2253
					},
					{
						"id": 2258,
						"name": "江北区",
						"pid": 2253
					},
					{
						"id": 2259,
						"name": "沙坪坝区",
						"pid": 2253
					},
					{
						"id": 2260,
						"name": "九龙坡区",
						"pid": 2253
					},
					{
						"id": 2261,
						"name": "南岸区",
						"pid": 2253
					},
					{
						"id": 2262,
						"name": "北碚区",
						"pid": 2253
					},
					{
						"id": 2263,
						"name": "綦江区",
						"pid": 2253
					},
					{
						"id": 2264,
						"name": "大足区",
						"pid": 2253
					},
					{
						"id": 2265,
						"name": "渝北区",
						"pid": 2253
					},
					{
						"id": 2266,
						"name": "巴南区",
						"pid": 2253
					},
					{
						"id": 2267,
						"name": "黔江区",
						"pid": 2253
					},
					{
						"id": 2268,
						"name": "长寿区",
						"pid": 2253
					},
					{
						"id": 2269,
						"name": "江津区",
						"pid": 2253
					},
					{
						"id": 2270,
						"name": "合川区",
						"pid": 2253
					},
					{
						"id": 2271,
						"name": "永川区",
						"pid": 2253
					},
					{
						"id": 2272,
						"name": "南川区",
						"pid": 2253
					},
					{
						"id": 2273,
						"name": "璧山区",
						"pid": 2253
					},
					{
						"id": 2274,
						"name": "铜梁区",
						"pid": 2253
					},
					{
						"id": 2275,
						"name": "潼南区",
						"pid": 2253
					},
					{
						"id": 2276,
						"name": "荣昌区",
						"pid": 2253
					},
					{
						"id": 2277,
						"name": "开州区",
						"pid": 2253
					},
					{
						"id": 2278,
						"name": "梁平区",
						"pid": 2253
					},
					{
						"id": 2279,
						"name": "武隆区",
						"pid": 2253
					}
				]
			},
			{
				"id": 2280,
				"name": "县级",
				"pid": 22,
				"children": [{
						"id": 2281,
						"name": "城口县",
						"pid": 2280
					},
					{
						"id": 2282,
						"name": "丰都县",
						"pid": 2280
					},
					{
						"id": 2283,
						"name": "垫江县",
						"pid": 2280
					},
					{
						"id": 2284,
						"name": "忠县",
						"pid": 2280
					},
					{
						"id": 2285,
						"name": "云阳县",
						"pid": 2280
					},
					{
						"id": 2286,
						"name": "奉节县",
						"pid": 2280
					},
					{
						"id": 2287,
						"name": "巫山县",
						"pid": 2280
					},
					{
						"id": 2288,
						"name": "巫溪县",
						"pid": 2280
					},
					{
						"id": 2289,
						"name": "石柱土家族自治县",
						"pid": 2280
					},
					{
						"id": 2290,
						"name": "秀山土家族苗族自治县",
						"pid": 2280
					},
					{
						"id": 2291,
						"name": "酉阳土家族苗族自治县",
						"pid": 2280
					},
					{
						"id": 2292,
						"name": "彭水苗族土家族自治县",
						"pid": 2280
					}
				]
			}
		]
	},
	{
		"id": 23,
		"name": "四川省",
		"pid": 0,
		"children": [{
				"id": 2293,
				"name": "成都市",
				"pid": 23,
				"children": [{
						"id": 2294,
						"name": "锦江区",
						"pid": 2293
					},
					{
						"id": 2295,
						"name": "青羊区",
						"pid": 2293
					},
					{
						"id": 2296,
						"name": "金牛区",
						"pid": 2293
					},
					{
						"id": 2297,
						"name": "武侯区",
						"pid": 2293
					},
					{
						"id": 2298,
						"name": "成华区",
						"pid": 2293
					},
					{
						"id": 2299,
						"name": "龙泉驿区",
						"pid": 2293
					},
					{
						"id": 2300,
						"name": "青白江区",
						"pid": 2293
					},
					{
						"id": 2301,
						"name": "新都区",
						"pid": 2293
					},
					{
						"id": 2302,
						"name": "温江区",
						"pid": 2293
					},
					{
						"id": 2303,
						"name": "双流区",
						"pid": 2293
					},
					{
						"id": 2304,
						"name": "郫都区",
						"pid": 2293
					},
					{
						"id": 2305,
						"name": "金堂县",
						"pid": 2293
					},
					{
						"id": 2306,
						"name": "大邑县",
						"pid": 2293
					},
					{
						"id": 2307,
						"name": "蒲江县",
						"pid": 2293
					},
					{
						"id": 2308,
						"name": "新津县",
						"pid": 2293
					},
					{
						"id": 2309,
						"name": "都江堰市",
						"pid": 2293
					},
					{
						"id": 2310,
						"name": "彭州市",
						"pid": 2293
					},
					{
						"id": 2311,
						"name": "邛崃市",
						"pid": 2293
					},
					{
						"id": 2312,
						"name": "崇州市",
						"pid": 2293
					},
					{
						"id": 2313,
						"name": "简阳市",
						"pid": 2293
					}
				]
			},
			{
				"id": 2314,
				"name": "自贡市",
				"pid": 23,
				"children": [{
						"id": 2315,
						"name": "自流井区",
						"pid": 2314
					},
					{
						"id": 2316,
						"name": "贡井区",
						"pid": 2314
					},
					{
						"id": 2317,
						"name": "大安区",
						"pid": 2314
					},
					{
						"id": 2318,
						"name": "沿滩区",
						"pid": 2314
					},
					{
						"id": 2319,
						"name": "荣县",
						"pid": 2314
					},
					{
						"id": 2320,
						"name": "富顺县",
						"pid": 2314
					}
				]
			},
			{
				"id": 2321,
				"name": "攀枝花市",
				"pid": 23,
				"children": [{
						"id": 2322,
						"name": "东区",
						"pid": 2321
					},
					{
						"id": 2323,
						"name": "西区",
						"pid": 2321
					},
					{
						"id": 2324,
						"name": "仁和区",
						"pid": 2321
					},
					{
						"id": 2325,
						"name": "米易县",
						"pid": 2321
					},
					{
						"id": 2326,
						"name": "盐边县",
						"pid": 2321
					}
				]
			},
			{
				"id": 2327,
				"name": "泸州市",
				"pid": 23,
				"children": [{
						"id": 2328,
						"name": "江阳区",
						"pid": 2327
					},
					{
						"id": 2329,
						"name": "纳溪区",
						"pid": 2327
					},
					{
						"id": 2330,
						"name": "龙马潭区",
						"pid": 2327
					},
					{
						"id": 2331,
						"name": "泸县",
						"pid": 2327
					},
					{
						"id": 2332,
						"name": "合江县",
						"pid": 2327
					},
					{
						"id": 2333,
						"name": "叙永县",
						"pid": 2327
					},
					{
						"id": 2334,
						"name": "古蔺县",
						"pid": 2327
					}
				]
			},
			{
				"id": 2335,
				"name": "德阳市",
				"pid": 23,
				"children": [{
						"id": 2336,
						"name": "旌阳区",
						"pid": 2335
					},
					{
						"id": 2337,
						"name": "罗江区",
						"pid": 2335
					},
					{
						"id": 2338,
						"name": "中江县",
						"pid": 2335
					},
					{
						"id": 2339,
						"name": "广汉市",
						"pid": 2335
					},
					{
						"id": 2340,
						"name": "什邡市",
						"pid": 2335
					},
					{
						"id": 2341,
						"name": "绵竹市",
						"pid": 2335
					}
				]
			},
			{
				"id": 2342,
				"name": "绵阳市",
				"pid": 23,
				"children": [{
						"id": 2343,
						"name": "涪城区",
						"pid": 2342
					},
					{
						"id": 2344,
						"name": "游仙区",
						"pid": 2342
					},
					{
						"id": 2345,
						"name": "安州区",
						"pid": 2342
					},
					{
						"id": 2346,
						"name": "三台县",
						"pid": 2342
					},
					{
						"id": 2347,
						"name": "盐亭县",
						"pid": 2342
					},
					{
						"id": 2348,
						"name": "梓潼县",
						"pid": 2342
					},
					{
						"id": 2349,
						"name": "北川羌族自治县",
						"pid": 2342
					},
					{
						"id": 2350,
						"name": "平武县",
						"pid": 2342
					},
					{
						"id": 2351,
						"name": "江油市",
						"pid": 2342
					}
				]
			},
			{
				"id": 2352,
				"name": "广元市",
				"pid": 23,
				"children": [{
						"id": 2353,
						"name": "利州区",
						"pid": 2352
					},
					{
						"id": 2354,
						"name": "昭化区",
						"pid": 2352
					},
					{
						"id": 2355,
						"name": "朝天区",
						"pid": 2352
					},
					{
						"id": 2356,
						"name": "旺苍县",
						"pid": 2352
					},
					{
						"id": 2357,
						"name": "青川县",
						"pid": 2352
					},
					{
						"id": 2358,
						"name": "剑阁县",
						"pid": 2352
					},
					{
						"id": 2359,
						"name": "苍溪县",
						"pid": 2352
					}
				]
			},
			{
				"id": 2360,
				"name": "遂宁市",
				"pid": 23,
				"children": [{
						"id": 2361,
						"name": "船山区",
						"pid": 2360
					},
					{
						"id": 2362,
						"name": "安居区",
						"pid": 2360
					},
					{
						"id": 2363,
						"name": "蓬溪县",
						"pid": 2360
					},
					{
						"id": 2364,
						"name": "射洪县",
						"pid": 2360
					},
					{
						"id": 2365,
						"name": "大英县",
						"pid": 2360
					}
				]
			},
			{
				"id": 2366,
				"name": "内江市",
				"pid": 23,
				"children": [{
						"id": 2367,
						"name": "市中区",
						"pid": 2366
					},
					{
						"id": 2368,
						"name": "东兴区",
						"pid": 2366
					},
					{
						"id": 2369,
						"name": "威远县",
						"pid": 2366
					},
					{
						"id": 2370,
						"name": "资中县",
						"pid": 2366
					},
					{
						"id": 2371,
						"name": "隆昌市",
						"pid": 2366
					}
				]
			},
			{
				"id": 2372,
				"name": "乐山市",
				"pid": 23,
				"children": [{
						"id": 2373,
						"name": "市中区",
						"pid": 2372
					},
					{
						"id": 2374,
						"name": "沙湾区",
						"pid": 2372
					},
					{
						"id": 2375,
						"name": "五通桥区",
						"pid": 2372
					},
					{
						"id": 2376,
						"name": "金口河区",
						"pid": 2372
					},
					{
						"id": 2377,
						"name": "犍为县",
						"pid": 2372
					},
					{
						"id": 2378,
						"name": "井研县",
						"pid": 2372
					},
					{
						"id": 2379,
						"name": "夹江县",
						"pid": 2372
					},
					{
						"id": 2380,
						"name": "沐川县",
						"pid": 2372
					},
					{
						"id": 2381,
						"name": "峨边彝族自治县",
						"pid": 2372
					},
					{
						"id": 2382,
						"name": "马边彝族自治县",
						"pid": 2372
					},
					{
						"id": 2383,
						"name": "峨眉山市",
						"pid": 2372
					}
				]
			},
			{
				"id": 2384,
				"name": "南充市",
				"pid": 23,
				"children": [{
						"id": 2385,
						"name": "顺庆区",
						"pid": 2384
					},
					{
						"id": 2386,
						"name": "高坪区",
						"pid": 2384
					},
					{
						"id": 2387,
						"name": "嘉陵区",
						"pid": 2384
					},
					{
						"id": 2388,
						"name": "南部县",
						"pid": 2384
					},
					{
						"id": 2389,
						"name": "营山县",
						"pid": 2384
					},
					{
						"id": 2390,
						"name": "蓬安县",
						"pid": 2384
					},
					{
						"id": 2391,
						"name": "仪陇县",
						"pid": 2384
					},
					{
						"id": 2392,
						"name": "西充县",
						"pid": 2384
					},
					{
						"id": 2393,
						"name": "阆中市",
						"pid": 2384
					}
				]
			},
			{
				"id": 2394,
				"name": "眉山市",
				"pid": 23,
				"children": [{
						"id": 2395,
						"name": "东坡区",
						"pid": 2394
					},
					{
						"id": 2396,
						"name": "彭山区",
						"pid": 2394
					},
					{
						"id": 2397,
						"name": "仁寿县",
						"pid": 2394
					},
					{
						"id": 2398,
						"name": "洪雅县",
						"pid": 2394
					},
					{
						"id": 2399,
						"name": "丹棱县",
						"pid": 2394
					},
					{
						"id": 2400,
						"name": "青神县",
						"pid": 2394
					}
				]
			},
			{
				"id": 2401,
				"name": "宜宾市",
				"pid": 23,
				"children": [{
						"id": 2402,
						"name": "翠屏区",
						"pid": 2401
					},
					{
						"id": 2403,
						"name": "南溪区",
						"pid": 2401
					},
					{
						"id": 2404,
						"name": "宜宾县",
						"pid": 2401
					},
					{
						"id": 2405,
						"name": "江安县",
						"pid": 2401
					},
					{
						"id": 2406,
						"name": "长宁县",
						"pid": 2401
					},
					{
						"id": 2407,
						"name": "高县",
						"pid": 2401
					},
					{
						"id": 2408,
						"name": "珙县",
						"pid": 2401
					},
					{
						"id": 2409,
						"name": "筠连县",
						"pid": 2401
					},
					{
						"id": 2410,
						"name": "兴文县",
						"pid": 2401
					},
					{
						"id": 2411,
						"name": "屏山县",
						"pid": 2401
					}
				]
			},
			{
				"id": 2412,
				"name": "广安市",
				"pid": 23,
				"children": [{
						"id": 2413,
						"name": "广安区",
						"pid": 2412
					},
					{
						"id": 2414,
						"name": "前锋区",
						"pid": 2412
					},
					{
						"id": 2415,
						"name": "岳池县",
						"pid": 2412
					},
					{
						"id": 2416,
						"name": "武胜县",
						"pid": 2412
					},
					{
						"id": 2417,
						"name": "邻水县",
						"pid": 2412
					},
					{
						"id": 2418,
						"name": "华蓥市",
						"pid": 2412
					}
				]
			},
			{
				"id": 2419,
				"name": "达州市",
				"pid": 23,
				"children": [{
						"id": 2420,
						"name": "通川区",
						"pid": 2419
					},
					{
						"id": 2421,
						"name": "达川区",
						"pid": 2419
					},
					{
						"id": 2422,
						"name": "宣汉县",
						"pid": 2419
					},
					{
						"id": 2423,
						"name": "开江县",
						"pid": 2419
					},
					{
						"id": 2424,
						"name": "大竹县",
						"pid": 2419
					},
					{
						"id": 2425,
						"name": "渠县",
						"pid": 2419
					},
					{
						"id": 2426,
						"name": "万源市",
						"pid": 2419
					}
				]
			},
			{
				"id": 2427,
				"name": "雅安市",
				"pid": 23,
				"children": [{
						"id": 2428,
						"name": "雨城区",
						"pid": 2427
					},
					{
						"id": 2429,
						"name": "名山区",
						"pid": 2427
					},
					{
						"id": 2430,
						"name": "荥经县",
						"pid": 2427
					},
					{
						"id": 2431,
						"name": "汉源县",
						"pid": 2427
					},
					{
						"id": 2432,
						"name": "石棉县",
						"pid": 2427
					},
					{
						"id": 2433,
						"name": "天全县",
						"pid": 2427
					},
					{
						"id": 2434,
						"name": "芦山县",
						"pid": 2427
					},
					{
						"id": 2435,
						"name": "宝兴县",
						"pid": 2427
					}
				]
			},
			{
				"id": 2436,
				"name": "巴中市",
				"pid": 23,
				"children": [{
						"id": 2437,
						"name": "巴州区",
						"pid": 2436
					},
					{
						"id": 2438,
						"name": "恩阳区",
						"pid": 2436
					},
					{
						"id": 2439,
						"name": "通江县",
						"pid": 2436
					},
					{
						"id": 2440,
						"name": "南江县",
						"pid": 2436
					},
					{
						"id": 2441,
						"name": "平昌县",
						"pid": 2436
					}
				]
			},
			{
				"id": 2442,
				"name": "资阳市",
				"pid": 23,
				"children": [{
						"id": 2443,
						"name": "雁江区",
						"pid": 2442
					},
					{
						"id": 2444,
						"name": "安岳县",
						"pid": 2442
					},
					{
						"id": 2445,
						"name": "乐至县",
						"pid": 2442
					}
				]
			},
			{
				"id": 2446,
				"name": "阿坝藏族羌族自治州",
				"pid": 23,
				"children": [{
						"id": 2447,
						"name": "马尔康市",
						"pid": 2446
					},
					{
						"id": 2448,
						"name": "汶川县",
						"pid": 2446
					},
					{
						"id": 2449,
						"name": "理县",
						"pid": 2446
					},
					{
						"id": 2450,
						"name": "茂县",
						"pid": 2446
					},
					{
						"id": 2451,
						"name": "松潘县",
						"pid": 2446
					},
					{
						"id": 2452,
						"name": "九寨沟县",
						"pid": 2446
					},
					{
						"id": 2453,
						"name": "金川县",
						"pid": 2446
					},
					{
						"id": 2454,
						"name": "小金县",
						"pid": 2446
					},
					{
						"id": 2455,
						"name": "黑水县",
						"pid": 2446
					},
					{
						"id": 2456,
						"name": "壤塘县",
						"pid": 2446
					},
					{
						"id": 2457,
						"name": "阿坝县",
						"pid": 2446
					},
					{
						"id": 2458,
						"name": "若尔盖县",
						"pid": 2446
					},
					{
						"id": 2459,
						"name": "红原县",
						"pid": 2446
					}
				]
			},
			{
				"id": 2460,
				"name": "甘孜藏族自治州",
				"pid": 23,
				"children": [{
						"id": 2461,
						"name": "康定市",
						"pid": 2460
					},
					{
						"id": 2462,
						"name": "泸定县",
						"pid": 2460
					},
					{
						"id": 2463,
						"name": "丹巴县",
						"pid": 2460
					},
					{
						"id": 2464,
						"name": "九龙县",
						"pid": 2460
					},
					{
						"id": 2465,
						"name": "雅江县",
						"pid": 2460
					},
					{
						"id": 2466,
						"name": "道孚县",
						"pid": 2460
					},
					{
						"id": 2467,
						"name": "炉霍县",
						"pid": 2460
					},
					{
						"id": 2468,
						"name": "甘孜县",
						"pid": 2460
					},
					{
						"id": 2469,
						"name": "新龙县",
						"pid": 2460
					},
					{
						"id": 2470,
						"name": "德格县",
						"pid": 2460
					},
					{
						"id": 2471,
						"name": "白玉县",
						"pid": 2460
					},
					{
						"id": 2472,
						"name": "石渠县",
						"pid": 2460
					},
					{
						"id": 2473,
						"name": "色达县",
						"pid": 2460
					},
					{
						"id": 2474,
						"name": "理塘县",
						"pid": 2460
					},
					{
						"id": 2475,
						"name": "巴塘县",
						"pid": 2460
					},
					{
						"id": 2476,
						"name": "乡城县",
						"pid": 2460
					},
					{
						"id": 2477,
						"name": "稻城县",
						"pid": 2460
					},
					{
						"id": 2478,
						"name": "得荣县",
						"pid": 2460
					}
				]
			},
			{
				"id": 2479,
				"name": "凉山彝族自治州",
				"pid": 23,
				"children": [{
						"id": 2480,
						"name": "西昌市",
						"pid": 2479
					},
					{
						"id": 2481,
						"name": "木里藏族自治县",
						"pid": 2479
					},
					{
						"id": 2482,
						"name": "盐源县",
						"pid": 2479
					},
					{
						"id": 2483,
						"name": "德昌县",
						"pid": 2479
					},
					{
						"id": 2484,
						"name": "会理县",
						"pid": 2479
					},
					{
						"id": 2485,
						"name": "会东县",
						"pid": 2479
					},
					{
						"id": 2486,
						"name": "宁南县",
						"pid": 2479
					},
					{
						"id": 2487,
						"name": "普格县",
						"pid": 2479
					},
					{
						"id": 2488,
						"name": "布拖县",
						"pid": 2479
					},
					{
						"id": 2489,
						"name": "金阳县",
						"pid": 2479
					},
					{
						"id": 2490,
						"name": "昭觉县",
						"pid": 2479
					},
					{
						"id": 2491,
						"name": "喜德县",
						"pid": 2479
					},
					{
						"id": 2492,
						"name": "冕宁县",
						"pid": 2479
					},
					{
						"id": 2493,
						"name": "越西县",
						"pid": 2479
					},
					{
						"id": 2494,
						"name": "甘洛县",
						"pid": 2479
					},
					{
						"id": 2495,
						"name": "美姑县",
						"pid": 2479
					},
					{
						"id": 2496,
						"name": "雷波县",
						"pid": 2479
					}
				]
			}
		]
	},
	{
		"id": 24,
		"name": "贵州省",
		"pid": 0,
		"children": [{
				"id": 2497,
				"name": "贵阳市",
				"pid": 24,
				"children": [{
						"id": 2498,
						"name": "南明区",
						"pid": 2497
					},
					{
						"id": 2499,
						"name": "云岩区",
						"pid": 2497
					},
					{
						"id": 2500,
						"name": "花溪区",
						"pid": 2497
					},
					{
						"id": 2501,
						"name": "乌当区",
						"pid": 2497
					},
					{
						"id": 2502,
						"name": "白云区",
						"pid": 2497
					},
					{
						"id": 2503,
						"name": "观山湖区",
						"pid": 2497
					},
					{
						"id": 2504,
						"name": "开阳县",
						"pid": 2497
					},
					{
						"id": 2505,
						"name": "息烽县",
						"pid": 2497
					},
					{
						"id": 2506,
						"name": "修文县",
						"pid": 2497
					},
					{
						"id": 2507,
						"name": "清镇市",
						"pid": 2497
					}
				]
			},
			{
				"id": 2508,
				"name": "六盘水市",
				"pid": 24,
				"children": [{
						"id": 2509,
						"name": "钟山区",
						"pid": 2508
					},
					{
						"id": 2510,
						"name": "六枝特区",
						"pid": 2508
					},
					{
						"id": 2511,
						"name": "水城县",
						"pid": 2508
					},
					{
						"id": 2512,
						"name": "盘州市",
						"pid": 2508
					}
				]
			},
			{
				"id": 2513,
				"name": "遵义市",
				"pid": 24,
				"children": [{
						"id": 2514,
						"name": "红花岗区",
						"pid": 2513
					},
					{
						"id": 2515,
						"name": "汇川区",
						"pid": 2513
					},
					{
						"id": 2516,
						"name": "播州区",
						"pid": 2513
					},
					{
						"id": 2517,
						"name": "桐梓县",
						"pid": 2513
					},
					{
						"id": 2518,
						"name": "绥阳县",
						"pid": 2513
					},
					{
						"id": 2519,
						"name": "正安县",
						"pid": 2513
					},
					{
						"id": 2520,
						"name": "道真仡佬族苗族自治县",
						"pid": 2513
					},
					{
						"id": 2521,
						"name": "务川仡佬族苗族自治县",
						"pid": 2513
					},
					{
						"id": 2522,
						"name": "凤冈县",
						"pid": 2513
					},
					{
						"id": 2523,
						"name": "湄潭县",
						"pid": 2513
					},
					{
						"id": 2524,
						"name": "余庆县",
						"pid": 2513
					},
					{
						"id": 2525,
						"name": "习水县",
						"pid": 2513
					},
					{
						"id": 2526,
						"name": "赤水市",
						"pid": 2513
					},
					{
						"id": 2527,
						"name": "仁怀市",
						"pid": 2513
					}
				]
			},
			{
				"id": 2528,
				"name": "安顺市",
				"pid": 24,
				"children": [{
						"id": 2529,
						"name": "西秀区",
						"pid": 2528
					},
					{
						"id": 2530,
						"name": "平坝区",
						"pid": 2528
					},
					{
						"id": 2531,
						"name": "普定县",
						"pid": 2528
					},
					{
						"id": 2532,
						"name": "镇宁布依族苗族自治县",
						"pid": 2528
					},
					{
						"id": 2533,
						"name": "关岭布依族苗族自治县",
						"pid": 2528
					},
					{
						"id": 2534,
						"name": "紫云苗族布依族自治县",
						"pid": 2528
					}
				]
			},
			{
				"id": 2535,
				"name": "毕节市",
				"pid": 24,
				"children": [{
						"id": 2536,
						"name": "七星关区",
						"pid": 2535
					},
					{
						"id": 2537,
						"name": "大方县",
						"pid": 2535
					},
					{
						"id": 2538,
						"name": "黔西县",
						"pid": 2535
					},
					{
						"id": 2539,
						"name": "金沙县",
						"pid": 2535
					},
					{
						"id": 2540,
						"name": "织金县",
						"pid": 2535
					},
					{
						"id": 2541,
						"name": "纳雍县",
						"pid": 2535
					},
					{
						"id": 2542,
						"name": "威宁彝族回族苗族自治县",
						"pid": 2535
					},
					{
						"id": 2543,
						"name": "赫章县",
						"pid": 2535
					}
				]
			},
			{
				"id": 2544,
				"name": "铜仁市",
				"pid": 24,
				"children": [{
						"id": 2545,
						"name": "碧江区",
						"pid": 2544
					},
					{
						"id": 2546,
						"name": "万山区",
						"pid": 2544
					},
					{
						"id": 2547,
						"name": "江口县",
						"pid": 2544
					},
					{
						"id": 2548,
						"name": "玉屏侗族自治县",
						"pid": 2544
					},
					{
						"id": 2549,
						"name": "石阡县",
						"pid": 2544
					},
					{
						"id": 2550,
						"name": "思南县",
						"pid": 2544
					},
					{
						"id": 2551,
						"name": "印江土家族苗族自治县",
						"pid": 2544
					},
					{
						"id": 2552,
						"name": "德江县",
						"pid": 2544
					},
					{
						"id": 2553,
						"name": "沿河土家族自治县",
						"pid": 2544
					},
					{
						"id": 2554,
						"name": "松桃苗族自治县",
						"pid": 2544
					}
				]
			},
			{
				"id": 2555,
				"name": "黔西南布依族苗族自治州",
				"pid": 24,
				"children": [{
						"id": 2556,
						"name": "兴义市",
						"pid": 2555
					},
					{
						"id": 2557,
						"name": "兴仁县",
						"pid": 2555
					},
					{
						"id": 2558,
						"name": "普安县",
						"pid": 2555
					},
					{
						"id": 2559,
						"name": "晴隆县",
						"pid": 2555
					},
					{
						"id": 2560,
						"name": "贞丰县",
						"pid": 2555
					},
					{
						"id": 2561,
						"name": "望谟县",
						"pid": 2555
					},
					{
						"id": 2562,
						"name": "册亨县",
						"pid": 2555
					},
					{
						"id": 2563,
						"name": "安龙县",
						"pid": 2555
					}
				]
			},
			{
				"id": 2564,
				"name": "黔东南苗族侗族自治州",
				"pid": 24,
				"children": [{
						"id": 2565,
						"name": "凯里市",
						"pid": 2564
					},
					{
						"id": 2566,
						"name": "黄平县",
						"pid": 2564
					},
					{
						"id": 2567,
						"name": "施秉县",
						"pid": 2564
					},
					{
						"id": 2568,
						"name": "三穗县",
						"pid": 2564
					},
					{
						"id": 2569,
						"name": "镇远县",
						"pid": 2564
					},
					{
						"id": 2570,
						"name": "岑巩县",
						"pid": 2564
					},
					{
						"id": 2571,
						"name": "天柱县",
						"pid": 2564
					},
					{
						"id": 2572,
						"name": "锦屏县",
						"pid": 2564
					},
					{
						"id": 2573,
						"name": "剑河县",
						"pid": 2564
					},
					{
						"id": 2574,
						"name": "台江县",
						"pid": 2564
					},
					{
						"id": 2575,
						"name": "黎平县",
						"pid": 2564
					},
					{
						"id": 2576,
						"name": "榕江县",
						"pid": 2564
					},
					{
						"id": 2577,
						"name": "从江县",
						"pid": 2564
					},
					{
						"id": 2578,
						"name": "雷山县",
						"pid": 2564
					},
					{
						"id": 2579,
						"name": "麻江县",
						"pid": 2564
					},
					{
						"id": 2580,
						"name": "丹寨县",
						"pid": 2564
					}
				]
			},
			{
				"id": 2581,
				"name": "黔南布依族苗族自治州",
				"pid": 24,
				"children": [{
						"id": 2582,
						"name": "都匀市",
						"pid": 2581
					},
					{
						"id": 2583,
						"name": "福泉市",
						"pid": 2581
					},
					{
						"id": 2584,
						"name": "荔波县",
						"pid": 2581
					},
					{
						"id": 2585,
						"name": "贵定县",
						"pid": 2581
					},
					{
						"id": 2586,
						"name": "瓮安县",
						"pid": 2581
					},
					{
						"id": 2587,
						"name": "独山县",
						"pid": 2581
					},
					{
						"id": 2588,
						"name": "平塘县",
						"pid": 2581
					},
					{
						"id": 2589,
						"name": "罗甸县",
						"pid": 2581
					},
					{
						"id": 2590,
						"name": "长顺县",
						"pid": 2581
					},
					{
						"id": 2591,
						"name": "龙里县",
						"pid": 2581
					},
					{
						"id": 2592,
						"name": "惠水县",
						"pid": 2581
					},
					{
						"id": 2593,
						"name": "三都水族自治县",
						"pid": 2581
					}
				]
			}
		]
	},
	{
		"id": 25,
		"name": "云南省",
		"pid": 0,
		"children": [{
				"id": 2594,
				"name": "昆明市",
				"pid": 25,
				"children": [{
						"id": 2595,
						"name": "五华区",
						"pid": 2594
					},
					{
						"id": 2596,
						"name": "盘龙区",
						"pid": 2594
					},
					{
						"id": 2597,
						"name": "官渡区",
						"pid": 2594
					},
					{
						"id": 2598,
						"name": "西山区",
						"pid": 2594
					},
					{
						"id": 2599,
						"name": "东川区",
						"pid": 2594
					},
					{
						"id": 2600,
						"name": "呈贡区",
						"pid": 2594
					},
					{
						"id": 2601,
						"name": "晋宁区",
						"pid": 2594
					},
					{
						"id": 2602,
						"name": "富民县",
						"pid": 2594
					},
					{
						"id": 2603,
						"name": "宜良县",
						"pid": 2594
					},
					{
						"id": 2604,
						"name": "石林彝族自治县",
						"pid": 2594
					},
					{
						"id": 2605,
						"name": "嵩明县",
						"pid": 2594
					},
					{
						"id": 2606,
						"name": "禄劝彝族苗族自治县",
						"pid": 2594
					},
					{
						"id": 2607,
						"name": "寻甸回族彝族自治县",
						"pid": 2594
					},
					{
						"id": 2608,
						"name": "安宁市",
						"pid": 2594
					}
				]
			},
			{
				"id": 2609,
				"name": "曲靖市",
				"pid": 25,
				"children": [{
						"id": 2610,
						"name": "麒麟区",
						"pid": 2609
					},
					{
						"id": 2611,
						"name": "沾益区",
						"pid": 2609
					},
					{
						"id": 2612,
						"name": "马龙县",
						"pid": 2609
					},
					{
						"id": 2613,
						"name": "陆良县",
						"pid": 2609
					},
					{
						"id": 2614,
						"name": "师宗县",
						"pid": 2609
					},
					{
						"id": 2615,
						"name": "罗平县",
						"pid": 2609
					},
					{
						"id": 2616,
						"name": "富源县",
						"pid": 2609
					},
					{
						"id": 2617,
						"name": "会泽县",
						"pid": 2609
					},
					{
						"id": 2618,
						"name": "宣威市",
						"pid": 2609
					}
				]
			},
			{
				"id": 2619,
				"name": "玉溪市",
				"pid": 25,
				"children": [{
						"id": 2620,
						"name": "红塔区",
						"pid": 2619
					},
					{
						"id": 2621,
						"name": "江川区",
						"pid": 2619
					},
					{
						"id": 2622,
						"name": "澄江县",
						"pid": 2619
					},
					{
						"id": 2623,
						"name": "通海县",
						"pid": 2619
					},
					{
						"id": 2624,
						"name": "华宁县",
						"pid": 2619
					},
					{
						"id": 2625,
						"name": "易门县",
						"pid": 2619
					},
					{
						"id": 2626,
						"name": "峨山彝族自治县",
						"pid": 2619
					},
					{
						"id": 2627,
						"name": "新平彝族傣族自治县",
						"pid": 2619
					},
					{
						"id": 2628,
						"name": "元江哈尼族彝族傣族自治县",
						"pid": 2619
					}
				]
			},
			{
				"id": 2629,
				"name": "保山市",
				"pid": 25,
				"children": [{
						"id": 2630,
						"name": "隆阳区",
						"pid": 2629
					},
					{
						"id": 2631,
						"name": "施甸县",
						"pid": 2629
					},
					{
						"id": 2632,
						"name": "龙陵县",
						"pid": 2629
					},
					{
						"id": 2633,
						"name": "昌宁县",
						"pid": 2629
					},
					{
						"id": 2634,
						"name": "腾冲市",
						"pid": 2629
					}
				]
			},
			{
				"id": 2635,
				"name": "昭通市",
				"pid": 25,
				"children": [{
						"id": 2636,
						"name": "昭阳区",
						"pid": 2635
					},
					{
						"id": 2637,
						"name": "鲁甸县",
						"pid": 2635
					},
					{
						"id": 2638,
						"name": "巧家县",
						"pid": 2635
					},
					{
						"id": 2639,
						"name": "盐津县",
						"pid": 2635
					},
					{
						"id": 2640,
						"name": "大关县",
						"pid": 2635
					},
					{
						"id": 2641,
						"name": "永善县",
						"pid": 2635
					},
					{
						"id": 2642,
						"name": "绥江县",
						"pid": 2635
					},
					{
						"id": 2643,
						"name": "镇雄县",
						"pid": 2635
					},
					{
						"id": 2644,
						"name": "彝良县",
						"pid": 2635
					},
					{
						"id": 2645,
						"name": "威信县",
						"pid": 2635
					},
					{
						"id": 2646,
						"name": "水富县",
						"pid": 2635
					}
				]
			},
			{
				"id": 2647,
				"name": "丽江市",
				"pid": 25,
				"children": [{
						"id": 2648,
						"name": "古城区",
						"pid": 2647
					},
					{
						"id": 2649,
						"name": "玉龙纳西族自治县",
						"pid": 2647
					},
					{
						"id": 2650,
						"name": "永胜县",
						"pid": 2647
					},
					{
						"id": 2651,
						"name": "华坪县",
						"pid": 2647
					},
					{
						"id": 2652,
						"name": "宁蒗彝族自治县",
						"pid": 2647
					}
				]
			},
			{
				"id": 2653,
				"name": "普洱市",
				"pid": 25,
				"children": [{
						"id": 2654,
						"name": "思茅区",
						"pid": 2653
					},
					{
						"id": 2655,
						"name": "宁洱哈尼族彝族自治县",
						"pid": 2653
					},
					{
						"id": 2656,
						"name": "墨江哈尼族自治县",
						"pid": 2653
					},
					{
						"id": 2657,
						"name": "景东彝族自治县",
						"pid": 2653
					},
					{
						"id": 2658,
						"name": "景谷傣族彝族自治县",
						"pid": 2653
					},
					{
						"id": 2659,
						"name": "镇沅彝族哈尼族拉祜族自治县",
						"pid": 2653
					},
					{
						"id": 2660,
						"name": "江城哈尼族彝族自治县",
						"pid": 2653
					},
					{
						"id": 2661,
						"name": "孟连傣族拉祜族佤族自治县",
						"pid": 2653
					},
					{
						"id": 2662,
						"name": "澜沧拉祜族自治县",
						"pid": 2653
					},
					{
						"id": 2663,
						"name": "西盟佤族自治县",
						"pid": 2653
					}
				]
			},
			{
				"id": 2664,
				"name": "临沧市",
				"pid": 25,
				"children": [{
						"id": 2665,
						"name": "临翔区",
						"pid": 2664
					},
					{
						"id": 2666,
						"name": "凤庆县",
						"pid": 2664
					},
					{
						"id": 2667,
						"name": "云县",
						"pid": 2664
					},
					{
						"id": 2668,
						"name": "永德县",
						"pid": 2664
					},
					{
						"id": 2669,
						"name": "镇康县",
						"pid": 2664
					},
					{
						"id": 2670,
						"name": "双江拉祜族佤族布朗族傣族自治县",
						"pid": 2664
					},
					{
						"id": 2671,
						"name": "耿马傣族佤族自治县",
						"pid": 2664
					},
					{
						"id": 2672,
						"name": "沧源佤族自治县",
						"pid": 2664
					}
				]
			},
			{
				"id": 2673,
				"name": "楚雄彝族自治州",
				"pid": 25,
				"children": [{
						"id": 2674,
						"name": "楚雄市",
						"pid": 2673
					},
					{
						"id": 2675,
						"name": "双柏县",
						"pid": 2673
					},
					{
						"id": 2676,
						"name": "牟定县",
						"pid": 2673
					},
					{
						"id": 2677,
						"name": "南华县",
						"pid": 2673
					},
					{
						"id": 2678,
						"name": "姚安县",
						"pid": 2673
					},
					{
						"id": 2679,
						"name": "大姚县",
						"pid": 2673
					},
					{
						"id": 2680,
						"name": "永仁县",
						"pid": 2673
					},
					{
						"id": 2681,
						"name": "元谋县",
						"pid": 2673
					},
					{
						"id": 2682,
						"name": "武定县",
						"pid": 2673
					},
					{
						"id": 2683,
						"name": "禄丰县",
						"pid": 2673
					}
				]
			},
			{
				"id": 2684,
				"name": "红河哈尼族彝族自治州",
				"pid": 25,
				"children": [{
						"id": 2685,
						"name": "个旧市",
						"pid": 2684
					},
					{
						"id": 2686,
						"name": "开远市",
						"pid": 2684
					},
					{
						"id": 2687,
						"name": "蒙自市",
						"pid": 2684
					},
					{
						"id": 2688,
						"name": "弥勒市",
						"pid": 2684
					},
					{
						"id": 2689,
						"name": "屏边苗族自治县",
						"pid": 2684
					},
					{
						"id": 2690,
						"name": "建水县",
						"pid": 2684
					},
					{
						"id": 2691,
						"name": "石屏县",
						"pid": 2684
					},
					{
						"id": 2692,
						"name": "泸西县",
						"pid": 2684
					},
					{
						"id": 2693,
						"name": "元阳县",
						"pid": 2684
					},
					{
						"id": 2694,
						"name": "红河县",
						"pid": 2684
					},
					{
						"id": 2695,
						"name": "金平苗族瑶族傣族自治县",
						"pid": 2684
					},
					{
						"id": 2696,
						"name": "绿春县",
						"pid": 2684
					},
					{
						"id": 2697,
						"name": "河口瑶族自治县",
						"pid": 2684
					}
				]
			},
			{
				"id": 2698,
				"name": "文山壮族苗族自治州",
				"pid": 25,
				"children": [{
						"id": 2699,
						"name": "文山市",
						"pid": 2698
					},
					{
						"id": 2700,
						"name": "砚山县",
						"pid": 2698
					},
					{
						"id": 2701,
						"name": "西畴县",
						"pid": 2698
					},
					{
						"id": 2702,
						"name": "麻栗坡县",
						"pid": 2698
					},
					{
						"id": 2703,
						"name": "马关县",
						"pid": 2698
					},
					{
						"id": 2704,
						"name": "丘北县",
						"pid": 2698
					},
					{
						"id": 2705,
						"name": "广南县",
						"pid": 2698
					},
					{
						"id": 2706,
						"name": "富宁县",
						"pid": 2698
					}
				]
			},
			{
				"id": 2707,
				"name": "西双版纳傣族自治州",
				"pid": 25,
				"children": [{
						"id": 2708,
						"name": "景洪市",
						"pid": 2707
					},
					{
						"id": 2709,
						"name": "勐海县",
						"pid": 2707
					},
					{
						"id": 2710,
						"name": "勐腊县",
						"pid": 2707
					}
				]
			},
			{
				"id": 2711,
				"name": "大理白族自治州",
				"pid": 25,
				"children": [{
						"id": 2712,
						"name": "大理市",
						"pid": 2711
					},
					{
						"id": 2713,
						"name": "漾濞彝族自治县",
						"pid": 2711
					},
					{
						"id": 2714,
						"name": "祥云县",
						"pid": 2711
					},
					{
						"id": 2715,
						"name": "宾川县",
						"pid": 2711
					},
					{
						"id": 2716,
						"name": "弥渡县",
						"pid": 2711
					},
					{
						"id": 2717,
						"name": "南涧彝族自治县",
						"pid": 2711
					},
					{
						"id": 2718,
						"name": "巍山彝族回族自治县",
						"pid": 2711
					},
					{
						"id": 2719,
						"name": "永平县",
						"pid": 2711
					},
					{
						"id": 2720,
						"name": "云龙县",
						"pid": 2711
					},
					{
						"id": 2721,
						"name": "洱源县",
						"pid": 2711
					},
					{
						"id": 2722,
						"name": "剑川县",
						"pid": 2711
					},
					{
						"id": 2723,
						"name": "鹤庆县",
						"pid": 2711
					}
				]
			},
			{
				"id": 2724,
				"name": "德宏傣族景颇族自治州",
				"pid": 25,
				"children": [{
						"id": 2725,
						"name": "瑞丽市",
						"pid": 2724
					},
					{
						"id": 2726,
						"name": "芒市",
						"pid": 2724
					},
					{
						"id": 2727,
						"name": "梁河县",
						"pid": 2724
					},
					{
						"id": 2728,
						"name": "盈江县",
						"pid": 2724
					},
					{
						"id": 2729,
						"name": "陇川县",
						"pid": 2724
					}
				]
			},
			{
				"id": 2730,
				"name": "怒江傈僳族自治州",
				"pid": 25,
				"children": [{
						"id": 2731,
						"name": "泸水市",
						"pid": 2730
					},
					{
						"id": 2732,
						"name": "福贡县",
						"pid": 2730
					},
					{
						"id": 2733,
						"name": "贡山独龙族怒族自治县",
						"pid": 2730
					},
					{
						"id": 2734,
						"name": "兰坪白族普米族自治县",
						"pid": 2730
					}
				]
			},
			{
				"id": 2735,
				"name": "迪庆藏族自治州",
				"pid": 25,
				"children": [{
						"id": 2736,
						"name": "香格里拉市",
						"pid": 2735
					},
					{
						"id": 2737,
						"name": "德钦县",
						"pid": 2735
					},
					{
						"id": 2738,
						"name": "维西傈僳族自治县",
						"pid": 2735
					}
				]
			}
		]
	},
	{
		"id": 26,
		"name": "西藏自治区",
		"pid": 0,
		"children": [{
				"id": 2739,
				"name": "拉萨市",
				"pid": 26,
				"children": [{
						"id": 2740,
						"name": "城关区",
						"pid": 2739
					},
					{
						"id": 2741,
						"name": "堆龙德庆区",
						"pid": 2739
					},
					{
						"id": 2742,
						"name": "达孜区",
						"pid": 2739
					},
					{
						"id": 2743,
						"name": "林周县",
						"pid": 2739
					},
					{
						"id": 2744,
						"name": "当雄县",
						"pid": 2739
					},
					{
						"id": 2745,
						"name": "尼木县",
						"pid": 2739
					},
					{
						"id": 2746,
						"name": "曲水县",
						"pid": 2739
					},
					{
						"id": 2747,
						"name": "墨竹工卡县",
						"pid": 2739
					}
				]
			},
			{
				"id": 2748,
				"name": "日喀则市",
				"pid": 26,
				"children": [{
						"id": 2749,
						"name": "桑珠孜区",
						"pid": 2748
					},
					{
						"id": 2750,
						"name": "南木林县",
						"pid": 2748
					},
					{
						"id": 2751,
						"name": "江孜县",
						"pid": 2748
					},
					{
						"id": 2752,
						"name": "定日县",
						"pid": 2748
					},
					{
						"id": 2753,
						"name": "萨迦县",
						"pid": 2748
					},
					{
						"id": 2754,
						"name": "拉孜县",
						"pid": 2748
					},
					{
						"id": 2755,
						"name": "昂仁县",
						"pid": 2748
					},
					{
						"id": 2756,
						"name": "谢通门县",
						"pid": 2748
					},
					{
						"id": 2757,
						"name": "白朗县",
						"pid": 2748
					},
					{
						"id": 2758,
						"name": "仁布县",
						"pid": 2748
					},
					{
						"id": 2759,
						"name": "康马县",
						"pid": 2748
					},
					{
						"id": 2760,
						"name": "定结县",
						"pid": 2748
					},
					{
						"id": 2761,
						"name": "仲巴县",
						"pid": 2748
					},
					{
						"id": 2762,
						"name": "亚东县",
						"pid": 2748
					},
					{
						"id": 2763,
						"name": "吉隆县",
						"pid": 2748
					},
					{
						"id": 2764,
						"name": "聂拉木县",
						"pid": 2748
					},
					{
						"id": 2765,
						"name": "萨嘎县",
						"pid": 2748
					},
					{
						"id": 2766,
						"name": "岗巴县",
						"pid": 2748
					}
				]
			},
			{
				"id": 2767,
				"name": "昌都市",
				"pid": 26,
				"children": [{
						"id": 2768,
						"name": "卡若区",
						"pid": 2767
					},
					{
						"id": 2769,
						"name": "江达县",
						"pid": 2767
					},
					{
						"id": 2770,
						"name": "贡觉县",
						"pid": 2767
					},
					{
						"id": 2771,
						"name": "类乌齐县",
						"pid": 2767
					},
					{
						"id": 2772,
						"name": "丁青县",
						"pid": 2767
					},
					{
						"id": 2773,
						"name": "察雅县",
						"pid": 2767
					},
					{
						"id": 2774,
						"name": "八宿县",
						"pid": 2767
					},
					{
						"id": 2775,
						"name": "左贡县",
						"pid": 2767
					},
					{
						"id": 2776,
						"name": "芒康县",
						"pid": 2767
					},
					{
						"id": 2777,
						"name": "洛隆县",
						"pid": 2767
					},
					{
						"id": 2778,
						"name": "边坝县",
						"pid": 2767
					}
				]
			},
			{
				"id": 2779,
				"name": "林芝市",
				"pid": 26,
				"children": [{
						"id": 2780,
						"name": "巴宜区",
						"pid": 2779
					},
					{
						"id": 2781,
						"name": "工布江达县",
						"pid": 2779
					},
					{
						"id": 2782,
						"name": "米林县",
						"pid": 2779
					},
					{
						"id": 2783,
						"name": "墨脱县",
						"pid": 2779
					},
					{
						"id": 2784,
						"name": "波密县",
						"pid": 2779
					},
					{
						"id": 2785,
						"name": "察隅县",
						"pid": 2779
					},
					{
						"id": 2786,
						"name": "朗县",
						"pid": 2779
					}
				]
			},
			{
				"id": 2787,
				"name": "山南市",
				"pid": 26,
				"children": [{
						"id": 2788,
						"name": "乃东区",
						"pid": 2787
					},
					{
						"id": 2789,
						"name": "扎囊县",
						"pid": 2787
					},
					{
						"id": 2790,
						"name": "贡嘎县",
						"pid": 2787
					},
					{
						"id": 2791,
						"name": "桑日县",
						"pid": 2787
					},
					{
						"id": 2792,
						"name": "琼结县",
						"pid": 2787
					},
					{
						"id": 2793,
						"name": "曲松县",
						"pid": 2787
					},
					{
						"id": 2794,
						"name": "措美县",
						"pid": 2787
					},
					{
						"id": 2795,
						"name": "洛扎县",
						"pid": 2787
					},
					{
						"id": 2796,
						"name": "加查县",
						"pid": 2787
					},
					{
						"id": 2797,
						"name": "隆子县",
						"pid": 2787
					},
					{
						"id": 2798,
						"name": "错那县",
						"pid": 2787
					},
					{
						"id": 2799,
						"name": "浪卡子县",
						"pid": 2787
					}
				]
			},
			{
				"id": 2800,
				"name": "那曲市",
				"pid": 26,
				"children": [{
						"id": 2801,
						"name": "色尼区",
						"pid": 2800
					},
					{
						"id": 2802,
						"name": "嘉黎县?",
						"pid": 2800
					},
					{
						"id": 2803,
						"name": "比如县?",
						"pid": 2800
					},
					{
						"id": 2804,
						"name": "聂荣县?",
						"pid": 2800
					},
					{
						"id": 2805,
						"name": "安多县?",
						"pid": 2800
					},
					{
						"id": 2806,
						"name": "申扎县?",
						"pid": 2800
					},
					{
						"id": 2807,
						"name": "索县???",
						"pid": 2800
					},
					{
						"id": 2808,
						"name": "班戈县?",
						"pid": 2800
					},
					{
						"id": 2809,
						"name": "巴青县?",
						"pid": 2800
					},
					{
						"id": 2810,
						"name": "尼玛县?",
						"pid": 2800
					},
					{
						"id": 2811,
						"name": "双湖县?",
						"pid": 2800
					}
				]
			},
			{
				"id": 2812,
				"name": "阿里地区",
				"pid": 26,
				"children": [{
						"id": 2813,
						"name": "普兰县",
						"pid": 2812
					},
					{
						"id": 2814,
						"name": "札达县",
						"pid": 2812
					},
					{
						"id": 2815,
						"name": "噶尔县",
						"pid": 2812
					},
					{
						"id": 2816,
						"name": "日土县",
						"pid": 2812
					},
					{
						"id": 2817,
						"name": "革吉县",
						"pid": 2812
					},
					{
						"id": 2818,
						"name": "改则县",
						"pid": 2812
					},
					{
						"id": 2819,
						"name": "措勤县",
						"pid": 2812
					}
				]
			}
		]
	},
	{
		"id": 27,
		"name": "陕西省",
		"pid": 0,
		"children": [{
				"id": 2820,
				"name": "西安市",
				"pid": 27,
				"children": [{
						"id": 2821,
						"name": "新城区",
						"pid": 2820
					},
					{
						"id": 2822,
						"name": "碑林区",
						"pid": 2820
					},
					{
						"id": 2823,
						"name": "莲湖区",
						"pid": 2820
					},
					{
						"id": 2824,
						"name": "灞桥区",
						"pid": 2820
					},
					{
						"id": 2825,
						"name": "未央区",
						"pid": 2820
					},
					{
						"id": 2826,
						"name": "雁塔区",
						"pid": 2820
					},
					{
						"id": 2827,
						"name": "阎良区",
						"pid": 2820
					},
					{
						"id": 2828,
						"name": "临潼区",
						"pid": 2820
					},
					{
						"id": 2829,
						"name": "长安区",
						"pid": 2820
					},
					{
						"id": 2830,
						"name": "高陵区",
						"pid": 2820
					},
					{
						"id": 2831,
						"name": "鄠邑区",
						"pid": 2820
					},
					{
						"id": 2832,
						"name": "蓝田县",
						"pid": 2820
					},
					{
						"id": 2833,
						"name": "周至县",
						"pid": 2820
					}
				]
			},
			{
				"id": 2834,
				"name": "铜川市",
				"pid": 27,
				"children": [{
						"id": 2835,
						"name": "王益区",
						"pid": 2834
					},
					{
						"id": 2836,
						"name": "印台区",
						"pid": 2834
					},
					{
						"id": 2837,
						"name": "耀州区",
						"pid": 2834
					},
					{
						"id": 2838,
						"name": "宜君县",
						"pid": 2834
					}
				]
			},
			{
				"id": 2839,
				"name": "宝鸡市",
				"pid": 27,
				"children": [{
						"id": 2840,
						"name": "渭滨区",
						"pid": 2839
					},
					{
						"id": 2841,
						"name": "金台区",
						"pid": 2839
					},
					{
						"id": 2842,
						"name": "陈仓区",
						"pid": 2839
					},
					{
						"id": 2843,
						"name": "凤翔县",
						"pid": 2839
					},
					{
						"id": 2844,
						"name": "岐山县",
						"pid": 2839
					},
					{
						"id": 2845,
						"name": "扶风县",
						"pid": 2839
					},
					{
						"id": 2846,
						"name": "眉县",
						"pid": 2839
					},
					{
						"id": 2847,
						"name": "陇县",
						"pid": 2839
					},
					{
						"id": 2848,
						"name": "千阳县",
						"pid": 2839
					},
					{
						"id": 2849,
						"name": "麟游县",
						"pid": 2839
					},
					{
						"id": 2850,
						"name": "凤县",
						"pid": 2839
					},
					{
						"id": 2851,
						"name": "太白县",
						"pid": 2839
					}
				]
			},
			{
				"id": 2852,
				"name": "咸阳市",
				"pid": 27,
				"children": [{
						"id": 2853,
						"name": "秦都区",
						"pid": 2852
					},
					{
						"id": 2854,
						"name": "杨陵区",
						"pid": 2852
					},
					{
						"id": 2855,
						"name": "渭城区",
						"pid": 2852
					},
					{
						"id": 2856,
						"name": "三原县",
						"pid": 2852
					},
					{
						"id": 2857,
						"name": "泾阳县",
						"pid": 2852
					},
					{
						"id": 2858,
						"name": "乾县",
						"pid": 2852
					},
					{
						"id": 2859,
						"name": "礼泉县",
						"pid": 2852
					},
					{
						"id": 2860,
						"name": "永寿县",
						"pid": 2852
					},
					{
						"id": 2861,
						"name": "彬县",
						"pid": 2852
					},
					{
						"id": 2862,
						"name": "长武县",
						"pid": 2852
					},
					{
						"id": 2863,
						"name": "旬邑县",
						"pid": 2852
					},
					{
						"id": 2864,
						"name": "淳化县",
						"pid": 2852
					},
					{
						"id": 2865,
						"name": "武功县",
						"pid": 2852
					},
					{
						"id": 2866,
						"name": "兴平市",
						"pid": 2852
					}
				]
			},
			{
				"id": 2867,
				"name": "渭南市",
				"pid": 27,
				"children": [{
						"id": 2868,
						"name": "临渭区",
						"pid": 2867
					},
					{
						"id": 2869,
						"name": "华州区",
						"pid": 2867
					},
					{
						"id": 2870,
						"name": "潼关县",
						"pid": 2867
					},
					{
						"id": 2871,
						"name": "大荔县",
						"pid": 2867
					},
					{
						"id": 2872,
						"name": "合阳县",
						"pid": 2867
					},
					{
						"id": 2873,
						"name": "澄城县",
						"pid": 2867
					},
					{
						"id": 2874,
						"name": "蒲城县",
						"pid": 2867
					},
					{
						"id": 2875,
						"name": "白水县",
						"pid": 2867
					},
					{
						"id": 2876,
						"name": "富平县",
						"pid": 2867
					},
					{
						"id": 2877,
						"name": "韩城市",
						"pid": 2867
					},
					{
						"id": 2878,
						"name": "华阴市",
						"pid": 2867
					}
				]
			},
			{
				"id": 2879,
				"name": "延安市",
				"pid": 27,
				"children": [{
						"id": 2880,
						"name": "宝塔区",
						"pid": 2879
					},
					{
						"id": 2881,
						"name": "安塞区",
						"pid": 2879
					},
					{
						"id": 2882,
						"name": "延长县",
						"pid": 2879
					},
					{
						"id": 2883,
						"name": "延川县",
						"pid": 2879
					},
					{
						"id": 2884,
						"name": "子长县",
						"pid": 2879
					},
					{
						"id": 2885,
						"name": "志丹县",
						"pid": 2879
					},
					{
						"id": 2886,
						"name": "吴起县",
						"pid": 2879
					},
					{
						"id": 2887,
						"name": "甘泉县",
						"pid": 2879
					},
					{
						"id": 2888,
						"name": "富县",
						"pid": 2879
					},
					{
						"id": 2889,
						"name": "洛川县",
						"pid": 2879
					},
					{
						"id": 2890,
						"name": "宜川县",
						"pid": 2879
					},
					{
						"id": 2891,
						"name": "黄龙县",
						"pid": 2879
					},
					{
						"id": 2892,
						"name": "黄陵县",
						"pid": 2879
					}
				]
			},
			{
				"id": 2893,
				"name": "汉中市",
				"pid": 27,
				"children": [{
						"id": 2894,
						"name": "汉台区",
						"pid": 2893
					},
					{
						"id": 2895,
						"name": "南郑区",
						"pid": 2893
					},
					{
						"id": 2896,
						"name": "城固县",
						"pid": 2893
					},
					{
						"id": 2897,
						"name": "洋县",
						"pid": 2893
					},
					{
						"id": 2898,
						"name": "西乡县",
						"pid": 2893
					},
					{
						"id": 2899,
						"name": "勉县",
						"pid": 2893
					},
					{
						"id": 2900,
						"name": "宁强县",
						"pid": 2893
					},
					{
						"id": 2901,
						"name": "略阳县",
						"pid": 2893
					},
					{
						"id": 2902,
						"name": "镇巴县",
						"pid": 2893
					},
					{
						"id": 2903,
						"name": "留坝县",
						"pid": 2893
					},
					{
						"id": 2904,
						"name": "佛坪县",
						"pid": 2893
					}
				]
			},
			{
				"id": 2905,
				"name": "榆林市",
				"pid": 27,
				"children": [{
						"id": 2906,
						"name": "榆阳区",
						"pid": 2905
					},
					{
						"id": 2907,
						"name": "横山区",
						"pid": 2905
					},
					{
						"id": 2908,
						"name": "府谷县",
						"pid": 2905
					},
					{
						"id": 2909,
						"name": "靖边县",
						"pid": 2905
					},
					{
						"id": 2910,
						"name": "定边县",
						"pid": 2905
					},
					{
						"id": 2911,
						"name": "绥德县",
						"pid": 2905
					},
					{
						"id": 2912,
						"name": "米脂县",
						"pid": 2905
					},
					{
						"id": 2913,
						"name": "佳县",
						"pid": 2905
					},
					{
						"id": 2914,
						"name": "吴堡县",
						"pid": 2905
					},
					{
						"id": 2915,
						"name": "清涧县",
						"pid": 2905
					},
					{
						"id": 2916,
						"name": "子洲县",
						"pid": 2905
					},
					{
						"id": 2917,
						"name": "神木市",
						"pid": 2905
					}
				]
			},
			{
				"id": 2918,
				"name": "安康市",
				"pid": 27,
				"children": [{
						"id": 2919,
						"name": "汉滨区",
						"pid": 2918
					},
					{
						"id": 2920,
						"name": "汉阴县",
						"pid": 2918
					},
					{
						"id": 2921,
						"name": "石泉县",
						"pid": 2918
					},
					{
						"id": 2922,
						"name": "宁陕县",
						"pid": 2918
					},
					{
						"id": 2923,
						"name": "紫阳县",
						"pid": 2918
					},
					{
						"id": 2924,
						"name": "岚皋县",
						"pid": 2918
					},
					{
						"id": 2925,
						"name": "平利县",
						"pid": 2918
					},
					{
						"id": 2926,
						"name": "镇坪县",
						"pid": 2918
					},
					{
						"id": 2927,
						"name": "旬阳县",
						"pid": 2918
					},
					{
						"id": 2928,
						"name": "白河县",
						"pid": 2918
					}
				]
			},
			{
				"id": 2929,
				"name": "商洛市",
				"pid": 27,
				"children": [{
						"id": 2930,
						"name": "商州区",
						"pid": 2929
					},
					{
						"id": 2931,
						"name": "洛南县",
						"pid": 2929
					},
					{
						"id": 2932,
						"name": "丹凤县",
						"pid": 2929
					},
					{
						"id": 2933,
						"name": "商南县",
						"pid": 2929
					},
					{
						"id": 2934,
						"name": "山阳县",
						"pid": 2929
					},
					{
						"id": 2935,
						"name": "镇安县",
						"pid": 2929
					},
					{
						"id": 2936,
						"name": "柞水县",
						"pid": 2929
					}
				]
			}
		]
	},
	{
		"id": 28,
		"name": "甘肃省",
		"pid": 0,
		"children": [{
				"id": 2937,
				"name": "兰州市",
				"pid": 28,
				"children": [{
						"id": 2938,
						"name": "城关区",
						"pid": 2937
					},
					{
						"id": 2939,
						"name": "七里河区",
						"pid": 2937
					},
					{
						"id": 2940,
						"name": "西固区",
						"pid": 2937
					},
					{
						"id": 2941,
						"name": "安宁区",
						"pid": 2937
					},
					{
						"id": 2942,
						"name": "红古区",
						"pid": 2937
					},
					{
						"id": 2943,
						"name": "永登县",
						"pid": 2937
					},
					{
						"id": 2944,
						"name": "皋兰县",
						"pid": 2937
					},
					{
						"id": 2945,
						"name": "榆中县",
						"pid": 2937
					}
				]
			},
			{
				"id": 2946,
				"name": "嘉峪关市",
				"pid": 28,
				"children": [{
					"id": 2947,
					"name": "嘉峪关市",
					"pid": 2946
				}]
			},
			{
				"id": 2948,
				"name": "金昌市",
				"pid": 28,
				"children": [{
						"id": 2949,
						"name": "金川区",
						"pid": 2948
					},
					{
						"id": 2950,
						"name": "永昌县",
						"pid": 2948
					}
				]
			},
			{
				"id": 2951,
				"name": "白银市",
				"pid": 28,
				"children": [{
						"id": 2952,
						"name": "白银区",
						"pid": 2951
					},
					{
						"id": 2953,
						"name": "平川区",
						"pid": 2951
					},
					{
						"id": 2954,
						"name": "靖远县",
						"pid": 2951
					},
					{
						"id": 2955,
						"name": "会宁县",
						"pid": 2951
					},
					{
						"id": 2956,
						"name": "景泰县",
						"pid": 2951
					}
				]
			},
			{
				"id": 2957,
				"name": "天水市",
				"pid": 28,
				"children": [{
						"id": 2958,
						"name": "秦州区",
						"pid": 2957
					},
					{
						"id": 2959,
						"name": "麦积区",
						"pid": 2957
					},
					{
						"id": 2960,
						"name": "清水县",
						"pid": 2957
					},
					{
						"id": 2961,
						"name": "秦安县",
						"pid": 2957
					},
					{
						"id": 2962,
						"name": "甘谷县",
						"pid": 2957
					},
					{
						"id": 2963,
						"name": "武山县",
						"pid": 2957
					},
					{
						"id": 2964,
						"name": "张家川回族自治县",
						"pid": 2957
					}
				]
			},
			{
				"id": 2965,
				"name": "武威市",
				"pid": 28,
				"children": [{
						"id": 2966,
						"name": "凉州区",
						"pid": 2965
					},
					{
						"id": 2967,
						"name": "民勤县",
						"pid": 2965
					},
					{
						"id": 2968,
						"name": "古浪县",
						"pid": 2965
					},
					{
						"id": 2969,
						"name": "天祝藏族自治县",
						"pid": 2965
					}
				]
			},
			{
				"id": 2970,
				"name": "张掖市",
				"pid": 28,
				"children": [{
						"id": 2971,
						"name": "甘州区",
						"pid": 2970
					},
					{
						"id": 2972,
						"name": "肃南裕固族自治县",
						"pid": 2970
					},
					{
						"id": 2973,
						"name": "民乐县",
						"pid": 2970
					},
					{
						"id": 2974,
						"name": "临泽县",
						"pid": 2970
					},
					{
						"id": 2975,
						"name": "高台县",
						"pid": 2970
					},
					{
						"id": 2976,
						"name": "山丹县",
						"pid": 2970
					}
				]
			},
			{
				"id": 2977,
				"name": "平凉市",
				"pid": 28,
				"children": [{
						"id": 2978,
						"name": "崆峒区",
						"pid": 2977
					},
					{
						"id": 2979,
						"name": "泾川县",
						"pid": 2977
					},
					{
						"id": 2980,
						"name": "灵台县",
						"pid": 2977
					},
					{
						"id": 2981,
						"name": "崇信县",
						"pid": 2977
					},
					{
						"id": 2982,
						"name": "华亭县",
						"pid": 2977
					},
					{
						"id": 2983,
						"name": "庄浪县",
						"pid": 2977
					},
					{
						"id": 2984,
						"name": "静宁县",
						"pid": 2977
					}
				]
			},
			{
				"id": 2985,
				"name": "酒泉市",
				"pid": 28,
				"children": [{
						"id": 2986,
						"name": "肃州区",
						"pid": 2985
					},
					{
						"id": 2987,
						"name": "金塔县",
						"pid": 2985
					},
					{
						"id": 2988,
						"name": "瓜州县",
						"pid": 2985
					},
					{
						"id": 2989,
						"name": "肃北蒙古族自治县",
						"pid": 2985
					},
					{
						"id": 2990,
						"name": "阿克塞哈萨克族自治县",
						"pid": 2985
					},
					{
						"id": 2991,
						"name": "玉门市",
						"pid": 2985
					},
					{
						"id": 2992,
						"name": "敦煌市",
						"pid": 2985
					}
				]
			},
			{
				"id": 2993,
				"name": "庆阳市",
				"pid": 28,
				"children": [{
						"id": 2994,
						"name": "西峰区",
						"pid": 2993
					},
					{
						"id": 2995,
						"name": "庆城县",
						"pid": 2993
					},
					{
						"id": 2996,
						"name": "环县",
						"pid": 2993
					},
					{
						"id": 2997,
						"name": "华池县",
						"pid": 2993
					},
					{
						"id": 2998,
						"name": "合水县",
						"pid": 2993
					},
					{
						"id": 2999,
						"name": "正宁县",
						"pid": 2993
					},
					{
						"id": 3000,
						"name": "宁县",
						"pid": 2993
					},
					{
						"id": 3001,
						"name": "镇原县",
						"pid": 2993
					}
				]
			},
			{
				"id": 3002,
				"name": "定西市",
				"pid": 28,
				"children": [{
						"id": 3003,
						"name": "安定区",
						"pid": 3002
					},
					{
						"id": 3004,
						"name": "通渭县",
						"pid": 3002
					},
					{
						"id": 3005,
						"name": "陇西县",
						"pid": 3002
					},
					{
						"id": 3006,
						"name": "渭源县",
						"pid": 3002
					},
					{
						"id": 3007,
						"name": "临洮县",
						"pid": 3002
					},
					{
						"id": 3008,
						"name": "漳县",
						"pid": 3002
					},
					{
						"id": 3009,
						"name": "岷县",
						"pid": 3002
					}
				]
			},
			{
				"id": 3010,
				"name": "陇南市",
				"pid": 28,
				"children": [{
						"id": 3011,
						"name": "武都区",
						"pid": 3010
					},
					{
						"id": 3012,
						"name": "成县",
						"pid": 3010
					},
					{
						"id": 3013,
						"name": "文县",
						"pid": 3010
					},
					{
						"id": 3014,
						"name": "宕昌县",
						"pid": 3010
					},
					{
						"id": 3015,
						"name": "康县",
						"pid": 3010
					},
					{
						"id": 3016,
						"name": "西和县",
						"pid": 3010
					},
					{
						"id": 3017,
						"name": "礼县",
						"pid": 3010
					},
					{
						"id": 3018,
						"name": "徽县",
						"pid": 3010
					},
					{
						"id": 3019,
						"name": "两当县",
						"pid": 3010
					}
				]
			},
			{
				"id": 3020,
				"name": "临夏回族自治州",
				"pid": 28,
				"children": [{
						"id": 3021,
						"name": "临夏市",
						"pid": 3020
					},
					{
						"id": 3022,
						"name": "临夏县",
						"pid": 3020
					},
					{
						"id": 3023,
						"name": "康乐县",
						"pid": 3020
					},
					{
						"id": 3024,
						"name": "永靖县",
						"pid": 3020
					},
					{
						"id": 3025,
						"name": "广河县",
						"pid": 3020
					},
					{
						"id": 3026,
						"name": "和政县",
						"pid": 3020
					},
					{
						"id": 3027,
						"name": "东乡族自治县",
						"pid": 3020
					},
					{
						"id": 3028,
						"name": "积石山保安族东乡族撒拉族自治县",
						"pid": 3020
					}
				]
			},
			{
				"id": 3029,
				"name": "甘南藏族自治州",
				"pid": 28,
				"children": [{
						"id": 3030,
						"name": "合作市",
						"pid": 3029
					},
					{
						"id": 3031,
						"name": "临潭县",
						"pid": 3029
					},
					{
						"id": 3032,
						"name": "卓尼县",
						"pid": 3029
					},
					{
						"id": 3033,
						"name": "舟曲县",
						"pid": 3029
					},
					{
						"id": 3034,
						"name": "迭部县",
						"pid": 3029
					},
					{
						"id": 3035,
						"name": "玛曲县",
						"pid": 3029
					},
					{
						"id": 3036,
						"name": "碌曲县",
						"pid": 3029
					},
					{
						"id": 3037,
						"name": "夏河县",
						"pid": 3029
					}
				]
			}
		]
	},
	{
		"id": 29,
		"name": "青海省",
		"pid": 0,
		"children": [{
				"id": 3038,
				"name": "西宁市",
				"pid": 29,
				"children": [{
						"id": 3039,
						"name": "城东区",
						"pid": 3038
					},
					{
						"id": 3040,
						"name": "城中区",
						"pid": 3038
					},
					{
						"id": 3041,
						"name": "城西区",
						"pid": 3038
					},
					{
						"id": 3042,
						"name": "城北区",
						"pid": 3038
					},
					{
						"id": 3043,
						"name": "大通回族土族自治县",
						"pid": 3038
					},
					{
						"id": 3044,
						"name": "湟中县",
						"pid": 3038
					},
					{
						"id": 3045,
						"name": "湟源县",
						"pid": 3038
					}
				]
			},
			{
				"id": 3046,
				"name": "海东市",
				"pid": 29,
				"children": [{
						"id": 3047,
						"name": "乐都区",
						"pid": 3046
					},
					{
						"id": 3048,
						"name": "平安区",
						"pid": 3046
					},
					{
						"id": 3049,
						"name": "民和回族土族自治县",
						"pid": 3046
					},
					{
						"id": 3050,
						"name": "互助土族自治县",
						"pid": 3046
					},
					{
						"id": 3051,
						"name": "化隆回族自治县",
						"pid": 3046
					},
					{
						"id": 3052,
						"name": "循化撒拉族自治县",
						"pid": 3046
					}
				]
			},
			{
				"id": 3053,
				"name": "海北藏族自治州",
				"pid": 29,
				"children": [{
						"id": 3054,
						"name": "门源回族自治县",
						"pid": 3053
					},
					{
						"id": 3055,
						"name": "祁连县",
						"pid": 3053
					},
					{
						"id": 3056,
						"name": "海晏县",
						"pid": 3053
					},
					{
						"id": 3057,
						"name": "刚察县",
						"pid": 3053
					}
				]
			},
			{
				"id": 3058,
				"name": "黄南藏族自治州",
				"pid": 29,
				"children": [{
						"id": 3059,
						"name": "同仁县",
						"pid": 3058
					},
					{
						"id": 3060,
						"name": "尖扎县",
						"pid": 3058
					},
					{
						"id": 3061,
						"name": "泽库县",
						"pid": 3058
					},
					{
						"id": 3062,
						"name": "河南蒙古族自治县",
						"pid": 3058
					}
				]
			},
			{
				"id": 3063,
				"name": "海南藏族自治州",
				"pid": 29,
				"children": [{
						"id": 3064,
						"name": "共和县",
						"pid": 3063
					},
					{
						"id": 3065,
						"name": "同德县",
						"pid": 3063
					},
					{
						"id": 3066,
						"name": "贵德县",
						"pid": 3063
					},
					{
						"id": 3067,
						"name": "兴海县",
						"pid": 3063
					},
					{
						"id": 3068,
						"name": "贵南县",
						"pid": 3063
					}
				]
			},
			{
				"id": 3069,
				"name": "果洛藏族自治州",
				"pid": 29,
				"children": [{
						"id": 3070,
						"name": "玛沁县",
						"pid": 3069
					},
					{
						"id": 3071,
						"name": "班玛县",
						"pid": 3069
					},
					{
						"id": 3072,
						"name": "甘德县",
						"pid": 3069
					},
					{
						"id": 3073,
						"name": "达日县",
						"pid": 3069
					},
					{
						"id": 3074,
						"name": "久治县",
						"pid": 3069
					},
					{
						"id": 3075,
						"name": "玛多县",
						"pid": 3069
					}
				]
			},
			{
				"id": 3076,
				"name": "玉树藏族自治州",
				"pid": 29,
				"children": [{
						"id": 3077,
						"name": "玉树市",
						"pid": 3076
					},
					{
						"id": 3078,
						"name": "杂多县",
						"pid": 3076
					},
					{
						"id": 3079,
						"name": "称多县",
						"pid": 3076
					},
					{
						"id": 3080,
						"name": "治多县",
						"pid": 3076
					},
					{
						"id": 3081,
						"name": "囊谦县",
						"pid": 3076
					},
					{
						"id": 3082,
						"name": "曲麻莱县",
						"pid": 3076
					}
				]
			},
			{
				"id": 3083,
				"name": "海西蒙古族藏族自治州",
				"pid": 29,
				"children": [{
						"id": 3084,
						"name": "格尔木市",
						"pid": 3083
					},
					{
						"id": 3085,
						"name": "德令哈市",
						"pid": 3083
					},
					{
						"id": 3086,
						"name": "乌兰县",
						"pid": 3083
					},
					{
						"id": 3087,
						"name": "都兰县",
						"pid": 3083
					},
					{
						"id": 3088,
						"name": "天峻县",
						"pid": 3083
					}
				]
			}
		]
	},
	{
		"id": 30,
		"name": "宁夏回族自治区",
		"pid": 0,
		"children": [{
				"id": 3089,
				"name": "银川市",
				"pid": 30,
				"children": [{
						"id": 3090,
						"name": "兴庆区",
						"pid": 3089
					},
					{
						"id": 3091,
						"name": "西夏区",
						"pid": 3089
					},
					{
						"id": 3092,
						"name": "金凤区",
						"pid": 3089
					},
					{
						"id": 3093,
						"name": "永宁县",
						"pid": 3089
					},
					{
						"id": 3094,
						"name": "贺兰县",
						"pid": 3089
					},
					{
						"id": 3095,
						"name": "灵武市",
						"pid": 3089
					}
				]
			},
			{
				"id": 3096,
				"name": "石嘴山市",
				"pid": 30,
				"children": [{
						"id": 3097,
						"name": "大武口区",
						"pid": 3096
					},
					{
						"id": 3098,
						"name": "惠农区",
						"pid": 3096
					},
					{
						"id": 3099,
						"name": "平罗县",
						"pid": 3096
					}
				]
			},
			{
				"id": 3100,
				"name": "吴忠市",
				"pid": 30,
				"children": [{
						"id": 3101,
						"name": "利通区",
						"pid": 3100
					},
					{
						"id": 3102,
						"name": "红寺堡区",
						"pid": 3100
					},
					{
						"id": 3103,
						"name": "盐池县",
						"pid": 3100
					},
					{
						"id": 3104,
						"name": "同心县",
						"pid": 3100
					},
					{
						"id": 3105,
						"name": "青铜峡市",
						"pid": 3100
					}
				]
			},
			{
				"id": 3106,
				"name": "固原市",
				"pid": 30,
				"children": [{
						"id": 3107,
						"name": "原州区",
						"pid": 3106
					},
					{
						"id": 3108,
						"name": "西吉县",
						"pid": 3106
					},
					{
						"id": 3109,
						"name": "隆德县",
						"pid": 3106
					},
					{
						"id": 3110,
						"name": "泾源县",
						"pid": 3106
					},
					{
						"id": 3111,
						"name": "彭阳县",
						"pid": 3106
					}
				]
			},
			{
				"id": 3112,
				"name": "中卫市",
				"pid": 30,
				"children": [{
						"id": 3113,
						"name": "沙坡头区",
						"pid": 3112
					},
					{
						"id": 3114,
						"name": "中宁县",
						"pid": 3112
					},
					{
						"id": 3115,
						"name": "海原县",
						"pid": 3112
					}
				]
			}
		]
	},
	{
		"id": 31,
		"name": "新疆维吾尔自治区",
		"pid": 0,
		"children": [{
				"id": 3116,
				"name": "乌鲁木齐市",
				"pid": 31,
				"children": [{
						"id": 3117,
						"name": "天山区",
						"pid": 3116
					},
					{
						"id": 3118,
						"name": "沙依巴克区",
						"pid": 3116
					},
					{
						"id": 3119,
						"name": "新市区",
						"pid": 3116
					},
					{
						"id": 3120,
						"name": "水磨沟区",
						"pid": 3116
					},
					{
						"id": 3121,
						"name": "头屯河区",
						"pid": 3116
					},
					{
						"id": 3122,
						"name": "达坂城区",
						"pid": 3116
					},
					{
						"id": 3123,
						"name": "米东区",
						"pid": 3116
					},
					{
						"id": 3124,
						"name": "乌鲁木齐县",
						"pid": 3116
					}
				]
			},
			{
				"id": 3125,
				"name": "克拉玛依市",
				"pid": 31,
				"children": [{
						"id": 3126,
						"name": "独山子区",
						"pid": 3125
					},
					{
						"id": 3127,
						"name": "克拉玛依区",
						"pid": 3125
					},
					{
						"id": 3128,
						"name": "白碱滩区",
						"pid": 3125
					},
					{
						"id": 3129,
						"name": "乌尔禾区",
						"pid": 3125
					}
				]
			},
			{
				"id": 3130,
				"name": "吐鲁番市",
				"pid": 31,
				"children": [{
						"id": 3131,
						"name": "高昌区",
						"pid": 3130
					},
					{
						"id": 3132,
						"name": "鄯善县",
						"pid": 3130
					},
					{
						"id": 3133,
						"name": "托克逊县",
						"pid": 3130
					}
				]
			},
			{
				"id": 3134,
				"name": "哈密市",
				"pid": 31,
				"children": [{
						"id": 3135,
						"name": "伊州区",
						"pid": 3134
					},
					{
						"id": 3136,
						"name": "巴里坤哈萨克自治县",
						"pid": 3134
					},
					{
						"id": 3137,
						"name": "伊吾县",
						"pid": 3134
					}
				]
			},
			{
				"id": 3138,
				"name": "昌吉回族自治州",
				"pid": 31,
				"children": [{
						"id": 3139,
						"name": "昌吉市",
						"pid": 3138
					},
					{
						"id": 3140,
						"name": "阜康市",
						"pid": 3138
					},
					{
						"id": 3141,
						"name": "呼图壁县",
						"pid": 3138
					},
					{
						"id": 3142,
						"name": "玛纳斯县",
						"pid": 3138
					},
					{
						"id": 3143,
						"name": "奇台县",
						"pid": 3138
					},
					{
						"id": 3144,
						"name": "吉木萨尔县",
						"pid": 3138
					},
					{
						"id": 3145,
						"name": "木垒哈萨克自治县",
						"pid": 3138
					}
				]
			},
			{
				"id": 3146,
				"name": "博尔塔拉蒙古自治州",
				"pid": 31,
				"children": [{
						"id": 3147,
						"name": "博乐市",
						"pid": 3146
					},
					{
						"id": 3148,
						"name": "阿拉山口市",
						"pid": 3146
					},
					{
						"id": 3149,
						"name": "精河县",
						"pid": 3146
					},
					{
						"id": 3150,
						"name": "温泉县",
						"pid": 3146
					}
				]
			},
			{
				"id": 3151,
				"name": "巴音郭楞蒙古自治州",
				"pid": 31,
				"children": [{
						"id": 3152,
						"name": "库尔勒市",
						"pid": 3151
					},
					{
						"id": 3153,
						"name": "轮台县",
						"pid": 3151
					},
					{
						"id": 3154,
						"name": "尉犁县",
						"pid": 3151
					},
					{
						"id": 3155,
						"name": "若羌县",
						"pid": 3151
					},
					{
						"id": 3156,
						"name": "且末县",
						"pid": 3151
					},
					{
						"id": 3157,
						"name": "焉耆回族自治县",
						"pid": 3151
					},
					{
						"id": 3158,
						"name": "和静县",
						"pid": 3151
					},
					{
						"id": 3159,
						"name": "和硕县",
						"pid": 3151
					},
					{
						"id": 3160,
						"name": "博湖县",
						"pid": 3151
					}
				]
			},
			{
				"id": 3161,
				"name": "阿克苏地区",
				"pid": 31,
				"children": [{
						"id": 3162,
						"name": "阿克苏市",
						"pid": 3161
					},
					{
						"id": 3163,
						"name": "温宿县",
						"pid": 3161
					},
					{
						"id": 3164,
						"name": "库车县",
						"pid": 3161
					},
					{
						"id": 3165,
						"name": "沙雅县",
						"pid": 3161
					},
					{
						"id": 3166,
						"name": "新和县",
						"pid": 3161
					},
					{
						"id": 3167,
						"name": "拜城县",
						"pid": 3161
					},
					{
						"id": 3168,
						"name": "乌什县",
						"pid": 3161
					},
					{
						"id": 3169,
						"name": "阿瓦提县",
						"pid": 3161
					},
					{
						"id": 3170,
						"name": "柯坪县",
						"pid": 3161
					}
				]
			},
			{
				"id": 3171,
				"name": "克孜勒苏柯尔克孜自治州",
				"pid": 31,
				"children": [{
						"id": 3172,
						"name": "阿图什市",
						"pid": 3171
					},
					{
						"id": 3173,
						"name": "阿克陶县",
						"pid": 3171
					},
					{
						"id": 3174,
						"name": "阿合奇县",
						"pid": 3171
					},
					{
						"id": 3175,
						"name": "乌恰县",
						"pid": 3171
					}
				]
			},
			{
				"id": 3176,
				"name": "喀什地区",
				"pid": 31,
				"children": [{
						"id": 3177,
						"name": "喀什市",
						"pid": 3176
					},
					{
						"id": 3178,
						"name": "疏附县",
						"pid": 3176
					},
					{
						"id": 3179,
						"name": "疏勒县",
						"pid": 3176
					},
					{
						"id": 3180,
						"name": "英吉沙县",
						"pid": 3176
					},
					{
						"id": 3181,
						"name": "泽普县",
						"pid": 3176
					},
					{
						"id": 3182,
						"name": "莎车县",
						"pid": 3176
					},
					{
						"id": 3183,
						"name": "叶城县",
						"pid": 3176
					},
					{
						"id": 3184,
						"name": "麦盖提县",
						"pid": 3176
					},
					{
						"id": 3185,
						"name": "岳普湖县",
						"pid": 3176
					},
					{
						"id": 3186,
						"name": "伽师县",
						"pid": 3176
					},
					{
						"id": 3187,
						"name": "巴楚县",
						"pid": 3176
					},
					{
						"id": 3188,
						"name": "塔什库尔干塔吉克自治县",
						"pid": 3176
					}
				]
			},
			{
				"id": 3189,
				"name": "和田地区",
				"pid": 31,
				"children": [{
						"id": 3190,
						"name": "和田市",
						"pid": 3189
					},
					{
						"id": 3191,
						"name": "和田县",
						"pid": 3189
					},
					{
						"id": 3192,
						"name": "墨玉县",
						"pid": 3189
					},
					{
						"id": 3193,
						"name": "皮山县",
						"pid": 3189
					},
					{
						"id": 3194,
						"name": "洛浦县",
						"pid": 3189
					},
					{
						"id": 3195,
						"name": "策勒县",
						"pid": 3189
					},
					{
						"id": 3196,
						"name": "于田县",
						"pid": 3189
					},
					{
						"id": 3197,
						"name": "民丰县",
						"pid": 3189
					}
				]
			},
			{
				"id": 3198,
				"name": "伊犁哈萨克自治州",
				"pid": 31,
				"children": [{
						"id": 3199,
						"name": "伊宁市",
						"pid": 3198
					},
					{
						"id": 3200,
						"name": "奎屯市",
						"pid": 3198
					},
					{
						"id": 3201,
						"name": "霍尔果斯市",
						"pid": 3198
					},
					{
						"id": 3202,
						"name": "伊宁县",
						"pid": 3198
					},
					{
						"id": 3203,
						"name": "察布查尔锡伯自治县",
						"pid": 3198
					},
					{
						"id": 3204,
						"name": "霍城县",
						"pid": 3198
					},
					{
						"id": 3205,
						"name": "巩留县",
						"pid": 3198
					},
					{
						"id": 3206,
						"name": "新源县",
						"pid": 3198
					},
					{
						"id": 3207,
						"name": "昭苏县",
						"pid": 3198
					},
					{
						"id": 3208,
						"name": "特克斯县",
						"pid": 3198
					},
					{
						"id": 3209,
						"name": "尼勒克县",
						"pid": 3198
					}
				]
			},
			{
				"id": 3210,
				"name": "塔城地区",
				"pid": 31,
				"children": [{
						"id": 3211,
						"name": "塔城市",
						"pid": 3210
					},
					{
						"id": 3212,
						"name": "乌苏市",
						"pid": 3210
					},
					{
						"id": 3213,
						"name": "额敏县",
						"pid": 3210
					},
					{
						"id": 3214,
						"name": "沙湾县",
						"pid": 3210
					},
					{
						"id": 3215,
						"name": "托里县",
						"pid": 3210
					},
					{
						"id": 3216,
						"name": "裕民县",
						"pid": 3210
					},
					{
						"id": 3217,
						"name": "和布克赛尔蒙古自治县",
						"pid": 3210
					}
				]
			},
			{
				"id": 3218,
				"name": "阿勒泰地区",
				"pid": 31,
				"children": [{
						"id": 3219,
						"name": "阿勒泰市",
						"pid": 3218
					},
					{
						"id": 3220,
						"name": "布尔津县",
						"pid": 3218
					},
					{
						"id": 3221,
						"name": "富蕴县",
						"pid": 3218
					},
					{
						"id": 3222,
						"name": "福海县",
						"pid": 3218
					},
					{
						"id": 3223,
						"name": "哈巴河县",
						"pid": 3218
					},
					{
						"id": 3224,
						"name": "青河县",
						"pid": 3218
					},
					{
						"id": 3225,
						"name": "吉木乃县",
						"pid": 3218
					}
				]
			},
			{
				"id": 3226,
				"name": "石河子市",
				"pid": 31,
				"children": [{
					"id": 3227,
					"name": "石河子市",
					"pid": 3226
				}]
			},
			{
				"id": 3228,
				"name": "阿拉尔市",
				"pid": 31,
				"children": [{
					"id": 3229,
					"name": "阿拉尔市",
					"pid": 3228
				}]
			},
			{
				"id": 3230,
				"name": "图木舒克市",
				"pid": 31,
				"children": [{
					"id": 3231,
					"name": "图木舒克市",
					"pid": 3230
				}]
			},
			{
				"id": 3232,
				"name": "五家渠市",
				"pid": 31,
				"children": [{
					"id": 3233,
					"name": "五家渠市",
					"pid": 3232
				}]
			},
			{
				"id": 3234,
				"name": "北屯市",
				"pid": 31,
				"children": [{
					"id": 3235,
					"name": "北屯市",
					"pid": 3234
				}]
			},
			{
				"id": 3236,
				"name": "铁门关市",
				"pid": 31,
				"children": [{
					"id": 3237,
					"name": "铁门关市",
					"pid": 3236
				}]
			},
			{
				"id": 3238,
				"name": "双河市",
				"pid": 31,
				"children": [{
					"id": 3239,
					"name": "双河市",
					"pid": 3238
				}]
			},
			{
				"id": 3240,
				"name": "可克达拉市",
				"pid": 31,
				"children": [{
					"id": 3241,
					"name": "可克达拉市",
					"pid": 3240
				}]
			},
			{
				"id": 3242,
				"name": "昆玉市",
				"pid": 31,
				"children": [{
					"id": 3243,
					"name": "昆玉市",
					"pid": 3242
				}]
			}
		]
	},
	{
		"id": 32,
		"name": "台湾省",
		"pid": 0,
		"children": [{
			"id": 3244,
			"name": "台湾省",
			"pid": 32,
			"children": [{
				"id": 3245,
				"name": "台湾省",
				"pid": 3244
			}]
		}]
	},
	{
		"id": 33,
		"name": "香港特别行政区",
		"pid": 0,
		"children": [{
			"id": 3246,
			"name": "香港特别行政区",
			"pid": 33,
			"children": []
		}]
	},
	{
		"id": 34,
		"name": "澳门特别行政区",
		"pid": 0,
		"children": [{
			"id": 3248,
			"name": "澳门特别行政区",
			"pid": 34,
			"children": [{
				"id": 3249,
				"name": "澳门特别行政区",
				"pid": 3248
			}]
		}]
	}
]



export default {
	area
}
