<template>
	<view>
		<scroll-view v-if="z_text_type" class="minh100 minh100_box" scroll-y="true">
			<view v-if="text_show" style="min-height: 100vh;">
				<view class="details" v-if="id==1">
					<image style="width: 100%;" :src="getimg('/static/web/ybt_tk.jpg')" mode="widthFix"></image>

				</view>
				<view class="details" v-if="id==2">
					<view style="text-align: center;font-size: 40upx;margin-bottom: 20px;">有些路不能省略故事</view>
					<view style="font-size: 24upx;color: #999;">2020-06-04 故事精选</view>
					<br>　　每年9月3日，卡尔顿都会来到南迦·帕尔巴特，对着巍峨的雪山，他轻轻道：“老朋友，你还好吗？我来看你来了。”他把一束鲜花、几本地理杂志放在一块石头上，拿出经书念诵经文，虔诚地祈祷。

					<br>　　异国朋友秋野，长眠于此已有10年。

					<br>　　10年前，卡尔顿工作的合资公司来了一位日本工程师秋野。他是个狂热的登山爱好者，他来巴基斯坦工作，主要缘于对南迦·帕尔巴特雪山的神往。南迦·帕尔巴特位于喜马拉雅山脉西段巴基斯坦境内，海拔8126米，因坡度小于珠穆朗玛峰，许多登山爱好者喜欢把它作为挑战目标。此前，卡尔顿曾多次挑战南迦·帕尔巴特，均因体力不支以失败告终。同样的登山爱好，使两人结下了友谊。

					<br>　　那年9月3日，充分准备后，秋野与卡尔顿来到南迦·帕尔巴特。湛蓝的天空下，被积雪覆盖的山脉闪着圣洁的光芒，秋野鲜红的羽绒服在白雪的映衬下格外醒目。卡尔顿在山下随时注意天气动向，他看到秋野一步一步向山上攀登。

					<br>　　下午，情况突变，南迦·帕尔巴特被浓云笼罩。卡尔顿通过望远镜寻找秋野的身影，却一无所获。对讲机里传来秋野的声音：“现在山上下起了大雪，风很大，能见度很低，我找不到路了。”秋野的声音被劲风吹得时断时续。

					<br>　　卡尔顿焦急地对他说：“你赶紧下撤吧。”

					<br>　　“不，我再等等，已爬了一大半了，我不能放弃。”秋野答道。

					<br>　　秋野告诉卡尔顿，他已支起了帐篷，以躲避这场暴风雪。许久，秋野又对卡尔顿说：“现在风小了，雪也停了，但山上还是阴云密布，看来今天不能继续登了。今晚我就在这儿安营扎寨，明天再登山。”

					<br>　　卡尔顿立即劝阻他：“不行，如果晚上再下大雪怎么办？你赶快下山！”

					<br>　　秋野在那边轻松地笑了：“不，如果下去，明天我又要重复走这段路。放心，我的运气不会那么差，你为我多念几篇经文，求真主赐我好运。”

					<br>　　几十分钟后，秋野说，他已重新选择了休息的地方，是块背风、平坦的开阔地，钻出帐篷就可望到山顶。

					<br>　　那一晚，天气奇迹般好转，皎洁的月光倾泻而下，洁白的`南迦·帕尔巴特雪山在明月的映照下，如处子般纯洁、安宁。（励志故事 )秋野兴奋地把山上的美景描述给卡尔顿听，令他心驰神往，恨不得飞上山，尽情饱览雪山美景。

					<br>　　第二天清晨，卡尔顿用对讲机呼叫秋野，对方却悄无声息。卡尔顿有种不祥的预感，他反复呼叫，寂静的山中只回荡着他的声音。不久，噩耗传来，昨天晚上，南迦·帕尔巴特发生雪崩，秋野不幸遇难。

					<br>　　卡尔顿悲痛万分。事后，专家在现场勘察得出结论，秋野在选择休息地时，犯了两个大错，一是选择在山脊，因为山脊是最容易发生雪崩的地方；二是选择在平坦开阔地，因为貌似平坦开阔的地方，往往隐藏暗沟，当山上的积雪轰然坠下，暗沟上的人就会被掩埋在暗沟里。

					<br>　　卡尔顿有3个儿子，在每个孩子举行成人礼时，他会选择在秋野祭日那天，带其来到南迦·帕尔巴特，“孩子，未来成长的路途中，你需要攀登许多高山，但一定要记住，止步于险境前观望等待，终将失去前进和撤退的最佳时机。当抵达胜利的峰顶无望时，应明智地选择撤退，养精蓄锐，在下一个适宜的时候进行新一轮冲刺。不要惋惜以前的努力需要重来，有些路，注定不能省略。”

				</view>
				<view class="details" v-if="id==3">
					<view style="text-align: center;font-size: 40upx;margin-bottom: 20px;">古人发奋刻苦读书故事</view>
					<view style="font-size: 24upx;color: #999;">2020-06-03 故事精选</view>

					<view style="text-align: center;font-size: 32upx;margin-bottom: 20px;margin-top:20upx;">古人发奋刻苦读书故事1</view>
					<br>　　顾炎武是明末清初的大学者，他学识渊博，在经学、史学、音韵以及诗文诸学上，都有较深的造诣，是当之无愧的一大名儒。顾炎武从小就勤奋学习，对待学问非常认真。长大后，每当外出旅行时，他都用马或骡子驮着沉甸甸的书，真正做到“读万卷书，行万里路”。
					<br>
					<br>　　在游历中，顾炎武还非常重视第一手资料的搜集和整理。如果他走到某地，发现那里的地理、风俗等情况与自己以往知道的不同，就会打开相关的书本进行核对、校正。
					<br>
					<br>　　顾炎武就这样手不释卷，刻苦攻读，终于积累了丰富的知识。顾炎武凭着孜孜不倦的探索精神，在众多学术领域成就非凡，开启了一代朴实学风。
					<br>
					<br>　　青少年学习要像顾炎武一样具有求真务实、刻苦钻研的精神，这样，才能够在狱中掌握更多的知识与技能，从而在未来的社会中施展身手。
					<br>
					<view style="text-align: center;font-size: 32upx;margin-bottom: 20px;margin-top:20upx;">古人发奋刻苦读书故事2</view>
					<br>　　路温舒是西汉时人。他幼年时家里非常贫穷，靠放羊为生。他很有志向，虽然买不起书，但经常从别人那里借书来看。可借阅的书总是要归还的，路温舒常想：要是能有一册书带在身边，一边放羊一边读书，那该多好啊。
					<br>
					<br>　　有一天，路温舒去放羊，偶然发现蒲草的叶子很宽。他灵机一动，心想：蒲草的叶子这么宽，要是把它们编成席子，这样不就可以在上面写字、抄书了吗?于是，路温舒趁着放羊的时候割草、编席，然后再把借来的书抄在编好的席上。
					<br>
					<br>　　通过这种方法，他积累了很多知识，最终成为西汉有名的法官。
					<br>
					<br>　　俗话说：“有志者事竟成。”一个人只要从小立志，并克服一切困难，努力朝着目标奋斗，相信总有一天会成功的。西汉路温舒幼年贫困，但他善于想办法，坚持不懈地学习，最终成为了有名的法官。青少年置身于现代化文明管理的监狱中，拥有良好的学习氛围和多样化的学习机会，要珍惜一切学习时间，用知识充实自己，用技能武装自己，为出监后就业谋生打下坚实的基础。
					<br>
					<view style="text-align: center;font-size: 32upx;margin-bottom: 20px;margin-top:20upx;">古人发奋刻苦读书故事3</view>
					<br>　　邴源是三国时期的魏国人。很小的时候，他的父亲就去世了，这使本来就贫困的家庭更加艰难。邴源是个求知欲很强的.孩子，可是家里连温饱问题都难以解决，更不用说拿钱供他读书了!
					<br>
					<br>　　邴家附近有一所私塾，每天他都能听到从里面传来的读书声。一天，他从私塾门口路过，想起读书的事情，鼻子一酸，不禁大哭起来。私塾先生听到他的哭声，走过来问他怎么了，邴源抽噎着说：“我真羡慕那些能读书的孩子，我的家里很穷，没有能力供我读书，因此我的心里很难过，就哭了起来。”私塾先生听后，觉得象邴源这样渴望读书的孩子很难得，就对他说：“孩子，你要是真想读书，就到我这里来吧，我不收你学费。”邴源一听，激动得不知道说什么才好，连连向老先生表示感谢。
					<br>
					<br>　　邴源天资聪颖，再加上读书很用功，只用了半年时间，就学会了其他孩子几年才能学会的东西。他非常珍惜来之不易的学习机会，利用一切可以利用的时间来汲取知识。长大后的邴源依然很爱读书，经常到各地去拜师求学，后来他的学问日益增多，向他求学的人也多了起来。
					<br>
					<view style="text-align: center;font-size: 32upx;margin-bottom: 20px;margin-top:20upx;">古人发奋刻苦读书故事4</view>
					<br>　　贾逵是东汉时的著名学者，从小就聪颖过人。他非常喜欢读书，但由于家贫而上不起学。
					<br>
					<br>　　有一天，姐姐正带着贾逵玩耍，对面学堂传来了老先生给学生们讲课的声音。姐姐灵机一动，带着贾逵悄悄来到了学堂旁边，想让弟弟在学堂外面偷听。学堂外边有道篱笆墙，贾逵个子小，姐姐就把他抱起来，站在篱笆外听讲。回家后，小贾逵就用借来的笔墨把学到的内容记在自己制作的木片上，反复温习。有什么不明白的地方，他也记在木片上，主动请教别人。
					<br>
					<br>　　就这样，贾逵到十多岁的时候，就成了名闻乡里的小先生了。
					<br>
					<br>　　贾逵的家庭贫困，但他能用借来的笔墨把偷学的内容记录下来，反复温习，不明白的地方主动请教别人。经过努力，最终学有所成。青少年在学习过程中，要珍惜时间，要效仿贾逵的学习精神，克服一切实际困难，真正做到把刑期当学期，不懈地充实和完善自己，就会对今后的人生大有裨益。

				</view>
				<view class="details" v-if="id==4">
					<view style="text-align: center;font-size: 40upx;margin-bottom: 20px;">给小孩子说的睡前故事</view>
					<view style="font-size: 24upx;color: #999;">2021-02-03 故事精选</view>

					　　<br>睡前故事就是专门哄宝宝睡觉准备的故事，这些优美的睡前故事，精彩的故事情节，美好的故事结局，把宝宝带进甜美的梦乡中。以下是小编帮大家整理的给小孩子说的睡前故事（精选10篇），仅供参考，欢迎大家阅读。
					<br>
					　　<view>给小孩子说的睡前故事1</view>
					　　<br>去年，小熊种地，白白地干了一年，一无所获。
					<br>
					　　<br>小熊心想：今年我可不能像去年那么干了，他满有把握地对山羊、小白兔和猴子说：“你们放心，瞧我今年的吧！”
					<br>
					　　<br>但是，究竟种什么呢？小熊总是拿不定主意，一会想种这样东西，一会又想种那样东西。
					<br>
					　　<br>一天，小熊听说山羊在种菠菜，还听说菠菜又鲜又嫩，可好吃了！
					<br>
					　　<br>于是，小熊就在门前的土地上种上了菠菜。过了些天，小熊种的菠菜从地里钻出来了。
					<br>
					　　<br>小熊高兴地望着刚出土的菠菜，搓着大熊掌喊道：“菠菜又鲜又嫩，菠菜又鲜又嫩……”
					<br>
					　　<br>正在这时，小熊听说小白兔没种菠菜，而是种了萝卜。
					<br>
					　　<br>小熊找小白兔一问，小白兔说：“我固然爱吃菠菜，不过，我更爱吃萝卜，萝卜脆生生的……”
					<br>
					　　<br>小熊一听，急忙跑回家，就把菠菜全拔光了，种上了萝卜。
					<br>
					　　<br>见萝卜长出了缨子，小熊非常高兴，他望着刚出土的萝卜缨子，搓着大熊掌喊道：“萝卜脆生生，萝卜脆生生……”
					<br>
					　　<br>正当这时候，小熊又听说猴子没种萝卜，而种了西瓜。
					<br>
					　　<br>小熊马上又去找小猴子问，小猴说：“我当然也挺爱吃萝卜，不过我更爱吃西瓜，西瓜又甜又水灵……”
					<br>
					　　<br>小熊听小猴子这么一说，赶紧往家跑，一口气就把萝卜缨子全从土里拔出来，又种上了西瓜。
					<br>
					　　<br>等他种的西瓜苗出了土，小熊乐坏了，他望着西瓜苗，搓着大熊掌喊道：“西瓜又甜又水灵，西瓜又甜又水灵……”
					<br>
					　　<br>秋天到了，这一年里，山羊、小白兔和小猴子都获得了好收成，而小熊种的西瓜秧还没等长大，就全枯死了。这是因为昨夜下了一场霜。
					<br>
					　　<br>但是小熊始终没有弄明白：“我从春天忙到秋天，为啥没有收获呢？”
					<br>
					　　<br>小熊想要在今年一定要有收获，小熊听他人的建议就换一个种法，结果一年到头，小熊啥也没有收获。其他小伙伴们都收获满满，为什么小熊却没有收获呢？
					<br>
					　　<br>这是因为小熊从春天到秋天只顾着种，而忘了季节变化的原因，小熊没有专心做一件事，所以一无所获，小朋友只要把一件事做好就会收获。
					<br>
					　　<view>给小孩子说的睡前故事2</view>
					　　<br>小老虎壮壮为人仗义，爱帮助别人，森林里的小伙伴们都爱跟他玩儿。
					<br>
					　　<br>森林里有条小河，小鸡绒绒不会游泳，只能对着对岸桑树林里的小虫子流口水。
					<br>
					　　<br>壮壮知道后，经常驮着绒绒渡过小河，直到绒绒吃得饱饱的，再把他驮回来。
					<br>
					　　<br>小猪嘟嘟爱睡懒觉，小伙伴们有什么好吃的，等他起床赶到都只剩下残杯冷炙了。
					<br>
					　　<br>壮壮每次都会特意为嘟嘟留一份，不管嘟嘟什么时候到，都能吃上一份可口的美食。
					<br>
					　　<br>一到夏天，小狗汪汪就热得受不了，伸出长长的舌头，大口大口地喘着粗气，让人看了怪心疼的。
					<br>
					　　<br>壮壮就邀请汪汪到家里喝凉茶，还送他一台小电扇。
					<br>
					　　<br>森林里所有的小伙伴都得到过壮壮的帮助，小伙伴们很听壮壮的话，壮壮俨然成了森林里的孩子王。
					<br>
					　　<br>成了孩子王的壮壮慢慢有点骄傲了，他总是挑小伙伴们的“毛病”。
					<br>
					　　<br>“绒绒，你能不能轻点？每次找食都弄得尘土飞扬的，你再这样，我下次不驮你过河了。”壮壮不明白，为什么绒绒要费那么大劲，去找一只不起眼的小虫子。
					<br>
					　　<br>“壮壮，你别生气，我轻点就是了……”绒绒低下头，很不好意思地道歉。
					<br>
					　　<br>“嘟嘟，嘟嘟……你怎么又打呼噜了？还让不让人睡觉啦！”壮壮一把揪起熟睡中的嘟嘟，愤怒地吼道。
					<br>
					　　<br>嘟嘟默默地走开了，他得找个没人的地方睡觉，免得打扰别人。
					<br>
					　　<br>“壮壮，你怎么把我辛苦捡来的骨头都扔了啊？”汪汪找到壮壮，委屈地问道。
					<br>
					　　<br>壮壮满不在乎地说：“我看那上面一点肉都没有，啃起来没味道。”
					<br>
					　　<br>“唉！那好吧……”汪汪什么也没说，就走了。
					<br>
					　　<br>再后来，小伙伴们不再接受壮壮的帮助了，也不再跟壮壮一起玩儿了。
					<br>
					　　<br>壮壮一个朋友也没有，他懊悔极了。
					<br>
					　　<br>小朋友们不要因为自己有了一点成绩就沾沾自喜，我们要想着还有很多人比我们更厉害，不要满足于现在，要争取取得更好的成绩。如果小老虎能变得谦虚，森林的小伙伴还是会愿意和他做朋友的。
					<br>
					　　<view>给小孩子说的睡前故事3</view>
					　　<br>春天里，猪爸爸对猪哥哥还有猪弟弟说：“儿子，我准备种西瓜，这样到了夏天，天气热的时候我们就有西瓜吃了。”
					<br>
					　　<br>兄弟俩听到爸爸要种西瓜，高兴极了。去年的时候，兄弟俩在猪叔叔家吃的西瓜，那种甜甜的，清爽的味道到现在还记忆犹新呢！兄弟俩就一直想着要是自己家也能有西瓜就好了。
					<br>
					　　<br>很快，猪爸爸就在地里种了一大片西瓜。
					<br>
					　　<br>夏天西瓜熟了的时候，猪爸爸在瓜地里搭了一个小瓜棚。晚上猪爸爸让猪哥哥和猪弟弟去地里看西瓜。
					<br>
					　　<br>猪哥哥和猪弟弟一起来到小瓜棚里。
					<br>
					　　<br>猪哥哥打个呵欠对猪弟弟说：“我先睡一会儿，你先看西瓜。”
					<br>
					　　<br>猪弟弟揉揉眼睛对猪哥哥说：“你先看西瓜，我先睡一会儿。”
					<br>
					　　<br>猪哥哥说：“弟弟要听哥哥的话。”
					<br>
					　　<br>猪弟弟说：“哥哥要听弟弟的话。”
					<br>
					　　<br>猪哥哥和猪弟弟争来争去，谁也说服不了谁。小狐狸开着一辆小货车来到瓜地边。
					<br>
					　　<br>小狐狸对猪哥哥和猪弟弟说：“你们别争了，这样吧，正好我现在有空儿，你们都去睡，我来看西瓜。”
					<br>
					　　<br>猪哥哥和猪弟弟听了，高高兴兴地钻进了瓜棚里。
					<br>
					　　<br>“呼噜呼噜”，猪哥哥和猪弟弟的打鼾声此起彼伏。一个晚上，小哥俩都睡得很甜很香。
					<br>
					　　<br>就在猪哥哥和猪弟弟睡得最香最甜的时候，小狐狸在西瓜地里忙的不可开交，他装了满满一车大西瓜，然后，开着车，不慌不忙地离开了西瓜地。
					<br>
					　　<br>猪哥哥醒来了，地里的西瓜不见了；猪弟弟醒来了，地里只剩下乱七八糟的西瓜苗。
					<br>
					　　<br>猪哥哥说：“西瓜哪去了呢？”
					<br>
					　　<br>猪弟弟说：“自己跑丢了吗？”
					<br>
					　　<br>猪哥哥挠挠头，想了想说：“是被小狐狸吃掉了。”
					<br>
					　　<br>猪弟弟眨眨眼睛，想了想说：“小狐狸吃了一大片西瓜，结果会怎么样？”
					<br>
					　　<br>猪哥哥：“会生病的。”
					<br>
					　　<br>猪弟弟：“会肚子疼。”
					<br>
					　　<br>猪哥哥和猪弟弟一边说，一边向家里跑去。他们决定要把小狐狸吃光一大片西瓜这件事，快点告诉猪爸爸，然后，让猪爸爸快点去救小狐狸。
					<br>
					　　<br>故事里的猪兄弟有好的地方也有不好的地方，不好的地方在于他们都偷懒，没有做好答应爸爸的事情。但是另一方面，猪兄弟很善良，他们第一时间担心的是狐狸的安危。
					<br>
					　　<br>这个故事告诉我们，做人一定要善良，不过我们也要懂得保护自己权益，也不可太过于善良，那样反倒更容易被欺负哦！
					<br>
					　　<view>给小孩子说的睡前故事4</view>
					　　<br>在一个池塘里住着一条小鱼。他有一个好朋友，是一只蝌蚪。这条小鱼和蝌蚪总是在一起游泳，一起找食物，一起玩。
					<br>
					　　<br>一天早上，小鱼吃惊地看见在蝌蚪尾巴的两边长出了一对腿。小鱼问蝌蚪为什么他会有腿。
					<br>
					　　<br>“我不是鱼，我是一只蝌蚪，一只年幼的青蛙。以后，等我长大了，我就不再呆在这儿了。”蝌蚪回答说。
					<br>
					　　<br>“你说谎！”小鱼说。
					<br>
					　　<br>“如果你不相信，就等着瞧吧！”蝌蚪说。
					<br>
					　　<br>小鱼已经三天没有看见蝌蚪了，他很担心。为了寻找朋友，他搜索了每一个地方，蝌蚪能去哪儿呢？
					<br>
					　　<br>几天以后，蝌蚪又出现了。小鱼非常高兴，可是他又吃了一惊，蝌蚪又长出了一对腿，哦，还有，尾巴也变短了。
					<br>
					　　<br>“这几天你到什么地方去了？”小鱼问。
					<br>
					　　<br>“我去陆地上了，我不是告诉你我在这儿呆不长吗？看，现在我有四条腿了。不久我就要长期在地上生活了。”蝌蚪说，“现在请不要再叫我蝌蚪，就叫我青蛙吧。再见了，鱼！”
					<br>
					　　<br>小鱼眨眨眼睛，被他朋友的话搞糊涂了。他不能相信听到和看到的，因为从前他的朋友能像鱼一样游泳，从前他没有腿，而现在却不是这样了。
					<br>
					　　<br>小鱼独自留在池塘里，最后，他变成了一条大鱼。
					<br>
					　　<br>一天，当这条鱼在池塘里游水寻找食物的时候，一只青蛙跳进水里。他就是鱼的老朋友。看到朋友，鱼非常高兴。
					<br>
					　　<br>“你去哪儿啦？”鱼问。
					<br>
					　　<br>“我一直在陆地上。”青蛙说，并且把他在陆地上遇到的事情告诉鱼。
					<br>
					　　<br>鱼听了青蛙的故事后，问：“在那边谁是你的朋友呀？”
					<br>
					　　<br>“我有好多朋友，像牛啦，鸟啦，猫啦，还有其它许多动物。”青蛙说。
					<br>
					　　<br>“我能跟你去陆地吗？我想见见他们。”鱼说。
					<br>
					　　<br>“那怎么行！你在陆地上不能呼吸，你会死的。”青蛙解释说。
					<br>
					　　<br>“可是我想去看看牛啦，鸟啦，还有别的你刚才告诉我的朋友们。”鱼请求道。
					<br>
					　　<br>“你不必亲自去，我给你说说不就行了。”青蛙说。于是青蛙向鱼讲了许多他的陆地朋友的事。鱼试着想象那些动物的样子，但是他总是不满意。
					<br>
					　　<br>“你在陆地上还看见什么别的吗？”鱼又问。
					<br>
					　　<br>“还有人，有孩子，有玩具和别的许多东西。”青蛙继续说。
					<br>
					　　<br>他们一直聊到晚上。鱼很不开心，因为他不能去陆地上看这些奇怪的事，这天晚上他失眠了。他满脑子都是白天听到的各种各样的事情。
					<br>
					　　<br>第二天早上，鱼去寻找食物。忽然，他看见水面上天空飞鸟的倒影。他太想看看鸟了，就鼓起勇气试着跳到河岸上。鱼一纵身跳上了岸。但是在他睁开眼睛之前，他已经喘不过气了。他开始呻吟起来。算他走运，青蛙正好在附近找吃的。
					<br>
					　　<br>青蛙马上跳到奄奄一息的鱼的身边。他一点也没耽搁，把大鱼拉进池塘里。鱼一进水，立刻苏醒了。他很惊讶，问青蛙发生了什么事。
					<br>
					　　<br>青蛙微笑着说：“我跟你说过，你不能到陆地上去。不管你是在陆地上还是在水里都没关系，一切都是美好的，美丽的，为什么你不愿意听我的话！”
					<br>
					　　<br>“可是只呆在这儿我觉得不满意。”鱼继续说。
					<br>
					　　<br>“你应该满足了，”青蛙劝鱼说：“没有多少生命能像你一样呆在水里。”
					<br>
					　　<br>鱼笑了，高兴地在水草间游来游去，他认识到他的朋友说的是真的。
					<br>
					　　<view>给小孩子说的睡前故事5</view>
					　　<br>有一只小蜈蚣，它长了好多好多脚。在这些脚的帮助下，它可以飞快的在地面，树干，草丛中爬行。
					<br>
					　　<br>有一天它在一个泥坑里爬行的时候，所有的脚都沾满了泥，它觉得有点脏。就想：怎么样，我的脚才会干净点呢？
					<br>
					　　<br>想啊，想啊，突然它想起来，一只飞到过人群中的麻雀说过：城市里的人，都穿着鞋子，这样他们的脚就不脏了。所以这只蜈蚣就想，我也去买鞋子穿吧。
					<br>
					　　<br>它来到小兔子开的胡萝卜店里，问小兔子有没有我能穿的鞋子啊？
					<br>
					　　<br>小兔子说：鞋子？我这里没有，那是什么东西，用胡萝卜可以做吗？小蜈蚣说：我也不知道，不过你可以帮我试试。
					<br>
					　　<br>小兔子拿着雕刻刀，按照小蜈蚣的脚的大小和数目，做了32只鞋子。做完这些鞋子，小兔子累的满头大汗，不过看着小蜈蚣把这些都穿上了，开始爬行，它也很高兴。只是小蜈蚣没走多远，那些胡萝卜做的鞋子，由于太脆，全都破掉了。
					<br>
					　　<br>小兔子对它说：胡萝卜用来做鞋子，不可以。你去蚂蚁的树叶店里看看吧。
					<br>
					　　<br>小蜈蚣很快的爬到了小蚂蚁的树叶店里，跟它们说：我想买32只鞋子，你们能试着用树叶帮我缝制这鞋鞋子吗？小蚂蚁们说：我们试试吧。
					<br>
					　　<br>它们开始分工合作，裁剪的裁减，缝制的缝制，给小蜈蚣做好了鞋子，并帮它穿上。绿绿的叶子做的鞋子非常漂亮，大家都很喜欢。可是这些树叶太薄了，在小蜈蚣爬过尖尖的石头的时候，它们很轻易的被划破了。结果，树叶做的鞋子，也不可以。小蚂蚁们对它说：你去小羊的羊绒店里看看吧，看看小羊有没有办法。
					<br>
					　　<br>小蜈蚣爬啊爬的到了小羊的羊绒店里，对小羊说：小羊，我想做32只鞋子。小兔子的胡萝卜，小蚂蚁们的树叶都不可以，请问你这里的羊绒可以吗？小羊说：我也不知道，我来试试吧。
					<br>
					　　<br>小羊用缠好的羊绒线，开始给小蜈蚣织鞋子。由于小蜈蚣的脚很多，小羊织了好久才织好这些鞋子。小蜈蚣穿上这些鞋子，感觉软软的，特别舒服。
					<br>
					　　<br>它爬啊爬，爬了半天发现，鞋子一点都没破，就是脏了好多。不过没关系，有了这些鞋子，小蜈蚣就不怕把脚给弄脏了。
					<br>
					　　<br>它谢过小羊，穿着这些鞋子，高兴的爬走了！
					<br>
					　　<view>给小孩子说的睡前故事6</view>
					　　<br>从前，有个生意人因为要去外地处理一些事情，所以就把自己的一口袋金币托付给一位朋友代为保管。几个星期后，当这个生意人回来后，朋友就把口袋还给了他，可当他回到家里打开口袋后，却发现金币都变成了铜币。
					<br>
					　　<br>半年以后，那位朋友因为一些事情而要出门一天，就把自己3岁大的孩子托付给生意人照看。可朋友走后，生意人就买来了一只猴子，把小孩儿身上的衣服和饰物穿戴在猴子的身上。等到朋友晚上回来时，生意人一脸真诚地说：“孩子已经变成了猴子。”
					<br>
					　　<br>朋友当然不肯相信，于是大声地冲生意人喊到：“人怎么能为成猴子？你快把我的孩子还给我！”
					<br>
					　　<br>可这时的生意人却只说了一句话，就使得朋友乖乖地交还了那袋金币。
					<br>
					　　<br>那么，他到底说了一句什么样的话呢？
					<br>
					　　<view>给小孩子说的睡前故事7</view>
					　　<br>笨狼沿着小路走了一会儿，来到了一条小河边。
					<br>
					　　<br>笨狼跑到河边去喝水。
					<br>
					　　<br>一只小羊也在河边喝水。
					<br>
					　　<br>小羊看到笨狼，害怕极了，掉头就跑。他因为太害怕了，四条腿发软，扑通一声掉进了河里。河水很急，小羊的脖子上套着的那根绳子，勒得它喘不过气来。
					<br>
					　　<br>笨狼立即跳进河里，把小羊捞了上来。
					<br>
					　　<br>小羊湿漉漉的，害怕得全身发抖。
					<br>
					　　<br>笨狼问小羊：“你冷吗？”
					<br>
					　　<br>小羊心想，我不是冷，是害怕。但小羊不敢回答，只是一个劲地发抖。笨狼以为小羊发抖是因为怕冷。他抱住小羊，想让小羊暖和点。
					<br>
					　　<br>小羊看到笨狼抱自己，以为笨狼要吃他。他记得妈妈跟他讲过《狼和小羊》的故事，故事里的狼吃羊总要找一个理由。可是这只狼真可怕，连理由都不找一个就要吃羊了。
					<br>
					　　<br>小羊说：“亲爱的狼先生，刚才喝水的时候，您站在水的上游，我站在水的下游，我没有把您喝的水弄脏呀。”
					<br>
					　　<br>笨狼：“我没说你把水弄脏了呀。”
					<br>
					　　<br>小羊又说：“亲爱的狼先生，我也没有在背地里说过您的坏话呀。”
					<br>
					　　<br>笨狼说：“我没有说你说过我的坏话呀。”
					<br>
					　　<br>小羊又说：“我没爸爸，也没有爷爷，他们就更不可能说您的坏话了。”
					<br>
					　　<br>笨狼觉得莫明其妙：“你这只小羊是不是脑子里进水了，你说的都是些什么呀？”
					<br>
					　　<br>小羊大着胆子质问笨狼：“那你为什么要吃我？”
					<br>
					　　<br>“我要吃你？”笨狼大吃一惊，“你以为我要吃你吗？我才不吃你呢！我看你冷得发抖，只想把你身上弄干。”
					<br>
					　　<br>“只要你不吃我，我就不会发抖了。”小羊说，“再见，亲爱的狼先生，谢谢你刚才救了我。”
					<br>
					　　<br>笨狼问小羊：“你去哪儿？我跟你一起去吧。”
					<br>
					　　<br>小羊心想：难怪他说不吃我呢。这只可恶的狼一定是嫌我太瘦小了，没有多少肉。他现在想跟着我回家，看看我家里还有谁可以让他吃。但是，我家里的羊早就被他吃光啦。
					<br>
					　　<br>小羊说：“我哪儿也不去，我跟你说再见是想让你快点走开。你没看见我被绳子拴住了吗？”
					<br>
					　　<br>经小羊提醒，笨狼总算注意到了――确实，小羊的脖子上拴着根绳子，绳子的另一头拴在河边的一棵树上。笨狼说：“你干嘛要用绳子把自己拴住呢？这多不自由啊。”
					<br>
					　　<br>小羊说：“这不是我拴的，是护林员拴的。”
					<br>
					　　<br>“我帮你解开吧。”笨狼说。于是，笨狼张开嘴，把绳子咬断了。
					<br>
					　　<br>小羊获得了自由，立即退后几步，和笨狼保持着安全的距离，心里不那么害怕了。同时，小羊心里在想：我要为我的妈妈和哥哥们报仇。
					<br>
					　　<br>近半年来，小羊的妈妈和哥哥们一个接一个失踪了。现在只剩下孤零零的小羊了。
					<br>
					　　<br>前些日子，小羊亲眼看见一只大灰狼把一只羊叼走了。小羊想，妈妈和哥哥们一定都是被大灰狼吃掉的。
					<br>
					　　<br>“我虽然小，打不过大灰狼，但只要肯动脑筋，就一定能打败大灰狼。”小羊想起了妈妈给他讲过的《狼和小羊》的`故事，鼓励自己：“别害怕！”
					<br>
					　　<br>自从上次被大灰狼偷走一只小羊之后，护林员又有好几次看见过大灰狼的踪迹。护林员想抓住大灰狼。他在林场前面的空地里挖了个大陷阱，准备抓住大灰狼。
					<br>
					　　<br>护林员看见的大灰狼是笨狼的大伯，也就是住在深山镇的灰狼老大。灰狼老大是一只成年的大公狼。他刚刚领到森林王国的狩猎许可证。领到了狩猎许可证的大灰狼特别想捕猎。因为森林王国严禁动物之间相互杀戮，大灰狼便想到人类的村庄里一试身手。大灰狼到处溜达，寻找目标。有一天，他来到护林员住的地方，闻到院子里的阵阵肉香，馋得口水直流。一个月前，他终于偷走了一只羊。吃过了羊之后，他一直忘不了羊肉的美味。他看到离护林员住的小屋不远处有一个羊圈，羊圈里还有一只小羊；羊圈的旁边有一个猪圈，猪圈里住着一只小猪。于是，大灰狼经常在林场附近转悠，想伺机下手。
					<br>
					　　<br>小羊对笨狼说：“亲爱的狼先生，您能送我回家吗？”
					<br>
					　　<br>“好的。我一直都乐于助人。”笨狼回答。
					<br>
					　　<br>河上有一座小木桥，小羊回家要经过小木桥。
					<br>
					　　<br>小木桥虽然不是独木桥，但比独木桥强不了多少。桥身只有两根木头，走在上面，两根木头都会晃动。
					<br>
					　　<br>小羊在桥上走了两步，看到桥晃动，连忙退了回来，对笨狼说：“我害怕，我不敢走在前面。”
					<br>
					　　<br>笨狼一马当先：“我在前面走，你跟着我。”
					<br>
					　　<br>笨狼走到桥中间，桥晃得更厉害了。因为小羊在桥的那边用蹄子使劲儿踢呢。他想把桥踢翻，让笨狼掉进河里。
					<br>
					　　<br>桥比小羊想象的要坚固得多。笨狼也不怕晃动，反而觉得晃得很好玩。笨狼身子虽然晃了好几下，但他站住了，并没有掉下桥去。
					<br>
					　　<br>小羊见一计不成，又生一计。小羊跳上桥，低着头，朝笨狼撞过去！
					<br>
					　　<br>小羊将笨狼撞下了桥！
					<br>
					　　<br>“扑通！”笨狼掉进河里，溅起好大的水花。
					<br>
					　　<br>小羊冲过小木桥，飞快地朝家里跑去。
					<br>
					　　<br>小河并不宽，笨狼又会游泳。笨狼一会儿就游上了岸。
					<br>
					　　<br>笨狼游到岸边上，抖干身上的水。他用鼻子在草丛里闻一闻，很快就找到了小羊的踪迹。
					<br>
					　　<br>笨狼说：“我把小羊从河里救上来，他却把我推进河里，他是不是想告诉我河里很好玩呢？”
					<br>
					　　<br>笨狼沿着小路往前走，不一会儿来到了一片开阔的土地上。森林里难得有这么一片开阔的土地。护林员在这儿开辟了一个菜园子种蔬菜。菜地旁边有一棵大樟树。笨狼走到离樟树不远处的草地上，小羊的踪迹突然消失了。
					<br>
					　　<br>“救命呀！救命呀！”笨狼听到了呼救声。
					<br>
					　　<br>拨开齐腰深的草丛，笨狼发现了一个很深的陷阱。小羊正在陷阱里喊：“救命呀！快来救我呀！”
					<br>
					　　<br>小羊把笨狼撞下桥以后，心里又紧张又害怕，拼命朝前跑。它跑得太急了，没有注意到护林员在草地上挖的捕狼陷阱，结果一头栽进了陷阱里。
					<br>
					　　<br>总也不见护林员来救自己，小羊哭了起来：“惨了，我再也出不去了，我要活活饿死在陷阱里了。早知道这样，还不如让那只大灰狼把我给吃了呢。”
					<br>
					　　<br>笨狼朝陷阱里看。陷阱很深，口子很小，笨狼看了许久才看到小羊。笨狼看见小羊，大吃一惊。小羊看见笨狼，也大吃一惊。
					<br>
					　　<br>小羊心想：我刚才真不该说不如让大灰狼给吃掉。我这样一说，大灰狼就真的来了。这可怎么办呢？看来这一回我真的会被大灰狼吃掉了。
					<br>
					　　<br>笨狼一点也不想吃小羊，他只想把小羊救上来。当然，笨狼的办法有点笨。他居然跳进陷阱里了。
					<br>
					　　<br>我说过了，陷阱很深，口子很小。而且这个陷阱是护林员专门挖了来捕大灰狼的，设计得很巧妙。动物掉进去，就别想能逃出来。
					<br>
					　　<br>好啦，现在小羊掉进了陷阱里，笨狼也掉进了陷阱里。
					<br>
					　　<br>当笨狼跳进陷阱时，小羊真看不起笨狼。小羊心想：这家伙真是又贪婪又笨，为了吃我，居然自己往陷阱里跳！
					<br>
					　　<br>但笨狼看到小羊非常高兴。他一把抱住小羊，说：“小羊，我来救你！”
					<br>
					　　<br>陷阱里的空间那么狭小，小羊知道自己再也无处可逃了，就干脆闭上眼睛，等着笨狼吃他。等了好一会儿，小羊也没有等到笨狼下嘴撕咬自己，睁开眼倒是看到笨狼在陷阱里不断蹦跶，企图往上跳。他以为这样能跳出陷阱。
					<br>
					　　<br>于是，聪明的小羊想到了一个主意。他对笨狼说：“如果你真想救我，我有办法。”
					<br>
					　　<br>“什么办法？”
					<br>
					　　<br>“你蹲下来，让我踩到你的背上，我就能跳出陷阱了。我跳出去之后，再找人来救你。”
					<br>
					　　<br>笨狼立即蹲下来，让小羊踩在自己的背上。可是，陷阱那么深，小羊踩在笨狼的背上，还是够不着陷阱口。
					<br>
					　　<br>小羊说：“我得踩到你的肩膀上才行！”
					<br>
					　　<br>笨狼让小羊踩在自己的肩上往上跳，可是还差一点点。
					<br>
					　　<br>小羊说：“只差一点点了，我如果能踩在你的脑袋上，就一定能跳出去！”
					<br>
					　　<br>于是，笨狼就让小羊踩在自己的脑袋上。
					<br>
					　　<br>小羊踩着笨狼的脑袋，轻轻一跳，果然跳出了陷阱。
					<br>
					　　<br>“小羊，你把我拉上去吧！”笨狼说。
					<br>
					　　<br>“你等着吧！”小羊说，“我去找人来救你！”
					<br>
					　　<br>笨狼在陷阱里等着小羊找人来救他。小羊呢，蹦蹦跳跳地跑回家去了。
					<br>
					　　<br>“哼，大灰狼，我要让你活活饿死在陷阱里！”小羊跑远了以后，恶狠狠地说。
					<br>
					　　<view>给小孩子说的睡前故事8</view>
					　　<br>一天，厨房里来了一只可恶又可恨的老鼠，咬伤了好多蔬菜兄弟。
					<br>
					　　<br>萝卜说：“我们要好好整整这只可恶又可恨的老鼠！”“我要用热水浇它，烫死它！”茶壶愤怒地说。勺子和叉子说：“我们用头砸它，扎它，把它砸成肉浆，扎成肉饼！”这时，老鼠也在偷听它们开会，老鼠想：我赖在洞里，看你们怎么打我，反正我洞里食物也有，什么必需的东西都有。
					<br>
					　　<br>蔬菜们说着就干了起来，可是等了半天，连老鼠的半个影子都没有，就想：老鼠肯定是怕我们了，“胆小如鼠”这个真是说得太好了。正在这时，老鼠在洞里一边哼着小曲，一边懒洋洋地躺在沙发上看电视，心想：它们一进来就把它们吃掉！
					<br>
					　　<br>晚上，厨房里静悄悄的，老鼠开始行动了。它悄悄地走到萝卜身边，一把捏住萝卜的嘴巴后，狠狠地咬了下去。萝卜忽然觉得身体疼痛难忍，一看，原来是老鼠在咬它。它想喊出声来叫大家来打老鼠，但又叫不出来，因为它的嘴被老鼠用纸塞住了。
					<br>
					　　<br>第二天，大家发现萝卜不见了，非常着急，也非常生气。大家七嘴八舌地说：“肯定是可恶的老鼠干的！……”大伙越说越起劲，都说要打死老鼠，可又拿它没办法。辣椒想：如果再让老鼠这样下去，大家都会被当成食物被老鼠吃掉的。辣椒又想：我是辣的，老鼠只要咬我一口，就会被辣得从洞里滚出来，趁那时候大家就可以好好教训它了。想到这里，辣椒就带着大家来到老鼠洞边。大家觉得非常奇怪，就问：“辣椒，你想出好办法啦？”辣椒就把自己的办法告诉了大家。大家都不同意让辣椒去送死。辣椒说：“只有这样了，不然会死更多的。”
					<br>
					　　<br>辣椒大喊一声，说：“老鼠，我要进来跟你较量较量！”说着辣椒就冲进了老鼠洞。老鼠早就在洞中准备好了，心想：会有这种笨蛋来送死？辣椒一进来，老鼠就扑向辣椒，使劲地咬了下去。老鼠立刻被辣得眼泪都流了出来，连爬带滚地跑出了洞。大家一轰而上，把老鼠打得面目全非。老鼠连连求饶，抱头逃窜，一溜烟地钻进了下水道，但是它还不忘大叫一声：“我还会再回来的！”
					<br>
					　　<br>厨房里又恢复了往日的宁静，但厨房里的较量还在继续着。
					<br>
					　　<view>给小孩子说的睡前故事9</view>
					　　<br>古时候，有个孩子叫孙元觉，他不仅聪明伶俐，而且从小就知道尊敬长辈孝顺父母。可让孙元觉很失望的是，自己的父亲却对祖父极不孝顺。
					<br>
					　　<br>一天，当孙元觉和父亲以及祖父一起路过深山里的一个悬崖时，父亲竟突然要把祖父装在随身携带的大筐里，然后再推下悬崖。孝顺的孙元觉跪着哭求父亲，可父亲却一定要这样做。
					<br>
					　　<br>就在这危急的时刻，孙元觉突然停止了哭泣，接着又说了一句话。虽然只有短短一句，可他的父亲听了这话以后却突然取消了自己原来的打算。不仅如此，他还把孙元觉的祖父恭恭敬敬地背回家中，从此以后就变得很孝顺。
					<br>
					　　<br>现在请你猜猜孙元觉到底说了一句什么的话，才让他的父亲变得孝顺起来了呢？
					<br>
					　　<view>给小孩子说的睡前故事10</view>
					　　<br>小熊的朋友给了小熊一些喇叭花种子，小熊很开心的将它们种到了自己家的院子里。他盼望着喇叭花开花的那天。
					<br>
					　　<br>小熊每天都会到喇叭花面前，和它们说说话，给它们浇浇水，除除草。慢慢的喇叭花种子发芽了，长出了嫩嫩的枝叶。从一片到两片，三片。越来越多。不久之后，喇叭花藤上挂了几个花骨朵。小熊知道这是喇叭花开花了。他可高兴了。终于盼来了喇叭花开花。
					<br>
					　　<br>慢慢的，花骨朵开放了，有红橙黄绿青蓝紫七种颜色呢！
					<br>
					　　<br>开花了，红喇叭鲜艳极了，迎着太阳咪咪笑。小熊每天都去看她，亲她，和她说说话。
					<br>
					　　<br>红喇叭花高兴地随风摇摆跳舞，一停下来，便仰着头，乐呵呵地笑着。
					<br>
					　　<br>慢慢地，橙黄绿青蓝紫喇叭花也开了，小熊高兴地摸摸这个，亲亲那个，小脸整天都灿烂无比。这些美丽的花儿看到小熊这么喜欢她们，都尽力往上爬，把花开得大一些，在阳光的照射下，她们变得更加楚楚动人。
					<br>
					　　<br>紫喇叭花个头最小，爬得最慢，颜色最不艳丽。大家都看不起她，每天都骂她是小丑蛋，尤其是美丽的红喇叭花，每天对她指指点点，骂她是个笨家伙，丑八怪。
					<br>
					　　<br>有一天晨曦初露，小熊和美丽的喇叭花被一阵清脆的音乐声吵醒了。小熊连忙睁开眼睛：“啊，天亮了，我要起床锻炼身体了！是谁唱了这么好听的歌催促我早起？”
					<br>
					　　<br>小熊赶紧来到庭院里，看见躲在角落里的紫喇叭花正在吹着好听的“滴滴答”的歌曲。小熊赶紧走过去摸摸紫喇叭花：“谢谢你！紫喇叭花，是你叫醒我早起早锻炼。”
					<br>
					　　<br>说完，还特地为紫喇叭花浇上了水：“喝吧，喝了水长吧，快快长大！每天陪我早锻炼，让我的身体练得棒棒的！”
					<br>
					　　<br>等小熊走了之后，其余的花都纷纷上去夸奖紫喇叭花：“唱得真好！你什么时候学会早晨唱歌的？”
					<br>
					　　<br>红色的喇叭花却不以为然：“什么歌嘛，不就是会唱‘滴滴答’吗？我正做着美梦呢！被你吵醒了！如果明天再这么早‘滴滴答’唱个不停的话，别怪我不客气！”红喇叭花毫不客气地仰着头恶狠狠地说。
					<br>
					　　<br>小伙伴们都吓得噤若寒蝉。
					<br>
					　　<br>下午，小熊的好朋友小兔过来玩，小熊把小兔带到紫喇叭前，告诉他紫喇叭花会唱歌。小兔说：“你应该把她搬到房间里，这样喇叭花一唱歌，你就能马上醒来了！不然离房间太远了，声音太轻了。”
					<br>
					　　<br>小熊连忙鼓掌：“好啊！真是不错的点子！”
					<br>
					　　<br>小熊的房间又宽敞又明亮，里面有很多玩具，红喇叭花最喜欢小熊的房间，她连做梦都想到那里去呢！
					<br>
					　　<br>她怎么也没有想到，紫喇叭花会唱歌，就能住进去。
					<br>
					　　<br>小熊刚要搬紫喇叭花，紫喇叭摇摇头说：“小熊，让我教姐妹们唱歌吧，以后我们每天爬到你的房门口，轮流给你唱歌，你一定会更高兴的！”
					<br>
					　　<br>“是吗？”小熊没有想到紫喇叭居然会这样做，他高兴地拍起了手：“那太好了！不用你太累了哦！”
					<br>
					　　<br>红喇叭花惭愧地低下了头，她连忙向紫喇叭道歉，并向她讨教唱歌的经验。
					<br>
					　　<br>从此以后，七色喇叭花努力向小熊房间攀爬，小熊每天在七色喇叭花唱起的美妙歌声中早起锻炼，房间外，每一朵喇叭花都笑得那样灿烂、那样美丽……

				</view>

			</view>
		</scroll-view>
	</view>
</template>

<script>
	import Vue from 'vue'
	import service from '../../service.js';
	import {
		mapState,
		mapMutations
	} from 'vuex'
	var that
	export default {
		data() {
			return {
				id: 1,
				z_text_type: true,
				text_show:true
			}
		},
		mounted() {
			that=this
			var xcx_test = uni.getStorageSync('xcx_test')
			if (xcx_test == 1) {
				that.z_text_type = true
				that.text_show=true
			} else {
				that.z_text_type = false
			}
			// that.z_text_type=xcx_test||true
			this.getdata()
			this.id = 1
			
		},
		methods: {
			getimg(img) {
				return service.getimg(img)
			},
			getdata() {
				var that = this
				that.text_show=false
				var data = []
				var jkurl = '/test'

				service.P_get(jkurl, data).then(res => {
					that.btn_kg = 0
					console.log(res)
					if (res.code == 1) {
						// that.htmlReset=0

						/*var datas = res.data
						console.log(typeof datas)
			
						if (typeof datas == 'string') {
							datas = JSON.parse(datas)
						}*/
						console.log('res.test==1-------------------------------------->')
						console.log(res.test == 1)
						// uni.setStorageSync('xcx_test',2)
						uni.setStorageSync('xcx_test',res.test)
						// return
						if (res.test == 1) {
							that.z_text_type = true
							that.text_show=true
						} else {
							that.z_text_type = false
						}


					} else {
						if (res.msg) {
							uni.showToast({
								icon: 'none',
								title: res.msg
							})
						} else {
							uni.showToast({
								icon: 'none',
								title: '操作失败'
							})
						}
					}
				}).catch(e => {
					that.btn_kg = 0
					console.log(e)
					uni.showToast({
						icon: 'none',
						title: '获取数据失败'
					})
				})
			},
		}
	}
</script>

<style scoped>
	.minh100_box{
		position: fixed;
		height: 100vh;
		top: 0;
		z-index: 9999999999;
	}
	.details {
		width: 100%;
		// padding: 0 30upx 30upx;
		font-size: 30upx;
		color: #333;
		
		background: #fff;
	}
</style>
